<?php

namespace Database\Seeders;

use App\Models\Location;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
//        $items = [
//            'القاهرة الكبرى',
//            'الاسكندرية',
//            'الساحل الشمالى',
//            'مرسى مطروح',
//            'العين السخنة',
//            'الغردقة / البحر الأحمر',
//            'راس سدر',
//            'شرم الشيخ',
//            'الدقهلية',
//            'الشرقية',
//            'الغربية',
//            'الاسماعيلية',
//            'دمياط',
//            'السويس',
//            'البحيرة',
//            'أسوان',
//            'الاقصر',
//            'أسيوط',
//            'المنوفية',
//            'قنا',
//            'سوهاج',
//            'شمال سيناء',
//            'الفيوم',
//            'بور سعيد',
//            'كفر الشيخ',
//            'بني سويف',
//            'المنيا',
//            'الوادي الجديد',
//            'القليوبية',
//            'خارج مصر',
//            'جنوب سيناء',
//            'رأس غارب / البحر الأحمر',
//        ];
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => null,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//        $subs_cairo = [
//            'القاهرة الجديدة',
//            '6 أكتوبر',
//            'مدينة الشيخ زايد',
//            'مصر الجديدة',
//            'مدينة نصر',
//            'المعادي',
//            'العبور',
//            'فيصل',
//            'الزمالك',
//            'المهندسين',
//            'الدقي',
//            'الهرم',
//            'الجيزة',
//            'المقطم',
//            'حلوان',
//            'عين شمس',
//            'مدينة بدر',
//            'العاشر من رمضان',
//            'جاردن سيتي',
//            'وسط البلد',
//            'الزيتون',
//            'حدائق القبة',
//            'حدائق الأهرام',
//            'شبرا',
//            'إمبابة',
//            'العجوزة',
//            'المنيل',
//            'العباسية',
//            '15 مايو',
//            'السيده زينب',
//            'الخليفة',
//            'العمرانية',
//            'دار السلام',
//            'الاميريه',
//            'المطرية',
//            'الوايلي',
//            'المرج',
//            'مدينة السلام',
//            'الشرابيه',
//            'الزاوية الحمراء',
//            'منشية ناصر',
//            'البساتين',
//            'بشتيل',
//            'المنصوريه',
//            'كرداسه',
//            'هليوبوليس الجديدة',
//            'مصر القديمة',
//            'مناطق فرعية بالقاهرة الكبرى',
//            'العاصمة الإدارية الجديدة',
//            'مدينة الشروق',
//            'أوسيم',
//            'العياط',
//            'طريق اسكندرية الزراعي',
//            'الطريق الدائري الأوسطي',
//        ];
//        $parent = Location::where('name', 'القاهرة الكبرى')->first();
//        foreach ($subs_cairo as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//        $items = [
//            'البنفسج',
//            'اللوتس',
//            'المستثمرين الشمالية',
//            'المستثمرين الجنوبية',
//            'النرجس',
//            'أرض الزهور',
//            'الياسمين',
//            'المنطقة الصناعية',
//            'تقسيم الأندلس',
//            'التمر حنه',
//            'التجمع الاول',
//            'التجمع الثالث',
//            'غرب أربيلا',
//            'أرابيلا',
//            'غرب الجولف',
//            'جنوب الأكاديمية',
//            'شرق الأكاديمية',
//            'القطامية',
//            'كمبوند بالتجمع الخامس',
//            'خلف ميراج سيتي',
//            'الدبلوماسيين',
//            'مدينة الرحاب',
//            'مدينتي',
//            'مناطق فرعية بالقاهرة الجديدة',
//            'بيت الوطن',
//            'دار مصر',
//            'مدينة المستقبل',
//            'الأندلس الجديدة',
//            'إمتداد القاهرة الجديدة',
//            'المربع الذهبي',
//            'طريق السويس',
//            'اللوتس الجديدة',
//            'داون تاون',
//            'محور محمد نجيب',
//            'الحي الاول',
//            'النرجس الجديدة',
//            'شمال الرحاب',
//            'حي اسكان الجامعة الامريكية',
//            'شارع مجمع البنوك',
//            'امتداد المستثمرين الشمالية',
//            'القطاع الثالث',
//            'جمال عبد الناصر',
//            'القطامية الجديدة',
//            'مثلث الأمل',
//            'التجمع الخامس',
//            'القطاع الأول',
//            'محور السادات',
//            'القطاع الثاني',
//            'القطاع الرابع',
//        ];
//        $parent = Location::where('name', 'القاهرة الجديدة')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//        $items = [
//            'البنفسج عمارات',
//            'البنفسج 1',
//            'البنفسج 2',
//            'البنفسج 3',
//            'البنفسج 4',
//            'البنفسج 5',
//            'البنفسج 6',
//            'البنفسج 7',
//            'البنفسج 8',
//            'البنفسج 9',
//            'البنفسج 10',
//            'البنفسج 11',
//            'البنفسج 12',
//            'منطقة خدمات البنفسج',
//            'البنفسج فيلات',
//        ];
//        $parent = Location::where('name', 'البنفسج')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//        $items = [
//            'شارع الجابري',
//            'قطعة 342',
//        ];
//        $parent = Location::where('name', 'البنفسج عمارات')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//        $items = [
//            'شارع عبد الحميد جودة السحار',
//            'شارع تاجان',
//        ];
//        $parent = Location::where('name', 'البنفسج 1')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//        $items = [
//            'شارع د/ أحمد عكاشة',
//        ];
//        $parent = Location::where('name', 'البنفسج 2')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//        $items = [
//            'شارع زكريا أحمد',
//        ];
//        $parent = Location::where('name', 'البنفسج 5')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//        $items = [
//            'شارع الشيخ سليم البشري',
//        ];
//        $parent = Location::where('name', 'البنفسج 6')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//        $items = [
//            'شارع عبد الله المسلمي',
//            'شارع الشيخ/ ابراهيم حمروش',
//            'شارع د / محمد يوسف',
//            'شارع الاخشيدي',
//            'شارع عبد الباقي القليني',
//            'شارع الشيخ عبد الرحمن تاج',
//        ];
//        $parent = Location::where('name', 'البنفسج 7')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//        $items = [
//            'شارع الشيخ/ عبد الجليل عيسي',
//            'شارع الشهيد/ محمد الشيمي',
//            'شارع عبد الحليم حافظ',
//            'شارع سهل بن قيس',
//            'شارع معز الدولة',
//        ];
//        $parent = Location::where('name', 'البنفسج 8')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//        $items = [
//            'شارع الامام زين العابدين',
//            'شارع ابراهيم سعفان',
//            'شارع الشهيد شريف رضوان',
//            'شارع الشيخ الباجوري',
//            'شارع الشهيد عبد الحميد غبارة',
//            'شارع عبد الرحمن الشرقاوي',
//            'شارع صلاح سالم',
//            'شارع حسين بيكار',
//            'شارع الشهيد طارق نور',
//            'شارع الشهيد سليمان علي',
//        ];
//        $parent = Location::where('name', 'البنفسج 9')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//        $items = [
//            'شارع عمر خورشيد',
//            'شارع ابراهيم المازني',
//            'شارع المهندس خالد عبد العزيز',
//            'شارع د/ احمد عكاشة',
//        ];
//        $parent = Location::where('name', 'البنفسج 10')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//        $items = [
//            'شارع سليمان الحربي',
//        ];
//        $parent = Location::where('name', 'البنفسج 11')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }



//
//
//        $items = [
//            'اللوتس الجنوبيه',
//            'اللوتس الشماليه',
//        ];
//        $parent = Location::where('name', 'اللوتس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'شارع اللوتس الشمالية قطعة 18 - ديار',
//            'المنطقة الأولى - اللوتس الشمالية',
//            'المنطقة الثانية - اللوتس الشمالية',
//            'المنطقة الثالثة - اللوتس الشمالية',
//            'المنطقة الرابعة - اللوتس الشمالية',
//            'المنطقة الخامسة - اللوتس الشمالية',
//        ];
//        $parent = Location::where('name', 'اللوتس الشماليه')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }





//        $items = [
//            'شارع ابن السوري',
//            'شارع عبد الله بن سلمه',
//            'شارع فؤاد بيومي',
//            'شارع م/ علي شافعي',
//            'شارع الشهيد/ احمد خليل',
//            'شارع م/ احمد رزق',
//            'شارع ابراهيم حسن',
//            'شارع محمد مهدي علام',
//            'شارع صلاح الدين عبد الكريم',
//            'شارع م عبد الهادي راضي',
//            'شارع احمد بدرخان',
//            'شارع الشهيد/ علي جودة حسن',
//            'شارع الشهيد/ محمد فطين',
//            'شارع ناصر الدين الاسد',
//            'شارع الشهيد/ علي خاطر',
//            'شارع الحارث بن انس',
//            'شارع الشهيد/ علي السيد',
//            'شارع عمر فروخ',
//            'شارع ابراهيم فوزي',
//            'شارع الشهيد/ رضا شكري',
//            'شارع محمود الشريف',
//            'شارع انور وجدي',
//            'شارع محمود صديق',
//            'شارع ابراهيم شفيق',
//            'شارع محمد ابو شادي',
//            'شارع الشهيد/ رزق بدير',
//            'شارع سامي جبره',
//            'شارع صديق المنشاوي',
//            'شارع عز الدين ذو الفقار',
//            'شارع المستشار/ محمد كامل مرسي',
//            'شارع م/ ابراهيم عثمان',
//            'شارع حسن رشيد',
//            'شارع سلامة حجازي',
//            'شارع زكي طليمات',
//            'شارع المستشار/ عادل يونس',
//            'شارع حسين جنيد',
//            'شارع الشهيد/ اسماعيل الفقي',
//            'شارع الشهيد/ منير ميخائيل',
//            'محور التحرير',
//            'شارع الشهيد مصطفي شكري',
//        ];
//        $parent = Location::where('name', 'المستثمرين الشمالية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }



//        $items = [
//            'شارع الجزيرة',
//            'شارع محمد نجيب',
//            'شارع زيزينيا',
//            'شارع جمال عبد الناصر',
//            'شارع النصر',
//            'شارع دكتور حاتم داوود',
//            'شارع النادي',
//            'شارع عبد الله بن الزبير',
//            'شارع الشهيد أيمن كتات',
//            'شارع عباس بن فرناس',
//            'شارع أحمد كمال',
//            'شارع المستشار محمد أيوب',
//            'شارع الخضير',
//        ];
//        $parent = Location::where('name', 'المستثمرين الجنوبية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }





//        $items = [
//            'النرجس عمارات',
//            'النرجس 1',
//            'النرجس 2',
//            'النرجس 3',
//            'النرجس 4',
//            'النرجس 5',
//            'النرجس 6',
//            'النرجس 7',
//            'النرجس 8',
//        ];
//        $parent = Location::where('name', 'النرجس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }


//
//
//
//        $items = [
//            'الياسمين 1',
//            'الياسمين 2',
//            'الياسمين 3',
//            'الياسمين 4',
//            'الياسمين 5',
//            'الياسمين 6',
//            'الياسمين 7',
//            'الياسمين 8',
//            'شارع السيدة زينب',
//        ];
//        $parent = Location::where('name', 'الياسمين')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'المجاورة 1',
//            'المجاورة 2',
//            'المجاورة 3',
//            'المجاورة 4',
//            'المجاورة 5',
//            'المجاورة 6',
//            'المجاورة 7',
//            'المجاورة 8',
//            'المجاورة 9',
//            'المجاورة 10',
//            'المجاورة 11',
//            'المجاورة 12',
//            'المجاورة 13',
//            'المجاورة 14',
//            'المجاورة 15',
//            'المجاورة 16',
//            'المجاورة 17',
//            'إسكان الشباب الجنوبي',
//            'محور مصطفي كامل',
//            'محور عباس العقاد',
//            'شارع عبد الباسط عبد الصمد',
//        ];
//        $parent = Location::where('name', 'التجمع الاول')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'المحلية 1',
//            'المحلية 2',
//            'المحلية 3',
//            'المحلية 4',
//            'المحلية 5',
//            'المحلية 6',
//            'المحلية 7',
//            'ميدان الشباب',
//            'المستقبل 3',
//            'شارع الفتح',
//            'شارع الفجر',
//            'شارع ميدان النصر',
//            'شارع الأمل',
//            'شارع السوق',
//            'شارع الفرن',
//        ];
//        $parent = Location::where('name', 'التجمع الثالث')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'شارع سليم',
//            'شارع الدكتور هاني ماهر',
//
//        ];
//        $parent = Location::where('name', 'غرب أربيلا')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'شارع علاء السعدني',
//        ];
//        $parent = Location::where('name', 'غرب الجولف')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'شارع التحرير',
//            'شارع علي احمد الجرتلي',
//            'شارع احمد لطفي الخولي',
//            'شارع عزالدين اسماعيل',
//            'شارع محمد عثمان',
//            'شارع عبد الحميد يونس',
//            'شارع طومان باي',
//            'شارع الشيخ/ اسماعيل صادق العدوي',
//            'شارع عبد الحكيم الرفاعي',
//            'شارع حامد حسني سعيد',
//            'شارع محمد زكي شافعي',
//            'شارع احمد كامل مرسي',
//            'شارع رفعت المحجوب',
//            'شارع عبد الحليم علي',
//            'شارع الشهيد/ سيد طه عقيل',
//            'شارع نجيب اسكندر',
//            'شارع صلاح نسيم',
//            'شارع محمد جمال الدين مختار',
//            'شارع الشهيد/ سمير دميان',
//            'شارع احمد محمد الحوفي',
//            'شارع الشهيد حسن مصطفي',
//            'شارع سيد مكاوي',
//            'شارع عزالدين احمد فريد',
//            'شارع محمد توفيق الطويل',
//            ];
//        $parent = Location::where('name', 'شرق الأكاديمية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'جنوب الاكاديميه (أ)',
//            'جنوب الاكاديميه (ب)',
//            'جنوب الاكاديميه (ج)',
//            'جنوب الاكاديميه (د)',
//            'جنوب الاكاديميه (هـ)',
//            'جنوب الاكاديميه (و)',
//            'جنوب الاكاديميه (ز)',
//            'محور العروبة',
//            'شارع عبد الملك بن مروان',
//            ];
//        $parent = Location::where('name', 'جنوب الأكاديمية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//        $items = [
//            'كمبوند بالقطامية',
//            'شارع سعد زغلول',
//            'شارع مصر للطيران',
//            'شارع مدرسة الحرمين',
//            'شارع النصر',
//            'شارع عبد العاطي سيد عبد العاطي',
//            'شارع السوق',
//            'شارع مساكن الجيزة',
//            'طريق القطامية',
//            'شارع مساكن القاهرة',
//            'شارع مساكن النيل',
//            'المنطقة الصناعية - القطامية',
//            ];
//        $parent = Location::where('name', 'القطامية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//        $items = [
//            'جاردينيا هايتس - أبو الهول',
//            'كمبوند ميفيدا - اعمار',
//            'القطامية ديونز - القاهرة الجديدة',
//            'كمبوند ايست تاون - سوديك',
//            'لي روا - التعمير و الإسكان',
//            'مينا جاردنز',
//            'لاميرادا بلازا - لاميرادا',
//            'قطامية جاردنز - شمال افريقيا',
//            'ذا سكوير - صبور',
//            'هايد بارك كمبوند',
//            'ماونتن فيو هايد بارك',
//            'بالم هيلز القطاميه - PK1',
//            'ليان ريزيدنس - لاند مارك صبور',
//            'سيفورا هايتس - مدن',
//            'ديار - صبور',
//            'مكسيم كانتري كلوب',
//            'ايمرالد بارك',
//            'صن سيتي جاردنز',
//            'باراديس - المهندسين',
//            'رويال توليب',
//            'بيلاجيو - اركو',
//            'زيزينيا جاردنز - ارضك',
//            'الحياه - إسحق جروب',
//            'جولى هايتس',
//            'وان بيس - الفرسان',
//            'لينا سبرينجز',
//            'مون فالي 2 - ارابيا',
//            'ريحانا فيلاز - فيوتشر',
//            'سيزونز ريزيدنس - حسن علام',
//            'فلورز بارك',
//            'درة القاهرة - العمارة الحديثة',
//            'بارك فيو - حسن علام',
//            'حياتي ريزيدنس - الغد المشرق',
//            'كمبوند فيلينو - رسلان جروب',
//            'الحريه',
//            'جولدن هايتس 1 - نوفاز استانزا',
//            'الباتيو 1 - لافيستا',
//            'كمبوند قطاميه بلازا - سوديك',
//            'فاميلي سيتي - ايجي جاب',
//            'فيلار',
//            'المصراويه - زغلول هولدنج',
//            'القطامية هايتس',
//            'ريماس - امكو',
//            'الروضه',
//            'اديرا 1',
//            'اديرا 2',
//            'حياه هايتس',
//            'ريفر واك - وادي دجله',
//            'ذا ووتر واي',
//            'أيديا فيردي',
//            'ستيلا - رمكو',
//            'الباتيو 2 - لافيستا',
//            'كمبوند لانوفا فيستا - مصر ايطاليا',
//            'لاجو فيستا - مداد',
//            'جولدن هايتس 2 - نوفاز استانزا',
//            'كازا فيردي',
//            'فيلدج أفينيو - بالم هيلز',
//            'الطلائع',
//            'رويال لاجون',
//            'سيرينا هايتس',
//            'عصفور الجنه',
//            'مدينه الصحفيين',
//            'ايتوال دى فيل',
//            'المرام لاند مارك',
//            'الاشرفيه',
//            'زهرة التجمع',
//            'لاكوينتا',
//            'الجوهره',
//            'الصفا',
//            'كونكورد جاردنز',
//            'جاردن هيلز',
//            'ريتاج',
//            'عربيه',
//            'جرين بارك - الجزيرة',
//            'جراند ريزيدانس - الاهلي صبور',
//            'الأصيل',
//            'أوركيديا',
//            'جاردن فيو',
//            'مون فالي 1 - ارابيا',
//            'كمبوند 90 أفينيو - تبارك',
//            'الزهوة',
//            'فلور دي فيل',
//            'ذا فيلا',
//            "نيو ميريلاند",
//            "لايف فيو",
//            "مينا ريزيدنس",
//            "زيزينيا سيتي - ارضك",
//            "جنتي",
//            "أصالة",
//            "ريفيرا هيلز",
//            "كمبوند ريفيرا هايتس - نوفا استانزا",
//            "حدائق الفداء",
//            "لاتيرا",
//            "كمبوند فيلدج جيت - بالم هيلز",
//            "مارفل سيتي",
//            "لايت سيتي",
//            "كمبوند ذا فيلدج - بالم هيلز",
//            "جاليريا ريزيدنس - ارابيا",
//            "إيجلز",
//            "فاونتن بارك",
//            "فيلدج جاردن قطاميه (VGK) - بالم هيلز",
//            "ديار بارك",
//            "جاردنيا سبرنجز",
//            "لاند مارك",
//            "ماونتن فيو 1",
//            "ماونتن فيو 2",
//            "الباتيو 3 - لافيستا",
//            "كونكورديا 2",
//            "كمبوند ليك فيو - الحاذق",
//            "ستون بارك - رؤيه",
//            "بورتو كايرو فيلاز - المطورون العرب",
//            "كمبوند سوان ليك ريزيدينس - حسن علام",
//            "مارينا سيتي",
//            "رويال مكسيم",
//            "قطاميه ريزيدنس - الاهلي",
//            "برايت سيتي",
//            "المخابرات - الديار",
//            "كمبوند كايرو فيستيفال سيتي - الفطيم",
//            "لاروز",
//            "كمبوند تاج سيتى - مدينة نصر للتطوير",
//            "كمبوند أكويا",
//            "كمبوند ميد تاون - بتر هوم",
//            "ليلة كمباوند",
//            "كايرو بزنس بارك",
//            "سكن",
//            "هاي لاند بارك",
//            "ماونتن فيو اكزيكتيف ريزيدنس",
//            "كمبوند ريجينتس بارك - الدولية",
//            "كمبوند فيليت - سوديك",
//            "أسوار",
//            "كمبوند النخيل",
//            "ليك فيو ريزيدنس",
//            "لايف ميديكال",
//            "إيطاليان سكوير - موسي كوست",
//            "ماونتن فيو أي سيتي",
//            "أوزون الطبي - كتاليست",
//            "المركز الطبى المتحد – UMC",
//            "قطامية هيلز",
//            "كمبوند سراي - مدينة نصر للتطوير",
//            "اب هيل ريزيدنس",
//            "كمبوند روك فيرا - البطل",
//            "كمبوند قطامية جيت - معمار المرشدي",
//            "الجمعيات",
//            "درة القرن",
//            "كمبوند فيفث سكوير - المراسم",
//            "إم سكوير جاردنز",
//            "كمبوند لافونتين - أركو",
//            "بروميناد ريزيدنس - وادي دجلة",
//            "الباتيو 7 - لافيستا",
//            "نست كايرو",
//            "كمبوند كابيتال جاردنز - بالم هيلز",
//            "قطامية بريز",
//            "لو ريف",
//            "مدينة الياسمين",
//            "أرابيلا فيليج",
//            "إيزي لايف",
//            "فيوتشر جيت",
//            "ميراج ريزيدنس",
//            "سيتي جيت",
//            "بالم هيلز نيو كايرو - PHNC",
//            "رامبلاز",
//            "الفداء جاردنز",
//            "صفوة ريزيدنس",
//            "الغازي جاردن",
//            "كمبوند أزاد - تعمير",
//            "سمارت لايف - اي سي",
//            "ذا كور - معمار الأشراف",
//            "كمبوند الباتيو أورو - لافيستا",
//            "كابيتال جيت - المراسم",
//            "كمبوند أزار - ريدي جروب",
//            "كمبوند ديستريكت 5 - مراكز",
//            "العربية جيت",
//            "كمبوند ذا ادرس ايست - درة",
//            "ذا أيكون ريزدنس - ستايل هوم",
//            "كاونتى",
//            "وينسر بالاس",
//            "تاج سلطان - مدينة نصر",
//            "زيزينيا روز - ارضك",
//            "ستون ريزيدنس - بي آر إي",
//            "كمبوند أزادير - الشرقيون",
//            "ويسترن فيل",
//            "كليوباترا أيست",
//            "كمبوند روك ايليت - البطل",
//            "رويال جرين",
//            "ميراج سيتي",
//            "هيد كوارتر بيزنس - إم جي",
//            "فيفيندا",
//            "كمبوند تريو جاردنز - أم سكوير",
//            "اليجانتري مول - كتاليست",
//            "بزنيس بلس - كتاليست",
//            "لايف جاردن",
//            "طيبة",
//            "بارك لاين",
//            "كايرو كابيتال سنتر - كتاليست",
//            "كمبوند سنشري سيتي - فانتدج",
//            "بالم هيلز قطامية أكستنشن - PK2",
//            "إيفورا",
//            "كمبوند ذا مارك - ذا مارك كوميونيتيز",
//            "ماونتن فيو 3",
//            "نيوم نيو كايرو - المطورون العرب",
//            "فاليو مول 2",
//            "سيلة",
//            "كمبوند زيد إيست - أورا",
//            "جادة",
//            "كمبوند جايد - السعودية المصرية",
//            "البستان",
//            "ذا ليدج - أكويا",
//            "ذا فيوز",
//            "بيرل دى روا",
//            "أجورا كوميرشيال كومبلكس - أوربان",
//            "صن رايز",
//            "سايد ووك - كي في أر دي",
//            "5A - ذا وتر واي",
//            "سنترو مول - بروجيت",
//            "سنترك مول - اب تيرن",
//            "قطامية جريكس - ستار لايت",
//            "روف مول - فالدا",
//            "بيزنس هاب",
//            "اكاسيا",
//            "ستون تاورز",
//            "وان ناينتي مول - لاندمارك صبور",
//            "كايرو واك ريزنديس",
//            "ستون ستريت",
//            "ويست جولف",
//            "سيلفر بالم",
//            "كمبوند القوات المسلحة",
//            "الأشرافية",
//            "أفاريس",
//            "سكن مصر 3",
//            "سكن مصر 7",
//            "سكن مصر 4",
//            "سكن مصر 5",
//            "سكن مصر 6",
//            "فوتون أفينو",
//            "كمبوند أزار 2",
//            "ليك ريزيدنس - المراسم",
//            "ايفري مول",
//            "نورث بلس",
//            "ثري سكيستي مول - لاندمارك صبور",
//            "كمبوند كيندا - مينكا",
//            "قطامية بالمز",
//            "فاردو ميني كمبوند - قوافل",
//            "إن سكوير مول - انفينيتي",
//            "امورادا - افاق",
//            "ريو مول - ديار المستقبل",
//            "دار مصر القرنفل",
//            "تريفيوم سكوير مول - إنماء",
//            "إيترنا هيلث كير سيتي - المتحدون",
//            "كمبوند كريك تاون - خزام",
//            "ذا واتر واي فيلا",
//            "كايرو بيزنس باي - بتر هوم",
//            "الجازي فيرست مول",
//            "B255 كومبلكس - الرباط",
//            "مايندهاوس بيزنس - مراكز",
//            "فيفث سكوير مول - المراسم",
//            "ميد فالي - افنيوز",
//            "مول فى 90 - أوربان",
//            "كوبالت بيزنس ديستريكت - مدينة نصر للتطوير\n    ",
//            "بريميم بيزنس سنتر - إم جي",
//            "نيو واي - إبني",
//            "اونر بالاس",
//            "ذا هب - اكويتي",
//            "كريستا بيلا هيلز - السعودية الامريكية",
//            "ذا كلنكس - افنيوز",
//            "كايرو بيزنس بلازا - بتر هوم",
//            "كمبوند الجازي جاردنز",
//            "الجازي ماريوت ريزيدنس - سلدار",
//            "ميديكال بارك إيليت - الرباط",
//            "ميديكال بارك بريمير - بي تو بي",
//            "فيلدج جاردنز قطامية مول - بالم هيلز",
//            "ذا ارينا ستريب مول - مدينة نصر للتطوير",
//            "دبليو ريزيدنس القاهرة - لاند مارك صبور",
//            "بلس مول - ريسان",
//            "لانوفا فيستا مول - مصر ايطاليا",
//            "جاردينيا هايتس 3",
//            "روك فيرا بلازا - البطل",
//            "ذا يارد مول - الرباط",
//            "كمبوند روضة الازهر",
//            "كمبوند الدفاع الوطني",
//            "كمبوند تبارك",
//            "كمبوند النيابة العامة",
//            "كمبوند لافي",
//            "كمبوند روضة الياسمين",
//            "كمبوند القضاه",
//            "كمبوند A77 - اب ترن",
//            "كمبوند ارابيلا بارك",
//            "ذا فينيو مول",
//            "تريبلكس مول - أوربان",
//            "كمبوند هيكسا - معمار الأشراف",
//            "كايرو ميديكال سنتر - المعادي جروب",
//            "ذا هوفت - مينكا",
//            "مول جي 7 - ميركون",
//            "كمبوند جرين تاون - ترو",
//            "توين بلازا مول - الوطنية",
//            "كمبوند تريو زون - دريم تاون",
//            "تريفيوم بيزنس كومبلكس - إنماء",
//            "ذا تري ريزيدنس - عقار",
//            "اركس مول - بنيان",
//            "زوان بلازا مول - أكنان",
//            "مول وان سيفن - ريسان",
//            "كمبوند ذا بروكس - بايونيرز",
//            "ايست ماين مول - موبكو",
//            "مون ريزيدنس - المراسم",
//            "ادريس 34 مول - الجوار",
//            "ذا مديان ريزيدنس - إيجي جاب",
//            "ذا واتر مارك - ذا مارك",
//            "ميلينيوم مول - معمار الاشراف",
//            "كمبوند لافي 12 - معمار الاشراف",
//            "ميني كمبوند ديار النرجس",
//            "بارك ريزيدنس - مدينة نصر للتطوير",
//            "كارنيل بيزنس هب - افيكس",
//            "سواي كومبلكس مول - الرباط",
//            "جرانوي مول - اب وايد",
//            "جنوب الجمعيات",
//            "حي الروضة",
//            "ذا ايكون 2 ريزيدنس - ستايل هوم",
//            "اكسيس مول - إنسبت",
//            "اكلبس مول - منصات",
//            "ايجوال مول - اب وايد",
//            "مول اكس اس 79 - ايجبت بيلدرز",
//            "كمبوند ألكا - السعودية الأمريكية",
//            "استر ريزيدنس - تيمز",
//            "ايست شير - القمزي",
//            "أكاسا - دار العالميه",
//            "ألفا - معمار الأشراف",
//            "لا في 9 - معمار الأشراف",
//            "أوربن كي - ستار لايت",
//            "واترواي براندد ريزدنس - اكويتي",
//            "جي 2 - الجمهورية للتنمية العمرانية",
//            "ذا ميز ستريب مول - ديفلوبر اكس",
//            "أزاد فيوز - تعمير",
//            "ايستاون ديستريكت - سوديك",
//            "جاردن ريزيدنس هايد بارك",
//            "تاون ريزيدنس",
//            "تريو فيلا - ام سكوير",
//            "ستيت - لاند مارك",
//            "سنترال - الشركة السعودية المصرية",
//            "فيلدج جيت مول - بالم هيلز",
//            "ذا ارك بيزنس ديستريكت",
//            "كونكورد بلازا",
//            "في تراس مول - فاليو",
//            " اوربن لينز - ايست لين",
//            "ذا فيو - واترواي",
//            "بارك مول - المطورون العرب",
//            "كلاود ايست مول - أوربان للتطوير العقاري",
//            "كمبوند جنة",
//            "بالما ريزيدنس",
//            "مول وينجيت - ويلث للتطوير العقاري",
//            "لايف هوم",
//            "أفالون - انفست ويل",
//            "مول توب 90",
//            "ناين ايست",
//            "اى تى بيزنس هب مول - اب وايد",
//            "ثري سكايز مول",
//            "سوان ليك قطاميه - حسن علام",
//            "نيو كابيتال جاردنز - بالم هيلز",
//            "زووم بلازا - سكوب",
//            "ساوث جيت مول - انفيست ويل",
//            "ليفن سكوير مول",
//            "الجازي تشيس فيلد - سلدار مصر",
//            "جولدن جيت - ريدكون",
//            "مول سيلفر ستار",
//            "روك جولد - البطل",
//            "مول ايه اي - الكازار",
//            "كلوف مول - معمار",
//            "جريا - البارون",
//            "مول نوار - ليفينج ياردز",
//            "نرجس هيلز - الأهرام",
//            "برامفيرا - نكست هوم",
//            "درة الكرز",
//            "مول درة الكرز",
//            "ليك فيو بلازا - الحاذق",
//            "سيتي ووك مول - M&AH",
//            "ستارى 1 - NBS",
//            "ستارى 2 - NBS",
//            "جراند ريزيدنس - الأهلي صبور",
//            "لؤلؤة القاهرة الجديدة",
//            "كمبوند بجسكو",
//            "جرين هاوس - الأوقاف",
//            "فيردان - جرين سيتي",
//            "كمبوند جمعية القاضي الفاضل",
//            "يو فينيوز - السويدي",
//            "ذا أيكون مول - ستايل هوم",
//            "90 أفينو مول - تبارك",
//            "تايكون - ارابيا",
//            "جاليريا مول - ارابيا",
//            "ذا سبوت مول - مشاعر القابضه",
//            "كمبوند مثقفين المعادى - ألفا",
//            "لايف مول - اي سي",
//            "لايف جيت مول - اي سي",
//            "جاردن فيو 2 - دريم تاون",
//            "ميجا مول - نيو ايدج",
//            "مكسيم مول",
//            "سنترال بارك - النيل",
//            "كلاود 9 مول - أوربان للتطوير العقاري",
//            "باراديس مول - البستان",
//            "سجي مول 1 - PCE",
//            "فيرست مول - بنيان",
//            "واتر فرونت مول - جبال",
//            "بورتو كايرو مول",
//            "سنترال هاب - ام جروب",
//            "كايرو بيزنس جيت - بتر هوم",
//            "ميدتاون مول - بتر هوم",
//            "سكاي ميديكال سنتر - العمار",
//            "لا في 5 - معمار الأشراف",
//            "لا في 6 - معمار الأشراف",
//            "لا في 7 - معمار الأشراف",
//            "مول القطامية - مراكز",
//            "أرابيلا بلازا مول",
//            "ستون هيلز - رؤية",
//            "نيوم ميديكال هاب - المطورون العرب",
//            "جراند سيزر - ثقة",
//            "كمبوند اللوتس - برستيج جروب",
//            "بتروفيو - جمعية اسكان بترول بلاعيم",
//            "ذا ارك",
//            "مول O1 - الاعمار",
//            "فيتالي مول - إيستا",
//            "اكس مول - اكس استيت",
//            "اكس بلازا مول - اكس استيت",
//            "طيبة روز الدفاع الجوي",
//            "كريك ديستريكت - الكازار",
//            "جاردن 8 - مصر ايطاليا",
//            "سيتي هول مول - سيراك",
//
//        ];
//        $parent = Location::where('name', 'كمبوند بالتجمع الخامس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            'منتجع النخيل',
//            'الأمن العام',
//            'المجاورات الأربعه',
//            'كمبوند وزاره الماليه',
//        ];
//        $parent = Location::where('name', 'خلف ميراج سيتي')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المرحله الأولى",
//            "المرحله الثانيه",
//            "المرحله الثالثه",
//            "المرحله الرابعه",
//            "المرحله الخامسه",
//            "المرحله السادسه",
//            "الأسواق والمولات",
//            "مناطق فرعية بالرحاب",
//            "الرحاب هيلز",
//            "إمتداد الرحاب",
//            "سجي مول 2 - PCE"
//        ];
//        $parent = Location::where('name', 'مدينة الرحاب')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المنطقه الأولى عمارات",
//            "المنطقه الثانيه عمارات",
//            "المنطقه الثالثه عمارات",
//            "المنطقه السادسه عمارات",
//            "المنطقه السابعه عمارات",
//            "المنطقه الثامنه عمارات",
//            "المنطقه التاسعه عمارات",
//            "المنطقه العاشره عمارات",
//            "المنطقه الحاديه عشر عمارات",
//            "المنطقه الثانيه عشر عمارات",
//            "المنطقه الثالثه عشر عمارات",
//            "المنطقه الرابعه عشر عمارات",
//            "المنطقه الخامسه عشر عمارات",
//            "المنطقة الأولى فيلات",
//            "المنطقة الثانيه فيلات",
//            "المنطقة الثالثه فيلات",
//            "المنطقة الرابعة فيلات",
//            "المنطقة الخامسة فيلات",
//            "المنطقه الرابعه عمارات",
//            "المنطقه الخامسه عمارات",
//            "مناطق فرعية بمدينتي",
//            "بريفادو",
//            "كرافت زون مول",
//            "داون تاون مدينتي"
//        ];
//        $parent = Location::where('name', 'مدينتي')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الحي الأول",
//            "الحي الثاني",
//            "الحي الثالث",
//            "الحي الرابع",
//            "الحي الخامس",
//            "الحي السادس",
//            "الحي السابع",
//            "الحى الثامن",
//            "كمبوند في بيت الوطن",
//            "شمال بيت الوطن"
//        ];
//        $parent = Location::where('name', 'بيت الوطن')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الحي الأول",
//            "الحي الثاني",
//            "الحي الثالث",
//            "الحي الرابع",
//            "الحي الخامس",
//            "الحي السادس",
//            "الحي السابع",
//            "الحى الثامن",
//            "كمبوند في بيت الوطن",
//            "شمال بيت الوطن"
//        ];
//        $parent = Location::where('name', 'بيت الوطن')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "دار مصر الأندلس",
//        ];
//        $parent = Location::where('name', 'دار مصر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "كمبوند بمدينة المستقبل",
//            "المرحلة الأولي - مدينة المستقبل",
//            "المرحلة الثانية - مدينة المستقبل",
//            "المرحلة الثالثة",
//            "المرحلة الرابعة - مدينة المستقبل",
//            "المرحلة الخامسة - مدينة المستقبل"
//        ];
//        $parent = Location::where('name', 'مدينة المستقبل')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "القرنفل",
//            "الأحياء",
//            "الشويفات",
//            "شارع التسعين",
//            "مناطق فرعية بأحياء التجمع",
//            "الأندلس"
//        ];
//        $parent = Location::where('name', 'التجمع الخامس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }


















        $items = [
            "غرب سوميد",
            "الأحياء",
            "جنوب الأحياء",
            "حدائق أكتوبر",
            "التوسعات الشمالية",
            "الحي المتميز",
            "المنطقة الصناعية",
            "كمبوند في ٦ اكتوبر",
            "مناطق فرعية ب 6 أكتوبر",
            "جنوب الواحات",
            "واحة أكتوير",
            "أكتوبر الجديدة",
            "جمعية المستثمرين",
            "المحصورات",
            "بيت الوطن",
            "الحصري",
            "محور البوليفارد",
            "المستثمر الصغير",
            "التوسعات الشرقية",
            "الظهير الصحراوي لمحافظة الجيزة",
            "الاسكان المميز",
            "طريق وصلة دهشور",
            "شارع دريم لاند",
            "طريق 6 اكتوبر وادي النطرون",
            "ميدان جهينة",
            "جمال عبد الناصر",
            "طريق الواحات",
            "المنطقة العمرانية الثانية",
            "حي البشاير"
        ];
        $parent = Location::where('name', '6 أكتوبر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'created_at' => date(now()),
                'updated_at' => date(now()),
            ]);
        }
















//        $items = [
//            "المجاوره الأولى",
//            "المجاوره الثانيه",
//            "المجاوره الثالثه",
//            "المجاوره الرابعه",
//            "المجاوره الخامسه",
//            "المجاوره السادسه",
//            "المجاوره السابعه",
//            "المجاوره الثامنه",
//            "المجاوره التاسعه",
//            "المجاوره العاشره",
//            "المجاوره الحاديه عشر",
//            "المجاوره الثانيه عشر",
//            "المجاوره الثالثه عشر",
//            "المجاوره الرابعة عشر"
//        ];
//        $parent = Location::where('name', 'غرب سوميد')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الحي الأول",
//            "الحي الثاني",
//            "الحي الثالث",
//            "الحي الرابع",
//            "الحي الخامس",
//            "الحي السادس",
//            "الحي السابع",
//            "الحي الثامن",
//            "الحي التاسع",
//            "الحي العاشر",
//            "الحي الحادي عشر",
//            "الحي الثاني عشر",
//            "شارع الخزان"
//        ];
//        $parent = Location::where('name', 'الأحياء')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "أسكان الشباب 63م",
//            "الأسكان العائلي",
//            "أسكان المستقبل",
//            "مشروع 103",
//            "مشروع 109",
//            "أسكان 63م أبو الوفا",
//            "حي البستان",
//            "حي الزهور",
//            "حي السكريه",
//            "حي الزمالك",
//            "إسكان الشباب 100 متر",
//            "عمارات المهندسين",
//            "حى الاندلس"
//        ];
//        $parent = Location::where('name', 'جنوب الأحياء')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//        $items = [
//            "ابني بيتك 1",
//            "ابني بيتك 2",
//            "ابني بيتك 3",
//            "ابني بيتك 4",
//            "ابني بيتك 5",
//            "ابني بيتك 6",
//            "ابني بيتك 7",
//            "هرم سيتي",
//            "الفردوس سيتي",
//            "أرض المخابرات",
//            "مناطق فرعية بحدائق أكتوبر",
//            "جمعية المستثمرين",
//            "بيت المصرية",
//            "ذا جيت",
//            "المنطقة السياحية ب",
//            "المنطقة السياحية أ",
//            "كمبوند في حدائق أكتوبر",
//            "طريق احمد زويل",
//            "مسلسل 2",
//            "مسلسل 3",
//            "مسلسل 5",
//            "حدائق الفردوس"
//        ];
//        $parent = Location::where('name', 'حدائق أكتوبر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "المنطقه الأولى السياحيه",
//            "المنطقه الثانيه السياحيه",
//            "المنطقه الثالثه السياحيه",
//            "الحي 300",
//            "التوسعات السياحية الشمالية",
//            "حي 2000 قطعة",
//            "حي أوركيديا"
//        ];
//        $parent = Location::where('name', 'التوسعات الشمالية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "القرية السياحية الأولى",
//            "القرية السياحية الرابعه",
//            "القرية السياحية السادسه",
//            "مناطق فرعية بالحي المتميز"
//        ];
//        $parent = Location::where('name', 'الحي المتميز')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "المنطقه الصناعيه 1",
//            "المنطقه الصناعيه 2",
//            "المنطقه الصناعيه 3",
//            "المنطقه الصناعيه 4",
//            "المنطقه الصناعيه 5",
//            "المنطقه الصناعيه 6"
//        ];
//        $parent = Location::where('name', 'المنطقة الصناعية')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "أيفر جرين",
//            "بالم فالي - بالم هيلز",
//            "دريم لاند",
//            "روضة",
//            "كمبوند بالم بارك - بالم هيلز",
//            "ريم ريزيدنس",
//            "سوان ليك",
//            "فيرست هايتس",
//            "كمبوند كليوبترا سكوير - كليوبترا",
//            "بالم هيلز أكتوبر",
//            "نيو جيزه",
//            "ماونتن فيو اكتوبر بارك",
//            "الباتيو 6 - لافيستا",
//            "فلور ريزورت",
//            "روز فيل",
//            "برنسيس",
//            "دريم لايف",
//            "بيراميدز هايتس",
//            "النسايم",
//            "جاردينيا بارك 2",
//            "الياسمين جرين لاند",
//            "جاردينيا بارك",
//            "رويال هيلز",
//            "رامو",
//            "مينا جاردن سيتى",
//            "حي الأشجار",
//            "أشجار هايتس",
//            "رحاب أكتوبر",
//            "واحة النور",
//            "ستار سيتي",
//            "ريحانه",
//            "تاون فيو",
//            "الحي الاسباني",
//            "واحة الريحان",
//            "لازوردي",
//            "اربيانو",
//            "جولف ريزيدنس",
//            "بيتا جاردنز",
//            "بداية",
//            "كمباوند اللوتس",
//            "الحي الايطالي - موسي كوست",
//            "المنتزه",
//            "راية سيتي",
//            "دجله جاردنز",
//            "بيتى",
//            "كمباوند المنتزه",
//            "الورود",
//            "جرين هايتس",
//            "داره جاردنز",
//            "مروج",
//            "طيبه جاردنز",
//            "باردايس جاردنز",
//            "جاردن سيتي أكتوبر",
//            "كريك بارك",
//            "جاردن هيلز",
//            "كمبوند جراندا هايتس - كواديكو",
//            "بالم سبرينج",
//            "كمبوند جيزة بلاتوه - ماونتن فيو        ",
//            "سيتي فيو",
//            "كمبوند بيراميد هيلز - اورا",
//            "بالما بيراميدز",
//            "العزيزيه",
//            "العزيزيه 2",
//            "بالم هايتس",
//            "جلاديوس  جاردن",
//            "ديار التعمير",
//            "واحة المهندسين",
//            "اليكو سيتى",
//            "بيت المصريه",
//            "سنابل سيتي",
//            "العبير جاردنز",
//            "لو جاردن",
//            "كمبوند كنز - فرست جروب",
//            "كمبوند جرين 4 - مباني ادريس",
//            "اوتوبيا",
//            "كونكورديا",
//            "نور هايتس",
//            "كمبوند جدار - ايوان",
//            "جبيل",
//            "رويال فالي",
//            "الفداء",
//            "كمبوند بروميناد ريزيدنس - وادي دجلة",
//            "تشيل اوت بارك - ماونتن فيو",
//            "أهرام جاردنز",
//            "صن سيتي",
//            "الرباب",
//            "قرطبة",
//            "سوناتا",
//            "باراديس",
//            "المدينة",
//            "سالمية جاردن",
//            "أجياد جاردن",
//            "زاهر سيتي",
//            "الرايات ريزيدنس",
//            "بارك فيل",
//            "حدائق النصر",
//            "مدينة الفردوس",
//            "القوات المسلحة",
//            "حي الفيروز",
//            "الرواس",
//            "اكتوبر هيلز II",
//            "سيتي اوف سن",
//            "الريهام",
//            "إشراقة",
//            "الربوة الهادئة",
//            "الدولية بلازا",
//            "هرم سيتي",
//            "كمبوند مشارق - تنامي      ",
//            "الزهور",
//            "فاميلي لاند",
//            "هاي تاون",
//            "كومكس جاردن",
//            "هرم لايف",
//            "الزمالك",
//            "السكرية",
//            "الياسمين",
//            "جرين باراديس",
//            "البستان",
//            "الجنة الخضراء",
//            "كمبوند جرين 5 - مباني ادريس",
//            "كمبوند اشجار سيتى - اي جي أي",
//            "سدرة",
//            "آستوريا بارك",
//            "ليك فرنت",
//            "كمبوند لافند - اركو",
//            "إميرالد سيتي",
//            "فيو مول",
//            "كمبوند جويا - تي سي سي",
//            "تيارا ريزدنس",
//            "تريلليوم",
//            "كمبوند صن كابيتال - ارابيا",
//            "لينكس",
//            "كمبوند جولز - انرشيا",
//            "كمبوند أيون - مراكز",
//            "بامبو",
//            "سولايا",
//            "كمبوند بادية - بالم هيلز",
//            "جاردينيا",
//            "جرين يارد",
//            "كمبوند أكتوبر بلازا - سوديك",
//            "كمبوند بريكس - انترشيا",
//            "اب فيل",
//            "ويست هيلز",
//            "ماونتن فيو اى سيتى أكتوبر",
//            "بالم هيلز أكتوبر جولف فيو",
//            "كمبوند وود فيل - بالم هيلز",
//            "كمبوند ذا كراون - بالم هيلز",
//            "جلورى",
//            "تاله",
//            "واحة الخير",
//            "لايف جاردن",
//            "كمبوند ذا أكسيس - ايوان",
//            "كمبوند الزراعيين",
//            "كمبوند أو ويست - اوراسكوم",
//            "فيلاريا",
//            "سكن مصر",
//            "الحزام الأخضر",
//            "الموندو",
//            "كمبوند كيفا - الاهلي صبور",
//            "كمبوند أوك بارك - أي جي أي",
//            "كازان بلازا - فرست جروب",
//            "لا فيدا البستان",
//            "بالم فيلا",
//            "كمبوند تاوني - هايد بارك",
//            "كمبوند جرين لاند - المنارة",
//            "سكاي ووك بيزنيس بارك",
//            "جاردينيا الشمس",
//            "كايا مول - فرست جروب",
//            "وست جيت هيلز",
//            "بامبو أكستنشن",
//            "كمبوند ديار 2 - تعمير",
//            "كيان",
//            "أبهي",
//            "ويست بارك - ايجي دف",
//            "كمبوند جرين 6 - مباني ادريس",
//            "هيل تاون - بالم هيلز",
//            "مول سنترادا بلازا",
//            "مون هيلز",
//            "هافانا هيلز ميني كمبوند",
//            "كمبوند ازاليا - إيجي داف",
//            "جولف سنترال مول - بالم هيلز",
//            "كمبوند النورهان",
//            "كمبوند أب تاون - ريل استيت",
//            "روك ايدن بلازا - البطل",
//            "ويست جيت مول",
//            "اشجار ريزيدنس - أي جي اي",
//            "كمبوند الكاميليا",
//            "ويست ايليفن مول - ديماند",
//            "بيرلادو مول - مودرن",
//            "ذا جيت بلازا - ميكون",
//            "كمبوند مالاجا - الخليفة",
//            "اكتوبر فيستيفال سيتي مول - بيزنس جروب",
//            "ذا بورتال مول - سوديك",
//            "سيكس ويست - سوديك",
//            "بلازا اسبانا مول - جيتس",
//            "كمبوند لايف بوينت - الصديق",
//            "كمبوند فيو جاردن - سوليد",
//            "جنة اكتوبر",
//            "كمبوند برايم افينيو - ميكستا",
//            "إم ابارتمنت - ميراد",
//            "كمبوند نستريا",
//            "بارادايس العزيزيه",
//            "كمبوند جيسي هيلز - اركان",
//            "ناين بلازا مول - نيو لاند",
//            "البشاير مول - نيو لاند",
//            "كمبوند دار مصر",
//            "كمبوند نبع - هاي لايف",
//            "كمبوند دانا ويست - ليمار",
//            "فيراندا ريزيدنس - الوالي",
//            "بارك يارد مول - كابيتال هيلز",
//            "مون هيلز 2 - سكن",
//            "ايفر - كريد",
//            "الهضبة - الجزيرة",
//            "جرانزا ويست سوميد - AMID",
//            "نيوم أكتوبر - المطورون العرب",
//            " بالمت - بالم هيلز",
//            "كراون سنترال - بالم هيلز",
//            "كمبوند النصر",
//            "مون هيلز 3",
//            "سيتي ستارز مول ",
//            "ذا لين - بالم هيلز",
//            "فاميلي مول",
//            "ديار بلازا ",
//            "صن بلازا مول",
//            "سيتي سنتر ",
//            "ماونتن فيو 4 ",
//            "لاسيتيه بلازا مول",
//            "مول الحياة "
//        ];
//        $parent = Location::where('name', 'كمبوند في ٦ اكتوبر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "دجله بالمز",
//            "سكن مصر",
//            "الاسكان الاجتماعي - 800 فدان",
//            "ابني بيتك 6",
//            "ربوة اكتوبر"
//        ];
//        $parent = Location::where('name', 'أكتوبر الجديدة')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "المحصورة أ",
//            "المحصورة ب",
//        ];
//        $parent = Location::where('name', 'المحصورات')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//        $items = [
//            "بيت الوطن الحي التاسع",
//            "بيت الوطن التكميلي",
//            "بيت الوطن الأساسي"
//        ];
//        $parent = Location::where('name', 'بيت الوطن')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }












        $items = [
            "طريق اسكندرية الصحراوي",
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي التاسع",
            "الحي العاشر",
            "الحي الحادي عشر",
            "الحي الثاني عشر",
            "الحي الثالث عشر",
            "الحي الرابع عشر",
            "الحي السادس عشر",
            "الثورة الخضراء",
            "كمبوند بالشيخ زايد",
            "حي الياسمين",
            "مناطق فرعية بمدينة الشيخ زايد",
            "بيت الوطن",
            "القرية الذكية",
            "الحي الثامن عشر",
            "الشيخ زايد الجديدة",
            "الحي السابع عشر",
            "الحي الخامس عشر",
            "شارع البستان",
            "شارع الشباب"
        ];
        $parent = Location::where('name', 'مدينة الشيخ زايد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'created_at' => date(now()),
                'updated_at' => date(now()),
            ]);
        }












//        $items = [
//            "مناطق فرعية بطريق أسكندريه الصحراوي",
//            "سكون",
//            "روز فالي",
//            "بيرل بيراميدز",
//            "فيدا",
//            "نيوم بيراميدز - المطورون العرب",
//            "جنات",
//            "مزارع ستيلا دي ماري",
//            "كمبوند كايرو ويست - الضو للتطوير",
//            "مزارع دينا",
//            "وادي النخيل",
//            "جرانة ريزيدنس",
//            "إي أر سي بيزنس بارك - سفريكو للاستثمار العقاري",
//            "نورث سايد - سفريكو للاستثمار العقاري",
//            "كمبوند في طريق اسكندرية الصحراوي",
//            "سيزونز ريزيدنس",
//            "مدينة سفنكس الجديدة"
//        ];
//        $parent = Location::where('name', 'طريق اسكندرية الصحراوي')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "شارع رقم 23",
//            "شارع رقم 10",
//            "شارع رقم 37",
//            "شارع رقم 39",
//            "شارع رقم 22",
//            "شارع رقم 34",
//            "شارع رقم 41",
//            "شارع رقم 49",
//            "شارع رقم 13",
//            "شارع رقم 50",
//            "شارع رقم 54",
//            "شارع رقم 42",
//            "شارع رقم 16",
//            "شارع رقم 44",
//            "شارع رقم 46",
//            "شارع رقم 17",
//            "شارع رقم 40",
//            "شارع رقم 36",
//            "شارع رقم 57",
//            "شارع رقم 56",
//            "شارع رقم 58",
//            "شارع رقم 21",
//            "شارع رقم 25",
//            "شارع رقم 26",
//            "شارع رقم 20",
//            "شارع رقم 12",
//            "شارع رقم 30",
//            "شارع رقم 33 أ",
//            "شارع رقم 47",
//            "شارع رقم 43",
//            "شارع رقم 53",
//            "شارع رقم 24",
//            "شارع رقم 14",
//            "شارع رقم 15",
//            "شارع رقم 11",
//            "شارع رقم 18",
//            "شارع رقم 38",
//            "شارع رقم 33",
//            "شارع رقم 45",
//            "شارع 29"
//        ];
//        $parent = Location::where('name', 'الحي الأول')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "مناطق فرعية بالحي الثاني",
//            "د. عاطف صدقي",
//            "الزهور",
//            "البستان",
//            "الروضة"
//        ];
//        $parent = Location::where('name', 'الحي الثاني')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "شارع 30",
//            "الحرية",
//            "شارع 21",
//            "شارع 26",
//            "شارع 25",
//            "شارع 28",
//            "شارع 27",
//            "شارع 22",
//            "شارع 23",
//            "شارع 24",
//            "مناطق فرعية بالحي الثالث",
//            "شارع  دكتور علي لطفي"
//        ];
//        $parent = Location::where('name', 'الحي الثالث')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الصفا",
//            "الجزيرة",
//            "مناطق فرعية بالحي الرابع",
//            "شارع  المستقبل"
//        ];
//        $parent = Location::where('name', 'الحي الرابع')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الحرية",
//            "مناطق فرعية بالحي الخامس",
//        ];        $parent = Location::where('name', 'الحي الخامس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "طريق الشباب",
//        ];
//        $parent = Location::where('name', 'الحي السادس')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "الصفا",
//            "البستان",
//            "الحكمة",
//            "شارع لافندر",
//            "مناطق فرعية بالحي السابع"
//        ];
//        $parent = Location::where('name', 'الحي السابع')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المجاورة الاولى",
//            "المجاورة الثانية",
//            "المجاوره الثالثه",
//            "المجاوره الرابعه",
//            "الأمل",
//            "الحكمة",
//            "مناطق فرعية بالحي الثامن"
//        ];
//        $parent = Location::where('name', 'الحي الثامن')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المجاوره الأولى",
//            "المجاوره الثانيه",
//            "المجاوره الثالثه",
//            "المجاوره الرابعه",
//            "المجاوره الخامسه",
//            "مناطق فرعية بالحي التاسع"
//        ];
//        $parent = Location::where('name', 'الحي التاسع')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "شارع رقم 100",
//        ];
//        $parent = Location::where('name', 'الحي العاشر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المجاوره الاولى",
//            "المجاوره الثانيه",
//            "المجاوره الثالثه",
//            "المجاوره الرابعه",
//            "شارع 33",
//            "شارع 34",
//            "شارع 45",
//            "شارع 43",
//            "شارع 42",
//            "شارع 30",
//            "شارع 35",
//            "المروة",
//            "شارع 20",
//            "شارع 16",
//            "شارع 12",
//            "شارع 10",
//            "شارع 23",
//            "شارع 31",
//            "عبد اللطيف سلام"
//        ];
//        $parent = Location::where('name', 'الحي الحادي عشر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "المجاوره الأولى",
//            "المجاوره الثانيه",
//            "المجاوره الثالثه",
//            "المجاوره الرابعه",
//            "المجاوره الخامسه",
//            "شارع 35",
//            "شارع 32",
//            "شارع 31",
//            "شارع 30",
//            "شارع 13",
//            "شارع 37",
//            "شارع 10",
//            "شارع 20",
//            "شارع 21",
//            "شارع 23",
//            "شارع 14",
//            "شارع 15",
//            "شارع 12",
//            "شارع 40",
//            "شارع 50",
//            "كلية هارفست البريطانيه",
//            "المدرسة المصرية الدولية بالشيخ زايد",
//            "مسجد الروحان",
//            "طريق الشباب",
//            "ماسبيرو",
//            "مناطق فرعية بالحي الثالث عشر"
//        ];
//        $parent = Location::where('name', 'الحي الثالث عشر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "السلام",
//            "شارع الشباب",
//            "شارع عمرو حسن",
//            "مناطق فرعية بالحي الرابع عشر"
//        ];
//        $parent = Location::where('name', 'الحي الرابع عشر')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = [
//            "جرينز",
//            "رويال سيتي",
//            "مون لاند",
//            "بيل فيل",
//            "تارا",
//            "زايد 2000",
//            "حدائق السليمانية",
//            "الجزيره",
//            "سما زايد",
//            "ريتش مونت",
//            "حدائق المهندسين",
//            "الكرمه 1",
//            "زايد ديونز",
//            "أوبرا سيتي",
//            "الكرمه 2",
//            "حدائق الكونتينتال",
//            "كمبوند جيرا - ايوان",
//            "كمبوند جوار - ايوان",
//            "الكرمه ريزيدنس",
//            "بيفرلي هيلز",
//            "كمبوند ويست تاون - سوديك",
//            "كازا - بالم هيلز",
//            "كمبوند الجريا - سوديك",
//            "رويال ميدوز",
//            "ميدوز بارك",
//            "زايد ريجنسي",
//            "تلال الجزيره",
//            "الكرمه 4",
//            "الجوهره",
//            "الربوه",
//            "ذا أدريس",
//            "الصفوه",
//            "فيلج جاردنز",
//            "جرين هيلز",
//            "الخمائل",
//            "بيراميدز ووك - وادي دجلة",
//            "الكرمه 3",
//            "رايوس",
//            "بالميرا",
//            "ميديا فيلج",
//            "أكتوبر هيلز",
//            "لا فيل",
//            "البستان ريزيدنس",
//            "كناريا",
//            "كمبوند أتريو - ايوان",
//            "كونتنينتال فيلاز",
//            "جرين ٣",
//            "فورتي ويست",
//            "ذا بوليجون",
//            "روضة زايد",
//            "المستقبل",
//            "بدر الدين",
//            "ذا كورت يارد",
//            "زهرة المدائن",
//            "الدبلوماسيين",
//            "تيامو سيتي",
//            "بيكنيك بارك",
//            "كونتنتال ريزيدنس",
//            "ذا كور ريزيدنس",
//            "كمبوند الباتيو زهراء - لافيستا",
//            "سيرينا",
//            "كابيتال بيزينس بارك",
//            "كاتاليا",
//            "كمبوند الياسمين",
//            "كمبوند ألما - ايوان",
//            "كمبوند إتابا - سيتى ايدج",
//            "جينوفا",
//            "بالم هيلز أكتوبر جولف اكستنشن",
//            "زايد ريزيدنس",
//            "كارمن ريزدينس",
//            "كاب ستون كليف ريزيدنس - باراجون ",
//            "كمبوند ذا بلوك - مباني ادريس",
//            "جنة زايد",
//            "مرتفعات الأشرافية",
//            "أبراج زيد - اورا",
//            "كمبوند جامعة القاهرة",
//            "ليجندا",
//            "كمبوند كايرو جيت - اعمار",
//            "حي الندا",
//            "دار مصر",
//            "وان سكستي",
//            "درة",
//            "كمبوند فيلدج ويست - درة",
//            "ويست مارك - ريل مارك",
//            "تريفيوم زايد - إنماء",
//            "ويست لان - بالم هيلز",
//            "الكارما 4",
//            "أجورا",
//            "كابيتال مول - المنارة",
//            "أتريوم بلازا مول - درة",
//            "ايفوري بيزنس بارك",
//            "سوديك ويست",
//            "ريتزي بلازا مول - طيبه",
//            "دي 9 مول - ديماند",
//            "كمبوند وان 16 - سوديك",
//            "لا فونتانا",
//            "بلينسيا ريزيدنس - همام",
//            "كمبوند الجومان",
//            "جرين ريزيدنس 2",
//            "جنة 1",
//            "جنة 2",
//            "اركان بلازا مول - البدر",
//            "كمبوند أودي بالاس - اركان",
//            "تمارا ريزيدنس - جوار",
//            "رويال جاردنز",
//            "مول كرمة 4 - بدر الدين",
//            "سنترو زايد مول - ايهاف",
//            "بارك ستريت مول - سكاي",
//            "مول 205 - اركان بالم",
//            "ريزيدنس 205 - اركان بالم",
//            "الكارما كاي",
//            "زيد ستريب مول - أورا",
//            "ذا ايت - الجابري",
//            "مول 101",
//            "سيتيو - الخليفه جروب",
//            "تويلف",
//            "ووك اوف كايرو مول",
//            "سيلفر مول",
//            "روضة المهندسين",
//            "كمبوند رؤية",
//            "مول حياة كلينكس - شركة الفيوم",
//            "تراس - بنك الاسكان والتعمير"
//        ];
//        $parent = Location::where('name', 'كمبوند بالشيخ زايد')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }
//
//
//
//
//
//
//
//
//
//
//
//
//        $items = ;
//        $parent = Location::where('name', 'الشيخ زايد الجديدة')->first();
//        foreach ($items as $item) {
//            DB::table('locations')->insert([
//                'name' => $item,
//                'parent_id' => $parent->id,
//                'created_at' => date(now()),
//                'updated_at' => date(now()),
//            ]);
//        }














    }
}
