<?php

namespace Database\Seeders;

use App\Models\Location;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class LocationNewSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $items = [
            'القاهرة الكبرى',
            'الاسكندرية',
            'الساحل الشمالى',
            'مرسى مطروح',
            'العين السخنة',
            'الغردقة / البحر الأحمر',
            'راس سدر',
            'شرم الشيخ',
            'الدقهلية',
            'الشرقية',
            'الغربية',
            'الاسماعيلية',
            'دمياط',
            'السويس',
            'البحيرة',
            'أسوان',
            'الاقصر',
            'أسيوط',
            'المنوفية',
            'قنا',
            'سوهاج',
            'شمال سيناء',
            'الفيوم',
            'بور سعيد',
            'كفر الشيخ',
            'بني سويف',
            'المنيا',
            'الوادي الجديد',
            'القليوبية',
            'جنوب سيناء',
            'رأس غارب / البحر الأحمر',
        ];
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => null,
                'series' => 1,
            ]);
        }

/*******
    Start Cairo
 ********/
        $subs_cairo = [
            'القاهرة الجديدة',
            '6 أكتوبر',
            'مدينة الشيخ زايد',
            'مصر الجديدة',
            'مدينة نصر',
            'المعادي',
            'العبور',
            'فيصل',
            'الزمالك',
            'المهندسين',
            'الدقي',
            'الهرم',
            'الجيزة',
            'المقطم',
            'حلوان',
            'عين شمس',
            'مدينة بدر',
            'العاشر من رمضان',
            'جاردن سيتي',
            'وسط البلد',
            'الزيتون',
            'حدائق القبة',
            'حدائق الأهرام',
            'شبرا',
            'إمبابة',
            'العجوزة',
            'المنيل',
            'العباسية',
            '15 مايو',
            'السيده زينب',
            'الخليفة',
            'العمرانية',
            'دار السلام',
            'الاميريه',
            'المطرية',
            'الوايلي',
            'المرج',
            'مدينة السلام',
            'الشرابيه',
            'الزاوية الحمراء',
            'منشية ناصر',
            'البساتين',
            'بشتيل',
            'المنصوريه',
            'كرداسه',
            'هليوبوليس الجديدة',
            'مصر القديمة',
            'مناطق فرعية بالقاهرة الكبرى',
            'العاصمة الإدارية الجديدة',
            'مدينة الشروق',
            'أوسيم',
            'العياط',
            'طريق اسكندرية الزراعي',
            'الطريق الدائري الأوسطي',
        ];
        $parent = Location::where('name', 'القاهرة الكبرى')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
'series' => $parent->series +1,
            ]);
        }

        $items = [
            'البنفسج',
            'اللوتس',
            'المستثمرين الشمالية',
            'المستثمرين الجنوبية',
            'النرجس',
            'أرض الزهور',
            'الياسمين',
            'المنطقة الصناعية',
            'تقسيم الأندلس',
            'التمر حنه',
            'التجمع الاول',
            'التجمع الثالث',
            'غرب أربيلا',
            'أرابيلا',
            'غرب الجولف',
            'جنوب الأكاديمية',
            'شرق الأكاديمية',
            'القطامية',
            'كمبوند بالتجمع الخامس',
            'خلف ميراج سيتي',
            'الدبلوماسيين',
            'مدينة الرحاب',
            'مدينتي',
            'مناطق فرعية بالقاهرة الجديدة',
            'بيت الوطن',
            'دار مصر',
            'مدينة المستقبل',
            'الأندلس الجديدة',
            'إمتداد القاهرة الجديدة',
            'المربع الذهبي',
            'طريق السويس',
            'اللوتس الجديدة',
            'داون تاون',
            'محور محمد نجيب',
            'الحي الاول',
            'النرجس الجديدة',
            'شمال الرحاب',
            'حي اسكان الجامعة الامريكية',
            'شارع مجمع البنوك',
            'امتداد المستثمرين الشمالية',
            'القطاع الثالث',
            'جمال عبد الناصر',
            'القطامية الجديدة',
            'مثلث الأمل',
            'التجمع الخامس',
            'القطاع الأول',
            'محور السادات',
            'القطاع الثاني',
            'القطاع الرابع',
        ];
        $parent = Location::where('name', 'القاهرة الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "غرب سوميد",
            "الأحياء",
            "جنوب الأحياء",
            "حدائق أكتوبر",
            "التوسعات الشمالية",
            "الحي المتميز",
            "المنطقة الصناعية",
            "كمبوند في ٦ اكتوبر",
            "مناطق فرعية ب 6 أكتوبر",
            "جنوب الواحات",
            "واحة أكتوير",
            "أكتوبر الجديدة",
            "جمعية المستثمرين",
            "المحصورات",
            "بيت الوطن",
            "الحصري",
            "محور البوليفارد",
            "المستثمر الصغير",
            "التوسعات الشرقية",
            "الظهير الصحراوي لمحافظة الجيزة",
            "الاسكان المميز",
            "طريق وصلة دهشور",
            "شارع دريم لاند",
            "طريق 6 اكتوبر وادي النطرون",
            "ميدان جهينة",
            "جمال عبد الناصر",
            "طريق الواحات",
            "المنطقة العمرانية الثانية",
            "حي البشاير"
        ];
        $parent = Location::where('name', '6 أكتوبر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "طريق اسكندرية الصحراوي",
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي التاسع",
            "الحي العاشر",
            "الحي الحادي عشر",
            "الحي الثاني عشر",
            "الحي الثالث عشر",
            "الحي الرابع عشر",
            "الحي السادس عشر",
            "الثورة الخضراء",
            "كمبوند بالشيخ زايد",
            "حي الياسمين",
            "مناطق فرعية بمدينة الشيخ زايد",
            "بيت الوطن",
            "القرية الذكية",
            "الحي الثامن عشر",
            "الشيخ زايد الجديدة",
            "الحي السابع عشر",
            "الحي الخامس عشر",
            "شارع البستان",
            "شارع الشباب"
        ];
        $parent = Location::where('name', 'مدينة الشيخ زايد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أرض الجولف",
            "الماظة",
            "شيراتون",
            "النزهة الجديدة",
            "جسر السويس",
            "الكوربة",
            "ميدان هليوبوليس",
            "ميدان روكسي",
            "ميدان الحجاز",
            "ميدان سانت فاتيما",
            "ميدان تريومف",
            "الخليفة المأمون",
            "العروبة",
            "الميرغني",
            "الثورة",
            "عبدالحميد بدوي",
            "سفير",
            "الميريلاند",
            "ميدان المحكمة",
            "شارع النزهة",
            "عمارات العبور",
            "سيتي ستارز",
            "مناطق فرعية بمصر الجديدة",
            "كمبوند بمصر الجديدة",
            "منشية البكري",
            "ميدان الأسماعيلية",
            "سفارة الإمارات"
        ];
        $parent = Location::where('name', 'مصر الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي العاشر",
            "زهراء مدينة نصر",
            "حي السفارات",
            "حي الواحة",
            "شارع مكرم عبيد",
            "شارع عباس العقاد",
            "شارع مصطفى النحاس",
            "مدينة التوفيق",
            "إمتداد رمسيس",
            "رابعة العدوية",
            "المنطقة الأولى",
            "الحديقة الدولية",
            "المنطقة الثامنة",
            "المنطقة التاسعة",
            "المنطقة العاشرة",
            "النادي الأهلي",
            "مساكن الشروق",
            "جنينة مول",
            "السراج مول",
            "طيبة مول",
            "أرض المعارض",
            "طريق النصر",
            "عزبة الهجانة",
            "مدينة الفتح",
            "ذاكر حسين / الميثاق",
            "يوسف عباس",
            "شارع الطيران",
            "شارع حسن المأمون",
            "شارع أحمد فخري",
            "شارع أبو داود الظاهري",
            "مناطق فرعية بمدينة نصر",
            "كمبوند بمدينة نصر",
            "عزبة العرب",
            "جنوب مدينة نصر",
            "المنطقة السادسة",
            "شارع عبد الرازق السنهوري",
            "شارع محمد حسنين هيكل",
            "نادي السكة",
            "علي أمين",
            "شارع خضر التوني",
            "الحي السويسري",
            "عمارات السعودية",
            "مساكن المهندسين",
            "عمارات ميلسا",
            "شارع السباح عبد المنعم الشربيني",
            "محور المشير طنطاوي",
            "رابعه الاستثماري",
            "عمارات المدفعية",
            "عمارات رامو",
            "المنطقة الحرة",
            "الجبل الأحمر"
        ];
        $parent = Location::where('name', 'مدينة نصر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "كورنيش المعادي",
            "سرايات المعادي",
            "المعادي الجديدة",
            "دجلة",
            "المعادي القديمة",
            "أوتوستراد",
            "كمبوند بالمعادي",
            "زهراء المعادي",
            "دائري المعادي",
            "صقر قريش",
            "عرب المعادي",
            "حدائق المعادي",
            "مناطق فرعية بالمعادى",
            "ثكنات المعادي",
            "شارع العروبة",
            "مدينة المعراج",
            "شارع 7",
            "طريق مصر حلوان الزراعي",
            "شارع 9",
            "شارع 6",
            "طرة البلد",
            "ميدان الحرية",
            "شارع 161",
            "شارع 106",
            "شارع 105",
            "طرة",
            "جزيرة المعادي",
            "معادي الخبيري"
        ];
        $parent = Location::where('name', 'المعادي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي التاسع",
            "المناطق الصناعية",
            "إسكان الشباب",
            "إسكان المستقبل",
            "جمعية عرابي",
            "مناطق فرعية بالعبور",
            "كمبوند بمدينة العبور",
            "طريق مصر - إسماعيلية الصحراوي",
            "العبور الجديدة",
            "الحي الترفيهي"
        ];
        $parent = Location::where('name', 'العبور')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المريوطية",
            "الكوم الاخضر",
            "التعاون",
            "المطبعة",
            "الطالبية",
            "مدكور",
            "أول فيصل",
            "كفر طهرمس",
            "شارع الملك فيصل",
            "شارع العشرين",
            "شارع الثلاثيني",
            "طريق كعببيش",
            "الطوابق",
            "شارع الصفا والمروة",
            "كفر نصار",
            "مناطق فرعية بفيصل"
        ];
        $parent = Location::where('name', 'فيصل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "ابو الفدا",
            "الجبلاية",
            "الزمالك القبليه",
            "26 يوليو",
            "مناطق فرعية بالزمالك",
            "شارع محمد مظهر",
            "شارع نشأت",
            "شارع كمال الطويل (المنتزه سابقا)",
            "شارع مطر",
            "ايكونيا الزمالك - سامكريت",
            "كورنيش النيل - الزمالك",
            "شارع بهجت علي",
            "شارع أحمد حشمت",
            "شارع الجزيرة الوسطي (يوسف كامل)",
            "شارع المنصور محمد",
            "شارع العادل ابو بكر",
            "شارع محمد مرعشلي",
            "شارع اسماعيل محمد",
            "شارع طه حسين",
            "شارع يحيي إبراهيم",
            "شارع حسن عاصم",
            "شارع سري لانكا"
        ];
        $parent = Location::where('name', 'الزمالك')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع جامعة الدول العربية",
            "شارع السودان",
            "شارع أحمد عرابي",
            "شارع وادي النيل",
            "شارع شهاب",
            "شارع الحجاز",
            "شارع سوريا",
            "ميدان لبنان",
            "ميدان سفنكس",
            "التوفيقية",
            "ميت عقبة",
            "جزيرة العرب",
            "مناطق فرعية بالمهندسين",
            "شارع عمر طوسون",
            "شارع جول جمال",
            "شارع لبنان",
            "شارع 26 يوليو",
            "شارع عبد الحميد لطفي",
            "شارع الرياض",
            "شارع القدس الشريف",
            "شارع نابلس",
            "شارع دجلة",
            "شارع أنس بن مالك",
            "شارع عدن",
            "شارع دمشق",
            "شارع طيبة",
            "شارع المأمون",
            "شارع الخليل",
            "شارع البصرة",
            "شارع أبو بكر الصديق",
            "شارع الحسين",
            "شارع الاعناب",
            "شارع أحمد خلف",
            "شارع الإسراء",
            "شارع العراق",
            "شارع غزة",
            "شارع المنصوره"
        ];
        $parent = Location::where('name', 'المهندسين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مصدق",
            "البحوث / التحرير",
            "البطل أحمد عبد العزيز",
            "ميشيل باخوم",
            "محيي الدين ابو العز",
            "شارع الدقي",
            "شارل ديجول",
            "كورنيش النيل",
            "منطقة نادي الصيد",
            "ميدان المساحة",
            "بين السرايات",
            "مناطق فرعية بالدقي",
            "ميدان فيني",
            "شارع قمبيز",
            "شارع الثورة",
            "شارع الفواكه",
            "شارع بابل",
            "شارع الزهراء",
            "ميدان مسجد الصحابة",
            "شارع عمر بن الخطاب",
            "ميدان الجمهورية",
            "شارع محمد كامل مرسي",
            "شارع رشدان",
            "شارع الانصار",
            "شارع جده",
            "شارع عمان",
            "شارع محمد خلف",
            "شارع ابن الاخشيد"
        ];
        $parent = Location::where('name', 'الدقي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "نصر الدين",
            "المساحة",
            "مدكور",
            "الطالبية",
            "المطبعة",
            "التعاون",
            "العريش",
            "المريوطية",
            "مشعل",
            "الرماية",
            "نزلة البطران",
            "نزلة السمان",
            "شارع الهرم",
            "شارع خاتم المرسلين / ترسا",
            "طريق الفيوم",
            "شارع ناصر الثورة",
            "شارع فاطمة رشدي",
            "شارع الثلاثيني",
            "بولاق الدكرور",
            "مناطق فرعية بالهرم",
            "اللبيني",
            "شارع الوحدة العربية",
            "كايرو مول"
        ];
        $parent = Location::where('name', 'الهرم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "ميدان الجيزه",
            "جامعة القاهره",
            "شارع مراد / شارل ديجول",
            "البحر الأعظم",
            "أم  المصريين",
            "ساقية مكي",
            "المنيب",
            "جزيرة الدهب",
            "الوراق",
            "حى الجيزة",
            "أبو النمرس",
            "شارع المحطة",
            "مدينة طربول",
            "الواحات البحرية",
            "شارع ترعة الزمر",
            "البدرشين "
        ];
        $parent = Location::where('name', 'الجيزة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الهضبة الوسطى",
            "شارع 9",
            "شارع المقطم",
            "كورنيش المقطم",
            "ميدان النافورة",
            "الحي الخامس",
            "الحي السادس",
            "الدبلوماسيين",
            "حي الأشجار",
            "مدينة التجاريين",
            "منطقة جنوب س",
            "حي الأسمرات",
            "مناطق فرعية بالمقطم",
            "الدويقة",
            "كمبوند بالمقطم",
            "مساكن الزلزال",
            "الهضبة العليا",
            "السبعين فدان",
            "المفارق",
            "أرض المباحث"
        ];
        $parent = Location::where('name', 'المقطم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مناطق فرعية بحلوان",
            "حدائق حلوان",
            "وادي حوف",
            "العزبة القبلية",
            "المجاورة الرابعة المشروع الأمريكي",
            "منشية حلوان الجديدة",
            "مجاورة 2",
            "مجاورة 3",
            "تقسيم النصر",
            "عرب الوالدة",
            "عرب غنيم",
            "منشية عين حلوان",
            "المعصرة",
            "كورنيش حلوان",
            "أطلس",
            "حلوان الشرقية"
        ];
        $parent = Location::where('name', 'حلوان')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "النعام",
            "عين شمس الشرقية",
            "مناطق فرعية بعين شمس",
            "ألف مسكن",
            "شارع عشم الله",
            "شارع الوحدة العربية",
            "شارع السوق",
            "شارع أحمد ذكي",
            "شارع تادرس اسطفانوس",
            "شارع 6 أكتوبر",
            "شارع محمد العربي",
            "شارع أحمد عصمت",
            "شارع اسيوط",
            "شارع عمان ",
            "شارع الهادي سلامه",
            "شارع حسن سيد أحمد",
            "شارع يعقوب بطرس",
            "شارع احمد جبر",
            "عين شمس الغربية",
            "العرب",
            "جسر السويس",
            "منشية التحرير",
            "زهراء الحلمية"
        ];
        $parent = Location::where('name', 'عين شمس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "كمبوند فى بدر",
            "مدينة بدر",
            "حي النزهة - الحي الأول",
            "حي الصفوة - الحي الثاني",
            "حي الياسمن - الحي الثالث",
            "حي الكوثر - الحي الرابع",
            "حي الزهور - الحي الخامس",
            "حي الأمل - الحي الأقتصادي",
            "حي الأشجار - الحي المتميز",
            "حي البنفسج - الحي السادس",
            "الحي الايطالي",
            "داون تاون بدر",
            "منطقة الاسكان المتميز",
            "حي الأندلس - الحي السابع ",
            "مركز رجال الأعمال",
            "منطقة 100 فدان",
            "منطقة الحرفيين",
            "شرق الروبيكي"
        ];
        $parent = Location::where('name', 'مدينة بدر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحى الاوربى",
            " الحى الأول",
            "الحي اليوناني",
            "الحي الثاني  ",
            "الحي الثالث",
            "المنطقة الاردنية  ",
            "المنطقة الصناعية",
            "الروبيكي",
            "منطقة ال 6 مليون",
            "منطقة ال710 فدان",
            "منطقة الصناعات المتوسطة - B1",
            "منطقة الصناعات المتوسطة- B2",
            "منطقة الصناعات المتوسطة - B3",
            "منطقة الصناعات المتوسطة - B4",
            "الحي السادس ",
            "الحي السابع ",
            "الحي الثامن ",
            "الحي التاسع ",
            "الحي العاشر ",
            "الحي الحادي عشر ",
            "الحي الثاني عشر ",
            "الحي الثالث عشر ",
            "الحي الرابع عشر ",
            "الحي الخامس عشر ",
            "الحي السادس عشر",
            "الحي السابع عشر",
            "الحي الثامن عشر ",
            "الحي التاسع عشر ",
            "الحي العشرين ",
            "الحي الواحد والعشرون",
            "الحي الثاني والعشرون ",
            "الحي الثالث والعشرون ",
            "الحي الرابع والعشرون",
            "الحي الخامس والعشرون ",
            "الحي السادس والعشرون ",
            "الحي السابع والعشرون ",
            "الحي الثامن والعشرون ",
            "الحي التاسع والعشرون ",
            "الحي الثلاثون ",
            "الحي الواحد وثلاثون",
            "الحي الثاني وثلاثون",
            "الحي الثالث وثلاثون",
            "الحي الرابع وثلاثون ",
            "الحي الخامس وثلاثون ",
            "الحي السادس وثلاثون ",
            "الحي السابع وثلاثون",
            "الحي الثامن وثلاثون ",
            "الحي التاسع وثلاثون ",
            "الحي الاربعين ",
            "الحي الواحد واربعون ",
            "الحي الثاني واربعون ",
            "الحي الثالث واربعون ",
            "الحي الرابع"
        ];
        $parent = Location::where('name', 'العاشر من رمضان')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع الحديقه",
            "شارع توفيق دياب",
            "شارع المستشار محمد فهمي السيد",
            "شارع أحمد راغب",
            "شارع د. محمد فوزي",
            "شارع جمال الدين أبو المحاسن",
            "شارع عائشة التيموريه",
            "شارع الطلمبات",
            "شارع عبد اللطيف بلطيه",
            "شارع كمال الدين حسين",
            "شارع إبراهيم نجيب",
            "شارع الجهاديه",
            "شارع ايزيس",
            "شارع عبد الرحمن فهمي",
            "شارع الشمس",
            "شارع الإبراهيمي",
            "شارع خليل اغا",
            "شارع اتحاد المحامين",
            "شارع لاظوغلي",
            "شارع اوزوريس",
            "شارع الديوان",
            "شارع السراي الكبري",
            "شارع أحمد باشا",
            "شارع البرجاس",
            "شارع كامل الشناوي",
            "شارع الدكتور حندوسة",
            "شارع حوض اللبن",
            "شارع جميصي",
            "شارع مديرية التحرير",
            "شارع القصر العيني"
        ];
        $parent = Location::where('name', 'جاردن سيتي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "التحرير",
            "التوفيقيه",
            "مناطق فرعية بوسط البلد",
            "الموسكى",
            "الأزبكيه",
            "العتبه",
            "عابدين",
            "باب اللوق",
            "الدرب الأحمر",
            "الجماليه",
            "الحلميه",
            "قصر النيل",
            "بولاق أبو العلا",
            "الفسطاط",
            "السكاكيني",
            "غمرة",
            "باب الشعرية",
            "الفجالة",
            "الحسينية",
            "الدراسة",
            "الاباجيه",
            "زينهم",
            "الفلكي",
            "القصر العيني",
            "طلعت حرب",
            "ابراج ماسبيرو - سيتي ايدج",
            "رمسيس",
            "اركاديا مول - الأهلى صبور"
        ];
        $parent = Location::where('name', 'وسط البلد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "حدائق الزيتون",
            "الزيتون البحرية",
            "الزيتون الغربية",
            "حلمية الزيتون",
            "الزيتون الشرقية"
        ];
        $parent = Location::where('name', 'الزيتون')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مصر والسودان",
            "سراي القبة",
            "حمامات القبة",
            "دير الملاك",
            "مناطق فرعية بحدائق القبة",
            "منشية الصدر",
            "شارع حسن",
            "شارع أسامة خليل",
            "شارع محمد سعيد",
            "شارع الخليج المصري",
            "شارع المدارس",
            "حارة معمل الالبان",
            "حارة أحمد رفاعي",
            "حارة سليمان أبو العلا",
            "شارع المستوقد",
            "شارع سعد إبراهيم",
            "شارع الشناوي",
            "حارة علي منصور",
            "حارة الجامع",
            "حارة صابر عبده",
            "حارة محمد غريب",
            "حارة العقبي",
            "شارع كيرلس",
            "شارع حسن رضوان",
            "شارع نصر الدين محمد",
            "شارع ترعة الجبل",
            "شارع دياب فهمي",
            "حارة اسحاق",
            "حارة مصطفي شرف",
            "شارع رقم 3",
            "شارع نجيب ميخائيل",
            "شارع أمين كيرلس",
            "شارع عبد الرحمن الكواكبي",
            "شارع عاصم",
            "حارة أبو الخير",
            "شارع سليمان نجيب",
            "شارع رقم 4",
            "شارع قاسم أمين",
            "شارع الشيخ الفيومي",
            "شارع إسماعيل الشيمي",
            "شارع علي شعراوي باشا",
            "شارع ولي العهد",
            "شارع الكنيسة",
            "شارع عطوة حسن",
            "شارع اسكندر مسعود",
            "شارع فائق جبرائيل",
            "حارة حليم اسكندر",
            "شارع المدرس",
            "شارع مختار سالم",
            "شارع صادق جرجس",
            "شارع عطفة محمد صالح",
            "شارع سعيد علي",
            "شارع عبد الشافي حسن",
            "شارع عبد المجيد خليل",
            "شارع إمام إبراهيم",
            "شارع عبد الهادي السباعي",
            "شارع محمد عبد الحليم",
            "شارع علي أبو عيش",
            "شارع أبو سيف",
            "شارع الحسامي",
            "شارع الفرن",
            "شارع محمود سماحه",
            "حارة خضر إبراهيم",
            "حارة محمد مغاوري",
            "حارة عمر",
            "حارة عبد الملك إبراهيم",
            "حارة أبو السعود",
            "فخري سيد",
            "حارة حفناوي",
            "حارة محمد حنفي",
            "شارع محمد علي خليل",
            "شارع عطية عبد اللطيف",
            "شارع حارة ورث خله",
            "شارع حارة عبد العاطي أحمد عليوه",
            "شارع حسن محمود",
            "شارع ترعة حمزة",
            "شارع ناصف",
            "شارع الاشموني",
            "شارع السيد عباده",
            "شارع حسين محمد حسن",
            "شارع نجيب شكور",
            "شارع سالم محمود",
            "شارع الشيخ النفراوي",
            "شارع أبو ضيف ادم",
            "شارع صديق المنشاوي",
            "شارع الشيخ علي الليثي",
            "شارع فتحي زغلول",
            "شارع أحمد باشا كمال",
            "شارع الشيخ الملواني",
            "شارع الدويدار",
            "شارع علي إسماعيل",
            "حارة سلامه",
            "شارع الجزايرلي",
            "شارع النعماني",
            "شارع علي عمر",
            "شارع عبد العزيز النرش",
            "شارع محمد مرتضي",
            "شارع قدور",
            "شارع عفيفي",
            "شارع الابياري",
            "شارع إبراهيم عيسي",
            "حارة عز الدين",
            "حارة الباجوري",
            "شارع عبد القادر",
            "حارة لطفي",
            "شارع إبراهيم",
            "شارع صالح عبد الهادي",
            "شارع زقاق شلبي",
            "حارة توفيق",
            "شارع الشيخ حسونه",
            "شارع كرم",
            "شارع الشتوي",
            "شارع سكة الوايلي",
            "شارع الفخراني",
            "شارع تمام",
            "شارع خاطر",
            "شارع الببلاوي",
            "شارع علي إسماعيل كامل",
            "شارع محطة القبه",
            "شارع عطفة عفيفي حسنين",
            "شارع شلبي",
            "شارع السد",
            "شارع الزيني",
            "شارع علي كرم",
            "شارع رفعت",
            "شارع حدائق القبة (الجراج سابقا)",
            "شارع أحمد شوقي",
            "حارة يحي الصغير",
            "شارع المنشاوي",
            "شارع القائد",
            "شارع شندورة",
            "حارة خليل الوراقي",
            "شارع حقي",
            "شارع حافظ",
            "حارة حسن الصدر",
            "حارة طه حجازي",
            "شارع جابر",
            "شارع اكابي",
            "حارة سامي",
            "حارة هندي عبد السيد",
            "شارع الشيخ العناني",
            "شارع المحروسه",
            "شارع أحمد زكي",
            "شارع محمد شلبي",
            "شارع أحمد غانم",
            "شارع أحمد عيسي محمد",
            "شارع خليل علي",
            "شارع صالح عمر",
            "حارة منصور",
            "شارع محمد عثمان",
            "شارع محمد سلطان",
            "شارع عيد عبد العزيز",
            "شارع أحمد بسيوني",
            "شارع الشيخ الزرقاني",
            "شارع الشيخ البابلي",
            "شارع أحمد شفيق",
            "شارع محمد محمد وهبه",
            "شارع محمد عبد الكريم",
            "حارة عبد الجواد",
            "حارة أبو لمعي",
            "شارع رقم 2",
            "شارع رقم 5",
            "شارع رقم 6",
            "شارع مغربي المهدي",
            "حارة علي مصطفي",
            "شارع الجامع",
            "شارع الاجهوري",
            "شارع المتنبي",
            "شارع البحتري",
            "شارع سعد نديم الخندق",
            "شارع وسط المنشيه",
            "شارع المنشية الجديدة",
            "شارع أحمد عبد السيد",
            "حارة إدريس",
            "حارة عباس حسن",
            "حارة حسن المغربي",
            "حارة نور الدين",
            "شارع غمرة",
            "حارة برعي",
            "شارع الجداوي",
            "شارع الهواره",
            "شارع الرحمه",
            "شارع حسني حسن",
            "حارة الدربيل",
            "حارة عثمان سالم",
            "شارع محمد السيد",
            "حارة سلطان",
            "شارع سعيد عشماوي",
            "شارع سيد عنبر",
            "شارع حسين عبد الجليل",
            "حارة سيد مصطفي",
            "حارة عبد الجليل عبد الله",
            "شارع غبريال إبراهيم",
            "شارع التوفيق",
            "شارع شبين",
            "شارع خليل إبراهيم",
            "شارع الحسيني",
            "شارع فهمي جندي",
            "شارع شبل محمد",
            "شارع حسني بك",
            "شارع مراغي",
            "شارع قدسي",
            "شارع حسن مصطفي",
            "شارع مبروك إسماعيل",
            "شارع نجيب بسطاروس",
            "حارة السيد حسين",
            "شارع إبراهيم الشريف",
            "شارع أحمد رائف",
            "شارع منقاربوز بشاره",
            "حارة اولتة بوتر",
            "شارع هند عوض",
            "حارة قدسي",
            "شارع سكة دير الملاك",
            "شارع حمدي",
            "شارع محمد مجدي علام",
            "شارع القصر",
            "حارة غرب الدير",
            "حارة الاخوة",
            "حارة الجندي",
            "شارع شوشه",
            "شارع سويلم",
            "شارع بحري الدير",
            "شارع شحاتة أبادير",
            "شارع مرقص اسحاق",
            "شارع فضل",
            "شارع أحمد عيسي",
            "شارع الجناين",
            "شارع سعد الله",
            "شارع العوضي",
            "شارع سامي النجار",
            "شارع بستان عيسي",
            "حارة رقم 5",
            "شارع ميخائيل صليب",
            "حارة محمد ربيعه",
            "شارع دميان",
            "شارع بترو",
            "شارع عثمان",
            "شارع طلعت الصرفي",
            "شارع عريان تادرس",
            "شارع يوسف فهمي",
            "شارع محمد جابر",
            "حارة منقريوس",
            "شارع محمد مدبولي",
            "شارع حسين الشريف",
            "شارع محمد مرسي",
            "شارع عبد العزيز شحاتة",
            "شارع السيد رزق",
            "شارع عاطف بشاي",
            "شارع محمد العشري",
            "شارع بديع ميخائيل",
            "شارع شريف المنياوي",
            "شارع عمر عشماوي",
            "شارع الرملاوي",
            "شارع عبد الملاك",
            "شارع بيومي",
            "شارع حسن شلبي",
            "حارة الماظ",
            "شارع الحاج رضوان",
            "شارع عبد اللطيف زيدان",
            "شارع إسماعيل الترزي",
            "شارع الحصري",
            "شارع عبد التواب علي",
            "شارع أبو طالب",
            "شارع محمد عطية",
            "شارع واصف",
            "شارع علي شاهين",
            "شارع عبد الرحمن النقاش",
            "شارع عبد النبي سليمان",
            "حارة الليثي",
            "حارة المهدي",
            "شارع مصطفي عبد السميع",
            "شارع عبد العليم عبد الرحمن",
            "شارع تامر سليمان",
            "شارع حمادة",
            "شارع أحمد عبد البر",
            "شارع محمد حسن",
            "حارة نجم يوسف",
            "حارة هلال",
            "حارة أحمد نور",
            "شارع إسماعيل يوسف",
            "شارع زكريا يوسف",
            "شارع إمام علي حسن",
            "حارة بطرس",
            "حارة عبد العزيز",
            "شارع غلاب",
            "شارع سويدان",
            "شارع حامد رضوان",
            "شارع فؤاد نصر هندي",
            "شارع اسكندر سعد",
            "شارع إسماعيل رأفت",
            "شارع الشيخ الأمير",
            "شارع أحمد بلال",
            "شارع عوض الله منصور",
            "شارع رضوان",
            "شارع عطفة الورشه",
            "شارع سيد البربري",
            "شارع اللبان",
            "شارع وسط البلد",
            "شارع عبد الوهاب مورو",
            "شارع الشيخ محمد غراب",
            "شارع طنطا",
            "شارع محمود حامد",
            "شارع فاروق عليوة",
            "شارع الحاج أحمد البربري",
            "شارع محمود أحمد البربري",
            "شارع إبراهيم سويدان",
            "شارع الاوقاف",
            "شارع عمارات الاوقاف",
            "شارع آل حسن",
            "شارع محمد عبد الوهاب",
            "شارع أحمد إدريس",
            "شارع الشيخ محمود",
            "شارع المدينة المنورة",
            "شارع الصحابة",
            "شارع الخليل",
            "شارع الصادق",
            "شارع بدر",
            "شارع عرفات",
            "شارع الصفا و المروه",
            "شارع المطرية",
            "شارع مكة المكرمة",
            "شارع ترعة الجندي",
            "إمتداد شارع ولي العهد",
            "شارع زكريا الانصاري",
            "شارع الدكتور جمال محروس",
            "شارع مدرسة عبد العزيز العشماوي",
            "شارع فتحي موسي",
            "شارع محمد علي الوسيمي",
            "شارع محمد شفيق",
            "شارع لطفي إبراهيم",
            "شارع محمد مختار",
            "شارع عبد الجليل البحيري",
            "شارع عبد السلام طنطاوي",
            "شارع عبد الوهاب عبد اللطيف",
            "شارع داير الناحيه",
            "شارع عبد الهادي الخولي",
            "شارع عمر بن الخطاب",
            "شارع وابور المياه",
            "حارة العلاميه",
            "حارة الشهبنه",
            "حارة حسن الشريف",
            "حارة وسط البلد",
            "شارع حيدر",
            "شارع عطفة أحمد حمادة",
            "شارع المساكن",
            "شارع إبراهيم الشيمي",
            "شارع دمنهور",
            "شارع محمد غازي",
            "شارع فوزي محمد خليفة",
            "شارع الساقيه",
            "شارع محمد عبد القادر",
            "شارع محمد إبراهيم",
            "شارع أبو بكر الصديق",
            "شارع المطحن",
            "شارع سلامة عمر",
            "شارع عبد العليم محي الدين",
            "شارع عبد العزيز موسي",
            "شارع صبري الطويل",
            "شارع محمد حسين صالح",
            "شارع حمدي عبد السميع",
            "شارع اسكندر مينا",
            "شارع حمدي مسعود",
            "شارع محمد سعد",
            "شارع شركات البترول",
            "شارع ذكي البحيري",
            "شارع مصيلحي بكر",
            "شارع حمودة سيد أحمد",
            "شارع حسن السواق",
            "شارع محمد قشطة",
            "شارع حسن هلال",
            "حارة الشناوي",
            "حارة خليل عبيد",
            "حارة طة الشيمي",
            "شارع المنوفي",
            "شارع محمد سليمان",
            "شارع عبد العظيم القصاص",
            "شارع مصطفي النحاس",
            "شارع طلبة علام",
            "شارع مصطفي سليمان",
            "شارع علي الخياط",
            "شارع حجاج محمد",
            "حارة أبو العينين",
            "حارة سعد الملوك",
            "حارة علي حسان",
            "شارع محمد عيسي",
            "شارع عبد الفتاح شعيب",
            "حارة حسب النبي",
            "شارع عطفة سيد سلامه",
            "شارع بحري ترعة الجندي",
            "شارع عيد النجار",
            "شارع جابر محمد عيد",
            "شارع مرعي سباغ",
            "شارع محمد علي",
            "شارع الوسيمي",
            "حارة البغدادي",
            "حارة الشهداء",
            "حارة أبو بكر",
            "شارع الحاج محمود",
            "حارة الفقي",
            "شارع عزام",
            "شارع بيومي فرج",
            "شارع ربيع سالم",
            "شارع يوسف عطية",
            "شارع محمد درويش",
            "شارع مصطفي طنطاوي",
            "شارع ثابت العطار",
            "شارع عبد السلام فوده",
            "شارع عبد الحميد عواد",
            "شارع حسن خلف",
            "شارع يوسف عفيفي",
            "شارع منصور النجار",
            "شارع شوقي",
            "شارع عبد الغفار طلبة",
            "شارع عبد الحليم حسين",
            "حارة شكري عبد العظيم",
            "حارة علي عمر أحمد",
            "شارع سليمان محمد سعد",
            "شارع عبد اللطيف عبد السلام",
            "شارع صبحي عبد المجيد فرج",
            "شارع محمد غنيم",
            "شارع محمد مرعي النجار",
            "شارع عبد الحكيم إبراهيم",
            "شارع رمزي يوسف",
            "شارع عبد الله السعدني",
            "شارع محمد متولي همام",
            "حارة فوزي مصطفي",
            "شارع عبد المنعم الديب",
            "شارع إبراهيم فرج",
            "شارع عبد الله أبو شنب",
            "شارع الخلفاوي",
            "حارة طه أحمد طه",
            "حارة نصيف بطرس",
            "شارع عواد أحمد عبد الله",
            "شارع سالم أحمد",
            "شارع عبد الخالق",
            "شارع عبد النبي مصطفي",
            "شارع عبد الحميد محمد",
            "حارة سعيد النوبي",
            "حارة فرج أبو جبل",
            "حارة حسن وحسين",
            "حارة عصران محمد عثمان",
            "شارع إسماعيل سرور",
            "شارع مغاغة",
            "حارة برهان",
            "شارع رجب مصطفي",
            "شارع إبراهيم الدسوقي",
            "حارة إبراهيم عبد الحميد",
            "حارة مغوري السيد جاد",
            "حارة قنصوة",
            "حارة محمد يوسف",
            "شارع السيد أحمد إبراهيم",
            "شارع جلال محمد",
            "شارع رفاعي عبد النبي",
            "حارة أحمد خضير",
            "شارع سيد الحلو",
            "شارع علي شبل",
            "حارة رمضان مرسي نصر",
            "شارع نجدي مرسي",
            "شارع أحمد العيسوي",
            "شارع عبد المقصود عزام",
            "شارع عبد الحي عبد المعطي",
            "حارة أبو الحجاج سليم",
            "شارع محمود أبو رجيلة",
            "حارة أبو العمايم",
            "شارع عبد المنعم العربي",
            "حارة إبراهيم عبد السيد",
            "شارع إبراهيم عبد النبي",
            "شارع عبد الدايم عبد اللطيف",
            "شارع مسلم عبد العزيز",
            "حارة عبد الحميد محروس",
            "شارع سعد عوض الله",
            "حارة فاروق محمد علي",
            "شارع عبد المجيد محروس",
            "شارع مصطفي الشهاوي",
            "شارع كمال الدين عثمان",
            "حارة حمدي مبروك",
            "حارة علي سعيد",
            "شارع مسعد مصطفي إبراهيم",
            "شارع أحمد عبد الوهاب",
            "شارع دسوقي يوسف",
            "شارع محمود جراجي",
            "شارع عبد الهادي سرور",
            "حارة عبد العليم والوسيمي",
            "حارة فكري",
            "حارة خليفة سيد أحمد",
            "شارع محمد خضر",
            "حارة الشيخ ياسين",
            "حارة أحمد السيد الدقن",
            "شارع الإمام علي",
            "شارع أحمد فراج السوداني",
            "شارع محمود علي طه",
            "شارع علي عبد العال",
            "شارع إبراهيم حسين",
            "شارع محمد سيد جاد الله",
            "شارع سليمان عبد الجواد",
            "شارع محمد السيد أحمد",
            "حارة زهران",
            "شارع بكر عواد",
            "شارع عصر",
            "شارع محمود نصار",
            "شارع عبد المنعم خطاب",
            "شارع ايليا أيوب",
            "شارع ربيع الاول",
            "شارع صلاح سالم",
            "شارع محمد الصعيدي",
            "شارع محمد رمضان",
            "شارع محمود عامر",
            "شارع عبد الرحمن الخراش",
            "شارع محمود حجازي",
            "شارع عامر خليفة",
            "حارة عواد الشناوي",
            "شارع إبراهيم أبو العزم",
            "شارع عبد الخالق قنديل",
            "شارع قطب شحاتة",
            "شارع عبد الله عبد العاطي",
            "شارع عبد الفتاح محمد السيد",
            "شارع مصطفي عبيش",
            "شارع نوار",
            "شارع محمد بدوي",
            "شارع أحمد قمحة"
        ];
        $parent = Location::where('name', 'حدائق القبة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع 8 مكرر منطقة ك+ل",
            "شارع رقم 3",
            "شارع اللواء عبد المجيد احمد علام",
            "شارع الجيش",
            "شارع زمزم",
            "شارع ط 9",
            "شارع 7",
            "شارع د ماجد محمد توفيق",
            " شارع الخزان",
            " شارع محمد محمود",
            " شارع حورس",
            "شارع رقم 8",
            "شارع وجيه الصاوي",
            "المنطقة ص",
            "شارع الضغط العالي",
            "شارع رقم 9",
            "شارع قصر التماثيل",
            "متفرع ك رقم 4",
            "شارع رقم 6",
            "شارع رقم 4",
            "شارع سامي سعيد",
            "طريق اسكان الشباب ",
            "شارع الياسمين",
            "شارع ك 5",
            "شارع رقم 5",
            "شارع 34",
            "شارع صحاري سيتي",
            " شارع الدكتور أحمد عبدالله صالح",
            " شارع أحمد علام",
            "منطقة ز",
            "منطقة أ",
            "منطقة ب",
            "منطقة ج",
            "منطقة د",
            "منطقة ن",
            "منطقة ه",
            "بوابة أحمس",
            "المنطقه ك",
            "منطقة س",
            "المنطقه ع",
            "المنطقه ل",
            "المنطقه م",
            "المنطقة ط",
            "المنطقة و",
            "ميديكال جيت - العمران العقارية",
            "ميتنج بوينت مول"
        ];
        $parent = Location::where('name', 'حدائق الأهرام')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "روض الفرج",
            "الساحل",
            "الخلفاوي",
            "شارع كوبانية المياة",
            "شارع عبيد",
            "شارع خليفة",
            "شارع أمين مصطفي",
            "شارع علي شكري",
            "شارع الشيخ مهران",
            "شارع مصطفي حامد",
            "شارع سليمان بدوي",
            "شارع الديروطي",
            "شارع علي فرحات",
            "شارع حسين أمين",
            "حارة طعميه",
            "حارة عبد الوهاب طعميه",
            "شارع نظيف",
            "شارع جمعة محمد",
            "حارة المستوقد",
            "حارة عبد الرازق",
            "حارة علي حسان",
            "حارة إبراهيم إسماعيل",
            "شارع إبراهيم حبشي",
            "شارع حامد عفيفي",
            "شارع مطر",
            "شارع السيد حسن",
            "شارع الشيخ أمين النواوي",
            "شارع عبد الرحيم أحمد",
            "شارع صالح بدوي",
            "شارع مصطفي أسد",
            "شارع محمد مجاهد",
            "شارع علي بهلول",
            "شارع نصر الدين عمر",
            "شارع عويس البحيري",
            "شارع أبو قاسم",
            "شارع المساكن",
            "شارع كمال الدين حسين",
            "شارع المهدي",
            "شارع عباس مرسي",
            "شارع قاسم",
            "شارع الشيخ مصطفي",
            "شارع موسي سلامه",
            "شارع السيوفي",
            "شارع علي إبراهيم",
            "شارع فهيم مصطفي",
            "درب عبد العال",
            "شارع علي خلف",
            "درب الريس عبد الله",
            "شارع الحلي",
            "حارة محمد علي",
            "حارة طلبه",
            "حارة النقيب",
            "عطفة الكردي",
            "حارة يحيي محمد جندي",
            "حارة يونس عبد الله",
            "حارة مسعود",
            "حارة الساقيه",
            "شارع أحمد حنفي",
            "شارع حسن مبروك",
            "حارة عبده خلف",
            "حارة نديم",
            "الترعة البولاقية",
            "المظلات",
            "جزيرة بدران",
            "الخازندارة",
            "شارع شيكولاني",
            "اسكان شبرا ميدان فيكتوريا"
        ];
        $parent = Location::where('name', 'شبرا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "ناهيا",
            "المعتمديه",
            "الكيت كات",
            "مناطق فرعية بإمبابة",
            "مدينة الأمل",
            "أرض الحداد",
            "الياسمين جاردنز",
            "مدينة العمال"
        ];
        $parent = Location::where('name', 'إمبابة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينه الأعلام",
            "ميدان اسوان",
            "كورنيش النيل",
            "شارع نوال",
            "سليمان جوهر",
            "ميدان  فيني / السد العالي",
            "أرض اللواء",
            "مناطق فرعية بالعجوزة",
            "شارع الامل",
            "شارع شاهين",
            "شارع محمد شكري",
            "شارع الفردوس",
            "شارع لطفي حسونه",
            "شارع سالم سالم",
            "شارع حسان حسين",
            "حارة علي بيومي",
            "شارع الشفاء",
            "شارع عبد الحميد سليمان",
            "شارع الشيخ المراغي",
            "شارع محمد طلعت",
            "شارع عبد العظيم باشا راشد",
            "شارع حافظ حسان",
            "شارع د. محمد شاهين",
            "شارع الفريق عبود",
            "شارع محجوب ثابت",
            "شارع المتحف الزراعي",
            "شارع الغيث",
            "شارع ذكي أبو السعود",
            "شارع نجيب محفوظ",
            "شارع مرقص حنا",
            "شارع إبراهيم حافظ",
            "شارع جمال الدين خلوصي",
            "شارع عبد المنعم رياض",
            "شارع طنطا",
            "شارع فريد شوقي",
            "شارع الفالوجا سابقا - الشيخ الحصري",
            "شارع المحروقي",
            "ميدان أبو المحاسن ",
            "شارع الرشيد",
            "شارع الجزائر"
        ];
        $parent = Location::where('name', 'العجوزة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "المنيل الشرقي",
            "المنيل الغربي",
            "كورنيش المنيل",
            "شارع الاخشيد"
        ];
        $parent = Location::where('name', 'المنيل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مناطق فرعية بالعباسية",
            "كمبوند بالعباسية",
            "ميدان الجيش",
            "أحمد سعيد",
            "عبده باشا"
        ];
        $parent = Location::where('name', 'العباسية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مجاورة 1",
            "مجاورة 2",
            "مجاورة 3",
            "مجاورة 4",
            "مجاورة 5",
            "مجاورة 6",
            "مجاورة 7",
            "مجاورة 8",
            "مجاورة 9",
            "مجاورة 12",
            "مجاورة 13",
            "مجاورة 14",
            "مجاورة 15",
            "مجاورة 16",
            "مجاورة 11",
            "مجاورة 17",
            "مجاورة 18",
            "مجاورة 19",
            "مجاورة 20",
            "مجاورة 21",
            "مجاورة 22",
            "مجاورة 23",
            "مجاورة 24",
            "مجاورة 25",
            "مجاورة 26",
            "مجاورة 27",
            "مجاورة 28",
            "مجاورة 29",
            "مجاورة 30",
            "مجاورة 31",
            "مجاورة 32",
            "مجاورة 33",
            "مجاورة 34",
            "مجاورة 35",
            "مجاورة 36"
        ];
        $parent = Location::where('name', '15 مايو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع عمر خيرت",
            "شارع جامع الاسماعيلي",
            "حارة الإسماعيليه",
            "حارة مجلس الشعب",
            " شارع علي عبد اللطيف",
            "شارع الملك الناصر",
            "شارع البابلي",
            "شارع وهبي",
            "حارة عثمان بك",
            "شارع الناصريه",
            "شارع عبد الهادي",
            "شارع الهياتم",
            "شارع ناشد",
            "حارة الخربوطلي",
            "شارع سويقة الالفي",
            "شارع بور سعيد",
            "شارع الرماح",
            "حارة الجمال",
            "شارع يعقوب",
            "درب الكنيسة",
            "شارع عمر الشاه",
            "شارع بهجت",
            "شارع عبد الحميد",
            "شارع النور",
            "شارع الدكتور مصطفي يحيي",
            "شارع عبد الدايم",
            "حارة الوفاء",
            "شارع الرمالي",
            "شارع سكة عمر شاه",
            "شارع الكومي",
            "شارع الحنفي",
            "زقاق جعفر",
            "شارع المنفلوطي",
            "شارع الخليج المصري",
            "شارع الزيري",
            "شارع الشيخ محمد رفعت",
            "شارع بني حسن",
            "حارة سرحان",
            "حارة عزمي",
            "شارع سيدي زينهم",
            "درب البوشي",
            "حارة فؤاد المهندس",
            "شارع شافعي",
            "شارع أبو الخير",
            "حارة النجار",
            "شارع سامي ",
            "عطفة ثابت",
            "شارع مصطفي باشا كامل",
            "الدرب الجديد",
            "درب البندق",
            "شارع مساكن قلعة الكبش",
            "شارع صبحي",
            "حارة عمار",
            "شارع القوادير",
            "حارة الغزلات",
            "حارة القصر الكبير",
            "حارة الأمير يوسف",
            "شارع الوابور",
            "شارع الجارحي",
            "شارع لبيب",
            "شارع جنان الزهري",
            "حارة المدق",
            "شارع جريدة السياسة",
            "شارع علي مرسي",
            "شارع سلامه",
            "شارع العجاتي",
            "شارع العسكر",
            "حارة الغول",
            "شارع عبد الله بن طاهر",
            " شارع محمد فريد",
            "شارع إسماعيل اباظه",
            "حارة البرنس عزيز",
            "حارة الطويل",
            "شارع البركة الناصرية",
            "شارع الاملاك",
            "شارع الليثي إبن الفضل",
            "درب السايس",
            "حارة الكاشف",
            "شارع العمري",
            "شارع المحتسب",
            "حارة مرزوق",
            "شارع زيد بن حاتم",
            "شارع المعمار",
            "شارع عبد الرحمن فكريِ",
            "شارع حسني بك",
            "شارع نوبار",
            "شارع حافظ خليل",
            "شارع النواوي",
            "ميدان السيدة زينب",
            "شارع قارون",
            "شارع الوافديه",
            "حارة القرشيين",
            "درب العجوز",
            "شارع زقاق الأحمدي",
            "شارع محمود بيرم التونسي",
            "شارع العتريس",
            "درب التنايفه",
            "شارع الجزار",
            "شارع إسماعيل فهمي",
            "شارع طنطاوي",
            "شارع يوسف السباعي",
            "شارع الشيخ سليم",
            "شارع الشيخ البغال",
            "شارع سيدي علي",
            "شارع حلوان",
            "شارع جلال",
            "شارع عباس",
            "شارع ممتاز",
            "شارع عبد الملك بن زياد",
            "حارة البنان",
            "شارع بركة البغل",
            "شارع العدوي",
            "شارع التلول",
            "حارة الحسين",
            "شارع نافعي",
            "حارة مظهر",
            "شارع المهندس",
            "شارع أمير الجيش",
            "شارع مقامي",
            "شارع ذكي",
            "شارع عيسي بن منصور",
            "حارة درب البهلوان",
            "عطفة شبكه",
            "حارة سليمان دسوقي",
            "درب القطايعه",
            "شارع مراد",
            "شارع حوش الفيل",
            "حارة العمود",
            "حارة حسن حسني",
            "حارة هنداوي",
            "درب طولون",
            "حارة سكر",
            "شارع درب الشمس",
            "شارع الرحبه",
            "شارع عبد المجيد اللبان",
            "شارع محمد بك أبو الدهب",
            "درب حيدر",
            "شارع سعد زغلول",
            "السد البراني",
            "ميدان السادات",
            "شارع عبد الباقي"
        ];
        $parent = Location::where('name', 'السيده زينب')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع عيسي عيد",
            "شارع الامراء",
            "حارة 6 اكتوبر",
            "شارع خندق مروان",
            "شارع المواصلة",
            "شارع بركات",
            "شارع القادريه",
            "شارع المطبعجي",
            "شارع صبحي الطحاوي",
            "شارع محمد عوض",
            "شارع كامل محسن",
            "شارع محمد مرسي",
            "شارع الكرداسي",
            "شارع النادي",
            "شارع أمين عسكر",
            "شارع التونسي",
            "حارة علي بدوي",
            "شارع سيد عنبر",
            "شارع إبن سهل",
            "شارع الفلكي",
            "شارع البيومي",
            "حارة فرج الله",
            "شارع أبو الدبل",
            "شارع الإمامين",
            "حارة مبروك",
            "شارع عمير",
            "شارع عبد الله العمري",
            "شارع حنفي",
            "شارع الصباغ",
            "شارع الجزار",
            "شارع الاجزجي",
            "شارع أمير الكتاتني",
            "شارع الخلاء",
            "شارع شيخون",
            "شارع الديروطي",
            "شارع المدارس",
            "شارع أحمد حجاج",
            "حارة الفيروز",
            "حارة الاسكندراني",
            "شارع الكرامة",
            "شارع محمود الجندي",
            "حارة محمد ميز",
            "حارة الطحانين",
            "شارع صلاح موسي",
            "شارع البعث",
            "شارع الجمل",
            "شارع الجانيني",
            "شارع سنادة",
            "حارة شديد",
            "شارع الالفي",
            "السيدة عائشه",
            "شارع المجزر",
            "السيدة نفيسة"
        ];
        $parent = Location::where('name', 'الخليفة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الكونيسه",
            "مناطق فرعية بالعمرانية",
            "العمرانية الغربية",
            "العمرانية الشرقية"
        ];
        $parent = Location::where('name', 'العمرانية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع عاشور السرباقوسي",
            "شارع النصر الاكبر",
            "شارع الصفا و المروه",
            "شارع الصفا",
            "أثر النبي",
            "العيسوية",
            "مناطق فرعية بدار السلام"
        ];
        $parent = Location::where('name', 'دار السلام')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "السواح",
            "مناطق فرعية بالأميرية",
            "شارع عمر المختار",
            "شارع المطراوي",
            "شارع حسن أبو عياش",
            "شارع النصر",
            "شارع المسقه",
            "شارع الشهيد سيد فاروق عزب",
            "شارع الفرن",
            "شارع ناصر الصباح",
            "شارع محمود هلال",
            "شارع عبد الغني السيد",
            "شارع البترول",
            "شارع سيد الشافعي",
            "شارع الكردي",
            "شارع علي فهيم",
            "شارع علي عوض",
            "شارع يوسف مهران",
            "شارع بهلول",
            "شارع الفولي",
            "شارع أحمد إبراهيم",
            "شارع محمود هاشم",
            "شارع المشروع",
            "شارع المعتصم بالله",
            "شارع البلسم",
            "شارع العبور",
            "شارع البلسان",
            "شارع المقعد",
            "شارع بئر مريم",
            "شارع إبراهيم بقطر",
            "شارع محمد نصار",
            "شارع حسين الجد",
            "شارع سرور",
            "شارع الجبلايه",
            "شارع محمد مصطفي",
            "شارع سميكة",
            "شارع ماهر",
            "شارع القباني",
            "شارع علي داوود",
            "شارع محمد أحمد صقر",
            "شارع الشعراوي",
            "شارع سيدي إبراهيم",
            "شارع البيطار",
            "شارع سراج منير",
            "شارع أحمد علام",
            "شارع السيد جاد",
            "شارع الصحه",
            "حارة الجبلاوي",
            "حارة محمد رضوان",
            "حارة الجنايني",
            "شارع الشيخ صالح",
            "حارة نور الدين الشرقية",
            "داير الناحيه",
            "شارع حسن شهاب",
            "شارع شعبان عبد ربه",
            "حارة الزهار",
            "حارة إبراهيم عبد الباقي",
            "شارع محمود البحار",
            "شارع حسن عاشور",
            "شارع مصطفي عاشور",
            "حارة العشاير",
            "حارة إبراهيم العربي",
            "شارع السواكني",
            "حارة الدجوي",
            "شارع زاهر عبد الهادي",
            "شارع حسين توفيق",
            "شارع جاد الله",
            "شارع تبري",
            "شارع أحمد عيسي",
            "شارع خلف يوسف",
            "شجرة مريم",
            "العزب",
            "شارع أبو بكر الصديق",
            "شارع علي غيطه",
            "شارع هاتور",
            "شارع عبد الصبور محمد مهدي",
            "شارع زوام",
            "شارع إبراهيم صبيح",
            "شارع ناصر",
            "شارع الزهور",
            "شارع محمد عبد الوهاب",
            "شارع علي إبن أبي طالب",
            "شارع مدكور",
            "شارع صبري عبد الجليل",
            "شارع عبد الله حافظ",
            "شارع حسين عبد الجواد",
            "شارع جورج اسود",
            "شارع محمد مدني",
            "شارع أحمد السعيد حسني",
            "شارع سيد عنبر",
            "شارع مدبولي فرجاني",
            "شارع عبد الكريم",
            "شارع السوق",
            "شارع أحمد عبد الحميد",
            "شارع المصانع",
            "شارع الموقف",
            "شارع عبد الفتاح خفاجة",
            "شارع محمد علي شلتوت",
            "شارع محمد العجمي",
            "شارع محمد الأمين",
            "شارع سور سليمان",
            "شارع أحمد خليل",
            "شارع سليمان ضاحي",
            "شارع الامل",
            "شارع القواس",
            "شارع رجب",
            "شارع عمر بن الخطاب",
            "شارع متولي الزناتي",
            "شارع محمد عبد السلام",
            "شارع عباس مصطفي",
            "شارع عبد الرحمن نصر",
            "شارع إبراهيم الفخراني",
            "شارع حسين شاهين",
            "شارع الدروي",
            "شارع قبلي المساكن",
            "شارع أحمد علوان",
            "شارع الكمال",
            "شارع أحمد رمضان",
            "شارع الخليل رضوان",
            "شارع محمد خطاب",
            "شارع النادي",
            "شارع عزت العشماوي",
            "شارع درويش العربي",
            "شارع عبد الله الحلواني",
            "شارع علي عمران",
            "شارع شعبان العبادي",
            "شارع الازهار",
            "شارع عبد العزيز مصيلحي",
            "شارع محمد حسن",
            "شارع فرماوي",
            "شارع فتحي تهته",
            "شارع زعير",
            "شارع الجرن",
            "شارع رقم 8",
            "شارع حسن فوده",
            "شارع العمده",
            "شارع منطاوي",
            "الكابلات"
        ];
        $parent = Location::where('name', 'الاميريه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "مناطق فرعية بالوايلي",
            "الدمرداش"
        ];
        $parent = Location::where('name', 'الوايلي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "محمد نجيب",
            "مناطق فرعية بالمرج"
        ];
        $parent = Location::where('name', 'المرج')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "جمال عبد الناصر",
            "شارع التروللى",
            "النهضة",
            "اسبيكو",
            "تقسيم الامل",
            "كمبوند الملاحة الجوية",
            "حدائق النزهة"
        ];
        $parent = Location::where('name', 'مدينة السلام')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "مهمشه",
            "العزب"
        ];
        $parent = Location::where('name', 'الشرابيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع سلامة عفيفي",
            "مناطق فرعية بالزاوية الحمراء"
        ];
        $parent = Location::where('name', 'الزاوية الحمراء')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "المنطقة الصناعية ",
            "مساكن أطلس",
            "مناطق فرعية بالبساتين",
            "عزبة النصر"
        ];
        $parent = Location::where('name', 'البساتين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "صفط اللبن",
            "أبو رواش",
            "مناطق فرعية بكرداسة"
        ];
        $parent = Location::where('name', 'كرداسه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "كمبوند فى هليوبوليس الجديدة",
            "طريق المشير أحمد",
            "طريق المشير محمد عبد الغني الجسمي",
            "عمارات هيئة الأوقاف المصرية",
            "شارع مبشر بن عبد المنذر",
            "طريق الفريق سعد الدين الشاذلي",
            "طريق الجامعات",
            "شارع خالد بن الوليد",
            "طريق بدر - هليوبوليس الجديدة",
            "الحي الأول ",
            "المنطقة الرابعة ",
            "الحي الثاني",
            "الحي السادس",
            "الحي الثالث",
            "الحي الخامس"
        ];
        $parent = Location::where('name', 'هليوبوليس الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "زهراء مصر القديمة",
            "الخيالة"
        ];
        $parent = Location::where('name', 'مصر القديمة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "كمبوند بالعاصمة الادارية الجديدة",
            " الحي السكني السابع - R7",
            "مشاريع تجارية بالعاصمة الإدارية الجديدة",
            "الحي السكني الثاني - R2",
            "الحي السكني الأول - R1",
            "الحي السكني الثالث - R3",
            "الحي السكني السادس - R6",
            "الحي السكني الرابع - R4",
            "الحي السكني الخامس - R5",
            "الحي السكني الثامن - R8",
            "الحي المالي",
            "الداون تاون",
            "Mu23",
            "منطقة الأعمال المركزيه",
            "حدائق العاصمة",
            "منطقة المستثمرين",
            "CBD 1 امتداد",
            "CBD 2 امتداد",
            "CO1 الياسمين",
            "CO2 الياسمين",
            "الياسمين 6",
            "الياسمين 5",
            "الياسمين 202",
            "النرجس 11",
            "النرجس 12",
            "النرجس 13",
            "النرجس 14",
            "النرجس 15",
            "محور محمد بن زايد الجنوبي",
            "محور محمد بن زايد الشمالي",
            "منطقة النهر الاخضر",
            "مدينة الثقافة والفنون"
        ];
        $parent = Location::where('name', 'العاصمة الإدارية الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الحي الأول شرق - حي الأندلس",
            "الحي الأول غرب - حي الياقوت",
            "الحي الثاني شرق - حي غرناطة",
            "الحي الثاني غرب - حي الماسة",
            "الحي الثالث شرق - حي ماربيلا",
            "الحي الثالث غرب - حي الفيروز",
            "الحي الرابع - حي اللازورد",
            "الحي الخامس - حي الجوهرة",
            "الحي السادس - حي اللؤلؤة",
            "الحي السابع - حي الزمرد",
            "الحي الثامن - حي الريماس",
            "الحي التاسع - حي البرلنت",
            "المنطقة الأولى - حي الأوركيد",
            "المنطقة الثانية - حي الزهور",
            "المنطقة الثالثة - حي الأشجار",
            "المنطقة الرابعة",
            "المنطقة الخامسة",
            "المنطقة السادسة - حي توليب",
            "المنطقة السابعة",
            "المنطقة الثامنة",
            "المنطقة التاسعة",
            "الإسكان العائلي",
            "إسكان إستثماري",
            "إسكان الشباب 63م",
            "إسكان الشباب 70م",
            "إسكان المستقبل",
            "كمبوند بمدينة الشروق",
            "إسكان الشباب 100م",
            "حى النادى - حي العقيق",
            "غرب ميدان الشروق",
            "طريق الشباب"
        ];
        $parent = Location::where('name', 'مدينة الشروق')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "البراجيل"
        ];
        $parent = Location::where('name', 'أوسيم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }
/*******
    End Cairo
 *********/


        /*******
        Start Alex
         *********/


        $subs_cairo = [
            "سموحة",
            "رشدي",
            "سان ستيفانو",
            "ميامي",
            "كفر عبده",
            "سيدي جابر",
            "لوران",
            "فيكتوريا",
            "سيدي بشر",
            "الهانوفيل",
            "برج العرب",
            "كامب شيزار",
            "جليم",
            "المندرة",
            "العصافرة",
            "محرم بك",
            "الإبراهيمية",
            "فلمنج",
            "ستانلي",
            "بولكلي",
            "زيزينيا",
            "باكوس",
            "جناكليس",
            "المعمورة",
            "سبورتنج",
            "سابا باشا",
            "الحضرة",
            "الشاطبي",
            "كينج مريوط",
            "كليوباترا",
            "المنشية",
            "بحرى - الأنفوشى",
            "المنتزه",
            "العامرية",
            "أبو تلات",
            "مناطق فرعية بالأسكندرية",
            "ميامي الجديدة",
            "سيدى كرير",
            "كمبوند بالأسكندرية",
            "محطة الرمل",
            "السيوف",
            "أبو قير",
            "كرموز",
            "سموحة الجديدة",
            "شدس",
            "ميناء الدخيلة",
            "الإسكندرية الجديدة",
            "برج العرب الجديدة",
            "رأس التين",
            "اللبان",
            "العجمي",
            "أبيس",
            "الطريق الدولي - محور التعمير",
            "طريق القاهرة - برج العرب الصحراوي",
            "القباري",
            "صواري",
            "طريق اسكندرية مطروح"
        ];
        $parent = Location::where('name', 'الاسكندرية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "شارع عبد المنعم الانصاري",
            "شارع عثمان أحمد عثمان",
            "شارع محمد بهاء الدين الغوري",
            "شارع عبد المقصود",
            "شارع النقشبندي",
            "شارع أديمون فريمون",
            "شارع الصفاء",
            "شارع رقم 3 من اسماعيل سري",
            "شارع 303",
            "قرية مبارك الأولمبية",
            "شارع مسجد ناصر",
            "شارع المدائن",
            "طريق المشروع",
            "شارع البرت الأول",
            "شارع الشهيد طيار محمود شاكر عبد المنعم",
            "شارع 308",
            "شارع جمال توكل",
            "شارع الاديب محمد زيتون",
            "شارع محمد فوزي معاذ",
            "شارع رقم 289",
            "شارع الشارع العمومي",
            "شارع 314",
            "شارع الدكتور سيد فهمي",
            "شارع 4 ",
            "شارع النصر",
            "شارع رقم 3",
            "شارع كمال الدين صلاح",
            "طريق ترعة المحمودية",
            "شارع رقم 2",
            "شارع رقم 12",
            "شارع إسماعيل حلمي",
            "شارع مصطفي كامل",
            "ميدان فيكتور عمانوئيل",
            "شارع الزبير بن العوام",
            "شارع توت عنخ امون",
            "شارع عصام حلمي المصري",
            "شارع الدكتور محمد داوود",
            "شارع ممر عمارات بستان بسموحة",
            "شارع الفريق محمد فوزي",
            "شارع 15 مايو",
            "شارع الاندلس",
            "شارع الزهراء",
            "شارع متفرع من عيد فهمي رقم 1",
            "شارع الروضة",
            "شارع حسن علام",
            "شارع الاخلاص",
            "شارع الشيماء",
            "شارع الفاروق عمر",
            "شارع زكي رجب",
            "شارع الملحق",
            "شارع أبو بكر الصديق رقم. 1",
            "شارع عمر بن الخطاب رقم 2",
            "شارع الفتح",
            "شارع عثمان بن عفان رقم 3",
            "شارع علي بن أبي طالب",
            "شارع رقم.351",
            "شارع أبو عبيده بن الجراح",
            "شارع مصعب بن عمير",
            "شارع بلال بن رباح",
            "شارع إسماعيل سري",
            "شارع المستشار محمود العطار",
            "شارع الفردوس",
            "شارع عبد الرحمن بن عوف",
            "شارع سعد بن أبي وقاص",
            "شارع سعد بن معاذ",
            "شارع 6 اكتوبر",
            "شارع السلام",
            "شارع خلف محمود شاكر عبد المنعم",
            "شارع اللواء عبد التواب هديب",
            "شارع 288",
            "شارع رقم 1",
            "شارع فيكتور ايمانويل الثالث",
            "شارع 38",
            "شارع الدكتور يحيي المشد",
            "ميدان الشهداء",
            "شارع جرين بلازا",
            "ميدان المسلة",
            "شارع حذيفة بن اليمان",
            "شارع إبن الخطاب",
            "شارع النور",
            "شارع الهلتون",
            "تقسيم القضاه",
            "شارع محمد أبو الفتوح حساب ( الرياده )",
            "شارع النقل والهندسة بسموحة",
            "تعاونيات سموحة",
            "تراس سموحة - سوليك جروب",
            "مروج"
        ];
        $parent = Location::where('name', 'سموحة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع مقدم مدحت المليجي",
            "شارع رقم 5 ",
            "شارع ميخائيل ابادير",
            "شارع رقم 8",
            "شارع 4",
            "شارع رقم 12",
            "شارع سوريا",
            "شارع المعسكر الروماني",
            "شارع رقم 6",
            "شارع رشدي",
            "شارع عمرو بن العاص",
            "شارع يوسف الشاذلي",
            "شارع 10",
            "شارع إبراهيم حلمي",
            "شارع الصفا والمروة",
            "شارع رقم 2",
            "شارع موريسون",
            "شارع إبن قاسم",
            "شارع عبدة زيدان",
            "شارع إمام مدرسة طة حسين",
            "شارع الفريد ليان",
            "شارع رشدي باشا",
            "شارع كفر عبده",
            "شارع اللواء يحيي حجازي",
            "شارع عبد الحميد العبادي",
            "شارع خلف 21",
            "شارع الشهيد",
            "شارع إمام مدرسة طة حسين",
            "شارع كفر عبده",
            "شارع رقم 6",
            "طريق الجيش",
            "شارع ابو قير - طريق الحرية",
            "شارع احمد شوقي"
        ];
        $parent = Location::where('name', 'رشدي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع عبد الحميد الديب",
            "شارع عبد الخالق ثروت",
            "شارع الكازينو",
            "شارع محمود فرغلي",
            "شارع محمود نجاتي",
            "شارع عبد السلام عارف",
            "شارع الدمرداش",
            "شارع طلعت",
            "شارع مهندس حامد الخولي",
            "شارع عزيز كحيل",
            "شارع أحمد شكري",
            "شارع محمد أحمد عفيفي",
            "شارع الغردقة",
            "شارع أحمد محمد الادهم",
            "شارع محمد الاقبال"
        ];
        $parent = Location::where('name', 'سان ستيفانو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "خالد بن الوليد",
            "شارع حمزة بن عبد المطلب",
            "شارع عبد الله شحاته",
            "شارع محمد جلال حماد",
            "شارع هدي الاسلام",
            "شارع حسن زغمور",
            "شارع صلاح الدين شعبان",
            "شارع طريق الجيش",
            "شارع خمسة و أربعين",
            "شارع 65 امام هدي الاسلام",
            "شارع بلال بن رباح",
            "شارع السيد رضوان",
            "شارع إبن طلحة بن عبد المطلب",
            "شارع السباعي",
            "شارع فاروق عبد الوهاب",
            "شارع المهندس أحمد سري",
            "شارع إبن سكرة",
            "شارع بن مصلح الارمن",
            "شارع فضالي",
            "شارع تاج المعالي",
            "شارع الزرقاني",
            "شارع محمد أنور السادات",
            "شارع سمر هوم",
            "شارع محمد العجمي",
            "شارع تفرع 3 من شارع خالد بن الوليد",
            "شارع أحمد عبد اللطيف",
            "شارع تفرع 6 من شارع خالد بن الوليد",
            "شارع الزهراء",
            "شارع 1006",
            "شارع أمين خيرت الغندور",
            "شارع رقم 18",
            "شارع 1004",
            "شارع محمد عوض جبريل",
            "شارع محمود العيسوي",
            "شارع رقم 56",
            "شارع التقوي",
            "شارع رقم 622",
            "شارع رقم 57",
            "شارع أحمد جلال حماد",
            "شارع د. محمود سليم",
            "شارع المستجد",
            "خلف شارع 307",
            "شارع المهدي",
            "شارع محمد إبن سعد",
            "شارع الزبير بن العوام",
            "شارع القاسمي",
            "شارع جانبي من مصطفي النحاس",
            "شارع شادي عبد السلام",
            "إمتداد شارع السيد رضوان",
            "شارع رقم 623",
            "شارع إبن شاكر",
            "شارع اليازيدي",
            "شارع خلف",
            "شارع اسكندر إبراهيم",
            "شارع محمد بن طاهر",
            "خلف شارع الاكاديمية",
            "شارع إبن النقيب",
            "شارع د/عوض محمد عوض",
            "شارع الرشيد",
            "شارع قائد اسراب البحار",
            "شارع أبو العرب",
            "شارع إبن سلام",
            "شارع الشهيد مصطفي البيشاوي",
            "شارع أحمد حمدي",
            "شارع جمال عبد الناصر",
            "شارع سعيد ادهم",
            "شارع عمرو بن العاص",
            "شارع مسجد تبارك",
            "شارع مسجد نور الدين",
            "شارع سامي رؤوف"
        ];
        $parent = Location::where('name', 'ميامي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع الايمان",
            "شارع خليل باشا",
            "شارع أحمد عبد العزيز",
            "شارع ميدان سانت",
            "شارع مينا",
            "شارع حسين باشا",
            "شارع خلف شارع 10",
            "شارع الدكتور لطفي الادور",
            "شارع قرداحي",
            "شارع علي ذو الفقار",
            "شارع أبو رفيع",
            "شارع إبراهيم شريف",
            "شارع سانت جين",
            "شارع محمد درويش الديب",
            "شارع حيسوب",
            "شارع السلوم",
            "شارع نبيل شاكر حسان",
            "شارع الروضة",
            "شارع كفر عبده",
            "شارع عبد القادر رجب باشا",
            "شارع السيدة سكينة بنت الحسين"
        ];
        $parent = Location::where('name', 'كفر عبده')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع هاني علي كامل",
            "شارع بور سعيد",
            "شارع اليمن",
            "شارع دار",
            "شارع أبو قير",
            "شارع دنشواي",
            "شارع السيدة امنة",
            "شارع المشير أحمد إسماعيل",
            "شارع الدير",
            "شارع الدكتور بارودي",
            "شارع طارق",
            "شارع السلام",
            "شارع محمد شبل بسيوني",
            "شارع سيدي جابر"
        ];
        $parent = Location::where('name', 'سيدي جابر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "طريق الجيش",
            "شارع الطاروطي",
            "شارع محمد الاقبال",
            "شارع إبراهيم نصير",
            "شارع نور الدين",
            "شارع إبن خلكان",
            "شارع الشيخ عبد العزيز جاويش",
            "شارع محمد دري",
            "شارع خلف عمر المختار",
            "شارع محمد مصطفي سامي",
            "شارع محطة شدس",
            "شارع أحمد ذو الفقار",
            "شارع ماهر بك",
            "شارع عبد اللطيف النشار",
            "شارع شعرواي",
            "عبد السلام عارف",
            "شارع ابو قير - طريق الحرية",
            "شارع محمد عز العرب",
            "شارع سرهنك",
            "شارع عبد الخالق ثروت",
            "شارع عبد الحميد الديب"
        ];
        $parent = Location::where('name', 'لوران')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع إبن القرطبي",
            "شارع الجلاء",
            "شارع إبن عقيل",
            "شارع أحمد أبو شادي",
            "شارع الكاشف",
            "شارع الحجازي",
            "شارع إبن المفضل",
            "شارع أحمد حجازي القلاوي",
            "شارع ويصا واصف",
            "شارع مساكن الشركة البلاستك",
            "شارع السماكين",
            "شارع مسجد الرحمة",
            "شارع أحمد بركات",
            "شارع إمتداد سلمان الفارسي",
            "شارع رقم 3 جعفر بن أبي طالب",
            "شارع متفرع من شارع 15",
            "شارع متفرع من شارع إبراهيم محمود",
            "شارع محمد رياض",
            "شارع إبراهيم أبو السعود",
            "شارع بهاء الدين",
            "شارع جاد الله منصور",
            "شارع إٍسماعيل جودة",
            "شارع عبد الله عزت",
            "شارع أبي هاشم ",
            "شارع إبن منقذ",
            "شارع الظاهري",
            "شارع قطب الدين",
            "شارع حسن حمادة",
            "شارع الأمير عبد الحليم",
            "شارع المحمدية",
            "شارع إبن القاضي",
            "شارع جرجس حنين",
            "شارع عمر الشيخ",
            "شارع أحمد إبراهيم",
            "خلف شارع حبيب ثابت",
            "شارع رابعة العدوية",
            "شارع عبد السلام زهني",
            "شارع احمد محسن",
            "شارع الشيخ عبد الحميد",
            "شارع بور سعيد",
            "شارع سيبوية",
            "شارع القاضي نعمان",
            "شارع شاديه سلامة",
            "شارع أبو كامل شجاع",
            "شارع محمد أبو العينين",
            "شارع إبن قلاون",
            "شارع ترعة عيد",
            "شارع عبد الحكم الجراح",
            "شارع رقم 615",
            "شارع الخرسا",
            "شارع ممتاز باشا",
            "حارة الحسان",
            "حارة 62",
            "شارع فليب جلاد",
            "شارع عماد محمد الفايد",
            "شارع متفرع من شارع إبراهيم بشير",
            "شارع أحمد لطفي",
            "شارع محمد نجيب",
            "شارع حسن أبو حلاوة",
            "شارع البخاري",
            "شارع الطوخي",
            "شارع جامع الحاج سالم",
            "شارع القاسم",
            "شارع رستم باشا",
            "شارع الخروبي",
            "شارع القفاش",
            "شارع السلام رقم 1",
            "شارع مصطفي الشاطر",
            "شارع حسن الطوخي",
            "شارع مساكن الشركة النيل",
            "شارع رقم 2 عمر بن عبد العزيز",
            "شارع رقم 544",
            "شارع محمد بدري",
            "شارع عمار بن ياسر (رقم 5 سابقا",
            "شارع محمد حسن الجزار",
            "شارع عبد القادر الجيلاني",
            "شارع محمود عبد الحميد علي",
            "شارع إبن سلامة",
            "شارع السياحة",
            "شارع الوسطاني",
            "شارع متفرع من شارع الحاج سالم",
            "شارع الانوار المحمدية",
            "شارع إبراهيم بشير",
            "شارع الصعايدة",
            "شارع إبن سالم",
            "شارع أبو بكر الصديق",
            "شارع عمر بن الخطاب رقم 7 سابقا",
            "شارع رقم 556",
            "شارع محمد محمد أمر الله أحمد",
            "شارع وليم هول",
            "شارع النخيل",
            "شارع الكلزة",
            "شارع وديع باشور",
            "شارع متفرع من شارع ملك حفني",
            "مساكن الشركة المتحدة",
            "شارع أرض الجمعية",
            "شارع أبو عبيده إبن الجراح",
            "شارع الصابرين",
            "شارع رقم 40",
            "شارع كستانيا 496",
            "شارع الصحفيين",
            "شارع ويلي سبرنج",
            "شارع ستالي رقم 494",
            "شارع الفخراني 532",
            "شارع الرهباتة",
            "شارع السيد فكري حسين",
            "شارع 45 محمد نجيب",
            "شارع خلف الأنوار المحمدية",
            "شارع رقم 467",
            "شارع الاسراء والمعراج",
            "شارع رقم 3",
            "شارع علي عبد الرحمن",
            "شارع الايمان",
            "شارع زخاري 497",
            "شارع رفعت محمد زكي المليجي",
            "شارع إبراهيم محمود",
            "شارع مجدي رشاد سيف",
            "شارع رفيق علي المجد أحمد",
            "شارع السيوف",
            "شارع جمال عبد الناصر",
            "شارع ملك حفني",
            "ميدان الساعة",
            "شارع ذكي عطا الله"
        ];
        $parent = Location::where('name', 'فيكتوريا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع أبو عجيلة",
            "شارع الأمان",
            "شارع عبد السلام عارف",
            "شارع خلف شارع 40",
            "شارع الشهيد محمود الابيض",
            "شارع الشهيد كمال خميس",
            "شارع عماد الدين علي كامل",
            "شارع محمد علي",
            "شارع الدكتور صالح حمدي",
            "شارع الشيخ محمد السيد الشندي",
            "شارع محمد يوسف غالي",
            "شارع مؤمن سعيد",
            "شارع منصور القاضي",
            "شارع مجدي ممدوح حيدر- رقم39",
            "شارع عباد الرحمن",
            "شارع صبحي عبد الرحمن",
            "سيدي بشر قبلي",
            "سيدي بشر بحري",
            "شارع جمال عبد الناصر",
            "طريق الجيش",
            "شارع محمود العيسوي",
            "شارع ملك حفني",
            "شارع عقل باشا",
            "شارع سيف",
            "شارع خليل حماده"
        ];
        $parent = Location::where('name', 'سيدي بشر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع مدينة الزهراء",
            "شارع النقشبندي",
            "شارع حفيلة",
            "شارع محمد متولي الشعراوي",
            "شارع أمال العمدة",
            "شارع مصطفي مقبل",
            "شارع السلام",
            "شارع الحجاز",
            "شارع بغداد",
            "شارع الكوايتة",
            "شارع أحمد مختار",
            "شارع مباني الشركة السعودية",
            "شارع شندويلي",
            "شارع فريد أبو شادي",
            "شارع الياسمين",
            "شارع المدينة المنورة",
            "شارع الفاروق عمر",
            "شارع الهدايه",
            "شارع مصطفي كامل",
            "شارع عبد الله بن مسعود",
            "شارع عادل",
            "شارع يثرب",
            "شارع الشيخ عصام ادريس",
            "شارع الاهلوية",
            "خلف شارع مدرسة أبو يوسف",
            "شارع الشهيد أحمد حمدي",
            "شارع التقوي",
            "شارع الكويت",
            "شارع الدكتور سعد الدين",
            "شارع سعد محمد سيد",
            "شارع الإمام علي",
            "شارع النرجس",
            "شارع الفرن",
            "شارع جابر حافظ",
            "شارع طرابلس",
            "شارع القبطان حسين غالي",
            "شارع جمعة مفتاح",
            "شارع فيلا كوفرتينا",
            "شارع إمتداد فاطمة الزهراء",
            "شارع السياحة 2",
            "شارع الصادق",
            "شارع قنا",
            "شارع متفرع من الكويت",
            "شارع الأميرة",
            "شارع فوزي أمين",
            "شارع باب السلام",
            "شارع مرجان",
            "شارع المهداوي",
            "شارع الحديد والصلب",
            "شارع عمر بن الخطاب",
            "شارع بن الكوثر",
            "شارع الإمام فخر الدين",
            "شارع حمزة بن عبد المطلب",
            "شارع حنا",
            "شارع العطار",
            "شارع الاصدقاء",
            "شارع السوري",
            "شارع فاطمة النبوية",
            "شارع عائلات ميدان",
            "شارع ريتش هوم",
            "شارع الشهيد محمد وجدي أبو ضيف",
            "شارع المحافظ",
            "شارع محمد عبد الحميد أبو جمعة",
            "شارع عمر بن العاص",
            "شارع مصعب بن عمير",
            "شارع المحمدي",
            "شارع قصر القويري",
            "شارع الكومي",
            "شارع جهاد المصري",
            "شارع أبو زيد"
        ];
        $parent = Location::where('name', 'الهانوفيل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع المنصورية",
            "شارع الزهور",
            "شارع البحيرة",
            "شارع بهيج ",
            "شارع الصناقرة",
            "شارع المحجوب"
        ];
        $parent = Location::where('name', 'برج العرب')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع فاموس",
            "شارع محمد دالي",
            "شارع البوها",
            "شارع نور الدين",
            "شارع إسماعيل الفنجري",
            "شارع فرج",
            "شارع المؤيد",
            "شارع منصور فهمي",
            "شارع أفلاطون",
            "شارع كفر صقر",
            "شارع جورج أبيض",
            "شارع ابو كبير",
            "شارع الكافور",
            "شارع السينبلاوين",
            "شارع الجريتلي",
            "شارع العقيد مصطفي محمد توفيق",
            "شارع ناصر",
            "شارع راكوتيس",
            "شارع الجيزة",
            "طريق الجيش",
            "شارع طيبة",
            "شارع الطليعة",
            "شارع ممفيس",
            "شارع الأنبا يؤنس",
            "شارع الدهان",
            "شارع الدكتور حامد نصر",
            "شارع محمد فؤاد جلال",
            "شارع بني يوسف",
            "شارع عمر لطفي",
            "شارع مينوذيس",
            "شارع الزنكلوني",
            "شارع أحمد فؤاد نور",
            "شارع أدونيس",
            "شارع الأحقاف",
            "شارع زكريا غنيم",
            "شارع بورسعيد",
            "شارع عبد القادر المازني",
            "شارع حداد",
            "شارع دياس",
            "شارع صلاح ذهني",
            "شارع عبد المنعم سند",
            "شارع أحمد قمحة",
            "شارع الشهيد موفق عباس حتاتة",
            "شارع يوسف فهمي عثمان",
            "شارع أدفو",
            "شارع أبو قير",
            "شارع إبراهيم شوقي",
            "شارع كانوب",
            "شارع هليوبوليس"
        ];
        $parent = Location::where('name', 'كامب شيزار')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع إسماعيل الحبروك",
            "شارع مصطفي ماهر",
            "شارع المسك",
            "شارع دياب",
            "شارع أبو قير - طريق الحرية",
            "شارع إبراهيم فتحي غنيم",
            "شارع علوي",
            "شارع محمد مقبل",
            "شارع شوكت",
            "شارع رسمي باشا",
            "شارع ناصر",
            "شارع محمود الديب",
            "شارع عدلي يكن",
            "شارع محمود عبد الرازق",
            "شارع إسماعيل ساني",
            "شارع الميموني",
            "شارع الليموني حليم",
            "شارع يثرب",
            "شارع الفتح",
            "شارع عثمان رأفت",
            "شارع شاكر الخياط",
            "شارع الاذاعة",
            "شارع طاهر سباهي",
            "شارع زهران رشدي",
            "شارع الالفي",
            "شارع عثمان القاضي",
            "شارع الجاروك",
            "شارع حدايا باشا",
            "شارع إبراهيم بيك رأفت",
            "شارع حافظ السيد",
            "شارع أحمد يحيي",
            "شارع نوتردام",
            "شارع الشيخ أحمد أبو علي",
            "شارع بن الجزار",
            "شارع عبد الوهاب علي",
            "شارع غانم عبد الرحيم",
            "شارع عبد السلام عارف",
            "شارع الجيش"
        ];
        $parent = Location::where('name', 'جليم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع السكري عبد الله النحاس",
            "شارع ناجي",
            "شارع المهداوي",
            "شارع أنس بن مالك",
            "شارع عمر بن الخطاب",
            "شارع متفرع من المهدي",
            "شارع متفرع من السيد حسين",
            "نهاية شارع المحمودية",
            "شارع متفرع من صيدليه سالي",
            "شارع رقم 566",
            "شارع الجربي",
            "شارع الملاحة",
            "شارع بلال بن رباح",
            "شارع متفرع من الجربي",
            "حارة رقم 1",
            "شارع متفرع من المهداوي رقم 1",
            "خلف شارع الشيخ محمد عبد الحليم",
            "شارع فودة",
            "شارع شعبان محفوظ",
            "شارع عدلي",
            "حارة النور",
            "شارع الفردوس",
            "شارع الشيخ حسن الشاذلي",
            "شارع المجاهدين",
            "شارع الجبلايا",
            "شارع أمير المؤمنين",
            "شارع الشهيد محمد حسن",
            "شارع المهتدين",
            "شارع ذهني",
            "شارع متفرع من خليل رقم 5",
            "شارع علي بن أبي طالب",
            "شارع الحاج علي جربيدة",
            "شارع العشريني",
            "إمتداد شارع السكري",
            "شارع الفتح",
            "شارع القدس",
            "شارع الحاج مؤمن",
            "شارع متفرع من صيدلية نور",
            "شارع الحاج ذكي حسين عسل",
            "شارع محمد عطية",
            "شارع متفرع من ملك حفني",
            "حارة المدرسة",
            "شارع الرفاعي",
            "شارع متفرع من شارع القدس",
            "حارة القدس خلف المدافن",
            "شارع الرحمن",
            "شارع الجبل",
            "شارع الامناء",
            "شارع النور",
            "شارع الشهيد محمد الضاحي",
            "شارع متفرع من ملك حنفي 3",
            "شارع متفرع من شارع ملك حنفي 2",
            "شارع نبوي المهندس",
            "شارع فجر الاسلام",
            "شارع نعمة محمد",
            "شارع الشهيد أحمد عبد العظيم",
            "شارع إمام علي",
            "شارع منعم الخياط",
            "شارع المدينه المنورة",
            "شارع النمر",
            "شارع الشهيد أحمد ياسين",
            "حارة 664",
            "شارع الثلاثين",
            "شارع متفرع من الشهيد أحمد عبد العظيم",
            "شارع أم القري",
            "شارع أحمد العجلاني",
            "شارع متفرع من نور الاسلام",
            "شارع الزهراء",
            "حارة الفتح",
            "شارع التجار",
            "شارع إبراهيم دحدوح",
            "شارع الفيروز",
            "شارع خلف عمر بن الخطاب",
            "شارع خالد إبن الوليد",
            "شارع خلف السوق الحر",
            "شارع إمام الحسن",
            "شارع صبري عطية",
            "شارع 30",
            "طريق الجيش",
            "شارع جمال عبد الناصر",
            "شارع ملك حفني",
            "مساكن طلعت مصطفى",
            "المندرة بحري",
            "المندرة قبلي",
            "شارع السنوسي"
        ];
        $parent = Location::where('name', 'المندرة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع رقم 528",
            "شارع جعفر بن أبي طالب",
            "شارع الوليد",
            "شارع الإمام العادل",
            "شارع حسن كامل",
            "شارع 6 أكتوبر",
            "شارع أحمد العباني",
            "شارع البعوث الاسلامية",
            "حارة شلتوت",
            "شارع رقم 516",
            "شارع رقم 522",
            "شارع عمر المختار",
            "شارع علي بهجت الدريني",
            "شارع المدينه المنورة",
            "شارع رقم 8",
            "شارع ميناء اغادير",
            "شارع الملازم بسيوني",
            "شارع عبد الحليم محمود",
            "شارع محمد زيتون",
            "شارع فجر الاسلام",
            "شارع صديقات الكتاب المقدس",
            "شارع المرسي",
            "شارع رقم 2",
            "شارع محمد عبد الحميد محفوظ",
            "شارع أحمد تيسير",
            "شارع أبن سعيد",
            "شارع سلمان الفارسي",
            "شارع بن شلتوت",
            "شارع صيام",
            "شارع حنفي الابيض",
            "شارع الكوخ",
            "شارع رقم 518",
            "شارع محمود جمعة",
            "شارع رقم 520",
            "شارع الشهيد عبد الستار حسين",
            "شارع الشهيد محمد وهبي إسماعيل",
            "شارع السلام",
            "شارع علي حسين المعناوي",
            "شارع 45",
            "العصافرة قبلي",
            "العصافرة بحري",
            "شارع الجيش",
            "شارع جمال عبد الناصر",
            "شارع ملك حفني"
        ];
        $parent = Location::where('name', 'العصافرة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع عبد الحافظ",
            "شارع الفائز",
            "شارع زيدان",
            "شارع إبن غالب",
            "حارة الدكتور صروف",
            "شارع الإسحاقي",
            "حارة إبن الحكم",
            "شارع إبن زهرون",
            "حارة الأمير مصطفي",
            "حارة الشباسي",
            "شارع محمد عماد الدين",
            "شارع عارف",
            "شارع صالح عبد الكريم",
            "شارع إبن قصير",
            "شارع إبن عامر",
            "حارة الصاحب",
            "عطفة راشد",
            "شارع الرياشي",
            "شارع المعز",
            "حارة القادر",
            "شارع البلينا",
            "شارع الظافر",
            "شارع إبن وهبان",
            "شارع صالح الحديني",
            "شارع الراشدين",
            "شارع المحكمة",
            "شارع إبن العنبري",
            "حارة السيدة فاطمة",
            "شارع إبن عيسي",
            "شارع إبن محاسن",
            "شارع الدكتور جمال الدين نوح",
            "حارة طابل",
            "شارع محرم بك",
            "شارع سيدي عبد السلام الاسمر",
            "شارع عبد الفتاح شريف",
            "زقاق سيدون",
            "شارع إبن فيروز",
            "شارع إبن مروان",
            "شارع الحياتي",
            "شارع الجراجي",
            "شارع كمال",
            "شارع الرصافة",
            "شارع إبن خاقان",
            "حارة فيرون",
            "شارع السيد عبد الحليم",
            "شارع المقاولة",
            "شارع رستم العلايلي",
            "شارع عرفان",
            "شارع الكواشي",
            "شارع عثمان بن عفان",
            "شارع حسبو",
            "شارع إسماعيل غانم",
            "شارع أحمد حسن",
            "شارع فتح الباب",
            "شارع جابر بن حيان",
            "شارع أمين الرفاعي",
            "شارع محفوظ بك",
            "شارع جوجو",
            "شارع الرائد منير بادير",
            "حارة المخزومي",
            "حارة مصطفي فايد",
            "شارع القطاعي",
            "شارع الدكتور سالم",
            "حارة إبن الملا",
            "حارة الفرارجي",
            "حارة إبن الأعرابي",
            "حارة إبن ظريف",
            "شارع أحمد راسم",
            "شارع السيدة فاطمة",
            "شارع علي شيخة",
            "شارع إبن رشد",
            "حارة أمين سرور",
            "شارع عبد القادر الغرباني",
            "شارع العباسي",
            "شارع مصطفي باشا عبادي",
            "شارع محمد إسماعيل",
            "شارع أبو نواس",
            "شارع العراق",
            "شارع سليمان عبد الحميد",
            "شارع محمد عزت طولان",
            "شارع خضر",
            "شارع الخزولي",
            "شارع المحتسب",
            "شارع خلف 13",
            "شارع الوزير",
            "شارع قنال المحمودية البحري",
            "حارة الكرماني",
            "شارع المأمون",
            "شارع دكروري",
            "حارة الشهير",
            "حارة سرور",
            "شارع مرسي محمود",
            "شارع سيدون",
            "شارع الشهيد مصطفي الزيات",
            "شارع قاسم أمين",
            "شارع الظاهر",
            "حارة عبد الغفار",
            "شارع عبد القوي",
            "شارع إبراهيم باهي الجبالي",
            "حارة أبو حجاج",
            "زقاق محرم بك",
            "طريق الفكهاني",
            "شارع المناخ",
            "شارع الأمير مصطفي",
            "حارة معنون",
            "شارع الكمال",
            "شارع المنصور",
            "شارع ملجأ سان جوزيف",
            "حارة قحطان",
            "شارع محمود سلامة",
            "شارع البصرة",
            "شارع اللواء مصطفي أبو زيد",
            "شارع الدكتور مصطفي طبالة",
            "شارع إبراهيم عبد الجواد",
            "شارع نصر أحمد ذكي",
            "شارع عبد السميع",
            "حارة الرازي",
            "شارع سقارة",
            "شارع زيفر",
            "شارع الزهر",
            "حارة الزهدي",
            "شارع البكري",
            "شارع الاعلام",
            "شارع عبد القادر بغدادي",
            "حارة يوسف",
            "حارة إبن جعفر",
            "شارع عثمان جلال",
            "حارة السلمية",
            "شارع أمبر البحر",
            "شارع جزيرة شروان",
            "شارع إمام 31",
            "شارع إمام 32",
            "شارع علي عفت ياسين",
            "شارع محمد الكلزة",
            "شارع جرجس مينا",
            "شارع إمام 3",
            "حارة فهمي",
            "شارع الفردوس",
            "شارع نصر أبو الوفا",
            "شارع القاهرة",
            "شارع الأيوبي",
            "شارع طيلون",
            "شارع الحريري",
            "حارة القذم",
            "شارع عبد العزيز حسن",
            "شارع إبن رجب",
            "حارة الشاشي",
            "شارع السيدة نبويه موسي",
            "شارع محمد نافع",
            "شارع أسلام الهلباوي",
            "شارع الكرماني",
            "شارع إبن عتيق",
            "شارع خلف 9",
            "شارع حسن الحلواني",
            "حارة محمد مراد",
            "شارع عيسي",
            "حارة الندا",
            "شارع إبراهيم شاهين",
            "شارع بدوي بك",
            "شارع الشرباتي",
            "شارع غرناطة",
            "شارع هارون",
            "شارع علي الأسكندراني",
            "حارة دري",
            "حارة حسن نور الدين",
            "حارة أحمد النجدي",
            "زقاق إبن محاسن",
            "شارع رقم 4",
            "حارة الروماني",
            "حارة شمس الدولة",
            "شارع العادل",
            "زقاق الحيتي",
            "شارع سعدالله جلابو",
            "شارع الشربيني",
            "شارع معاوية",
            "شارع الاحرار",
            "شارع الشاذلي",
            "شارع المهندس أحمد إسماعيل",
            "شارع جرين",
            "شارع الصالح الشهاب",
            "شارع الفنان محمد حسن",
            "شارع هند",
            "شارع أحمد أيوب",
            "شارع الوزير خلف 19",
            "شارع النعيم",
            "شارع بني الأحمر",
            "شارع الديار بكري",
            "شارع جلال الدسوقي",
            "بوالينو",
            "شارع جرانفيل",
            "طريق قناة السويس"
        ];
        $parent = Location::where('name', 'محرم بك')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع سعيد رمضان",
            "شارع ههيا",
            "شارع رمضان يوسف",
            "شارع قنا",
            "شارع عمر زعفان",
            "شارع سوهاج",
            "شارع محمد فؤاد جلال",
            "شارع النبيل عمرو إبراهيم",
            "شارع تل العمارنة",
            "شارع عفت حمدي",
            "شارع علاء الدين",
            "شارع النيروز",
            "شارع الدكتور أحمد المحروقي",
            "شارع قابيل",
            "شارع هابيل ",
            "شارع أنيس باي",
            "شارع إبن الباريزي",
            "شارع أحمد علام",
            "شارع قارون",
            "شارع الشيخ السعدي",
            "شارع الواثق",
            "شارع العز",
            "شارع الاعشي",
            "شارع عباس الحلواني",
            "شارع حسين كامل محمود",
            "شارع الكوتاهية",
            "شارع فخر الدين علي",
            "شارع مصطفي رمضان",
            "شارع بورسعيد",
            "شارع الملازم أول أشرف الخوجة",
            "شارع سانت نقولا",
            "شارع سيناء",
            "شارع صلاح ذهني",
            "شارع زكريا غنيم",
            "شارع نجع حمادي",
            "شارع الشهيد موفق عباس حتاتة",
            "شارع أحمد فؤاد نور",
            "شارع جرجا",
            "شارع الاحقاف",
            "شارع أدم",
            "شارع ممفيس",
            "شارع الأدرياتيك",
            "شارع عمر لطفي",
            "شارع مصطفي محمد صبري",
            "شارع عبد الحكيم حرب",
            "شارع أدفو",
            "شارع الأنبا يؤنس",
            "شارع الاندلس",
            "شارع أسيوط",
            "شارع عين الحياة",
            "شارع الفاضل",
            "شارع محمد سالم عبد السلام",
            "شارع الدكتور حلمي بهجت بدوي",
            "شارع الدكتور محمد محمد الفحام",
            "شارع القاضي حمزة",
            "شارع الشهيد أحمد عبد الرازق خاطر",
            "شارع قيس",
            "شارع الحجاز",
            "شارع أبو قير",
            "شارع ركن الدين",
            "شارع عبد السلام رجب",
            "شارع أمرؤ القيس",
            "شارع جلال الرومي",
            "شارع الشهيد جواد حسني",
            "شارع البقيع",
            "شارع عبد الكريم الخطابي",
            "شارع إبن القصاص",
            "شارع الاسباط",
            "شارع يوسف فهمي الجزايرلي",
            "شارع القيراطي",
            "شارع محمد فوزي معاذ",
            "شارع النقيب شريف رمزي",
            "شارع إبن النصر",
            "شارع الجيش",
            "شارع تانيس"
        ];
        $parent = Location::where('name', 'الإبراهيمية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع نبيل منصور",
            "شارع مصطفي فهمي",
            "شارع الكسائي",
            "شارع العيري",
            "شارع أبو الاسود",
            "شارع سليمان نجيب",
            "شارع البلبل",
            "شارع أمير البحار حمدي الديب",
            "شارع محمد عبد المجيد",
            "شارع سمارة",
            "شارع العيني",
            "شارع فؤاد إبراهيم",
            "شارع البنا",
            "شارع الكسائي خلف 17",
            "شارع الخزرجي",
            "شارع السمرقندي",
            "شارع النيابوري",
            "شارع ابن الوليد",
            "شارع العلوي",
            "شارع الدواني",
            "شارع المعتصم العباسي",
            "شارع عبد الفتاح الطويل",
            "شارع المبرد",
            "شارع خليل عبد النبي فرعون سابقا",
            "شارع جميعي",
            "شارع أحمد باشا ترك",
            "شارع محمد بن ناصف",
            "شارع الخالدي",
            "حارة سرور",
            "شارع إبن حجازي",
            "شارع محمود صفوت",
            "شارع المستغني بالله",
            "شارع واصف سميكة",
            "شارع لافيزون",
            "شارع فؤاد عويس",
            "شارع تقاطع تكلا",
            "شارع الشهيد محمد الدرة",
            "شارع عمر المصري",
            "شارع الكسائي خلف 29",
            "شارع إبن السراج",
            "شارع إبن رقية",
            "شارع عبد العزيز محمود",
            "شارع ابن ماجة",
            "شارع خلف 62",
            "شارع مصطفى كامل "
        ];
        $parent = Location::where('name', 'فلمنج')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = ['شارع عبد العزيز فهمي'];
        $parent = Location::where('name', 'ستانلي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "ونجت",
            "شارع إبن النديم",
            "شارع مصطفي فهمي",
            "شارع المحاسيد",
            "شارع عبد الحميد العبادي",
            "شارع أحمد فؤاد درويش",
            "شارع النهضة",
            "شارع دمياط",
            "شارع الشهيد أحمد صالح",
            "شارع القاسم",
            "شارع إبراهيم راضي",
            "شارع زكي بدوي محمد",
            "شارع عبد الرحمن شكري",
            "شارع أحمد شوقي",
            "شارع أبو قير",
            "شارع الفيومي",
            "شارع محمد بك جبريل",
            "شارع قصر الثقافة",
            "شارع الملازم سامح",
            "شارع الفريد ليان",
            "شارع الدعوة الاسلامية",
            "شارع إمام 30",
            "شارع إسماعيل ذكي أحمد",
            "شارع محمد فريد",
            "شارع فؤاد عويس",
            "شارع الدكتور برجي",
            "شارع أمير البحار محمود حمزة",
            "شارع جابر عبد المعطي الغزالي",
            "شارع عبد السلام عارف",
            "شارع مكة",
            "شارع إبن ثابت",
            "شارع فاتن",
            "شارع الدكتور إبراهيم رفعت",
            "شارع الياسمين",
            "شارع الدكتور زكي الشافعي",
            "شارع الشهيد عادل محمود",
            "شارع صادق الدريني",
            "شارع أحمد يوسف",
            "شارع البلبل",
            "شارع مصطفي كامل"
        ];
        $parent = Location::where('name', 'بولكلي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع أحمد عثمان",
            "شارع أحمد فتحي",
            "شارع الأمير جميل",
            "شارع ملك حفني",
            "شارع مصطفي عبد الرازق",
            "شارع معمار",
            "شارع محمود سيد أحمد",
            "شارع إبن سعادة",
            "شارع ابن نجم",
            "شارع قصر الصفا",
            "شارع ابن حوقل",
            "شارع أحمد بك غاربو",
            "شارع عبد السلام عارف",
            "شارع اللاهوت",
            "شارع سواكي",
            "شارع المقدم حسن محمود",
            "شارع محمود الديب",
            "شارع ممر عدوان الخصوصي",
            "شارع عدلي بن يزيد",
            "شارع النعناعي",
            "شارع القديس",
            "شارع باربر",
            "شارع عبد الحي",
            "شارع إبراهيم العطار",
            "شارع الهدي",
            "شارع محطة شدس",
            "خلف 15 شارع محطة شدس",
            "شارع غاربو بك",
            "شارع صالح باشا",
            "شارع بيومي السيد بيومي",
            "شارع وجيه باشا",
            "شارع رياض"
        ];
        $parent = Location::where('name', 'زيزينيا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع المقلي",
            "شارع عبد العزيز",
            "شارع محمود أبو النصر",
            "شارع علي بك",
            "شارع الجهاد",
            "شارع الغندور",
            "شارع محطة السوق",
            "شارع المروة",
            "شارع عمر المختار",
            "شارع الشهيد محمد عبد العزيز",
            "شارع مصطفي فهمي",
            "شارع الاخوان",
            "شارع المحطة",
            "شارع الزبيدي",
            "شارع الرحمني",
            "شارع حسن باشا محمود",
            "شارع الدكتور محمد عبد المنعم ماهر",
            "شارع الصبي",
            "شارع رقم 53",
            "شارع أحمد تونيا",
            "شارع الحسن إبن علي",
            "شارع فتحية بهيج",
            "شارع رقم 513",
            "شارع الدكتور محمد أبو الفرح",
            "شارع القطاري بك",
            "شارع الفتح",
            "شارع محمود رشاد",
            "شارع أبو هريرة",
            "بلوك 7",
            "شارع الزهراء",
            "إمتداد عثمان محرم",
            "شارع إسماعيل مخلوف",
            "شارع علوي",
            "شارع المنفي",
            "شارع الملازم أول صلاح عطية غيث",
            "شارع نعمت جرجس",
            "شارع بن مؤنس",
            "شارع أحمد عبد الله",
            "شارع الاخطل",
            "شارع حافظ السادات",
            "شارع الزمخشري",
            "شارع النقي",
            "شارع رقم 757",
            "شارع ملك حفني",
            "شارع محمد النجاري",
            "شارع عبد مناف",
            "بلوك 8",
            "شارع بن غزالة",
            "شارع ذكي مبارك",
            "شارع البقلي بك",
            "شارع مصطفي الدمياطي",
            "شارع مساكن شدس",
            "شارع خلف المصنع",
            "شارع أيكا",
            "شارع عرج أبو علي",
            "شارع عدلي بن يزيد",
            "شارع الكامل",
            "شارع محمد الصيفي",
            "شارع الشيخ أحمد خطيب",
            "شارع مضر",
            "شارع إبن سعيد",
            "شارع خليل شيبوب",
            "شارع الحمام",
            "شارع حسن عبد الفتاح",
            "شارع البارودي",
            "شارع مساكن شركة امريكا",
            "شارع أبو بكر الصديق",
            "شارع العنبري",
            "شارع الهلال",
            "شارع إبن الدراج",
            "شارع أبو فارس",
            "شارع النصر",
            "شارع الشهداء",
            "شارع السلام",
            "شارع البستان",
            "خلف 112",
            "شارع خلف شل",
            "شارع الصولي",
            "شارع حسن الخولي",
            "شارع الانبا كيرلس",
            "شارع حكيم باشا البوليس",
            "شارع ابن عزيز",
            "شارع أحمد أمين",
            "شارع أبو حيان",
            "شارع السماحي",
            "شارع مسلم بن الوليد",
            "شارع السمان",
            "شارع إبن القصاب",
            "شارع حامد بك بن مكارس",
            "شارع العقصة",
            "شارع عبد المطلب",
            "شارع المظفر",
            "شارع إبن حجازي",
            "شارع الثقيفة",
            "شارع سكرة",
            "شارع خماروية",
            "شارع الاخطار",
            "شارع العبور",
            "شارع سيف",
            "شارع عثمان بن عفان",
            "شارع بن الجزري",
            "شارع الغيبي",
            "خلف شارع الدكر",
            "شارع إبن القارح",
            "شارع إبن العلاف",
            "شارع أبو شبانة",
            "شارع الدولة",
            "شارع صلاح الدين دسوقي مصطفي",
            "شارع قنوات",
            "حارة شكشك",
            "شارع النسقي",
            "شارع بشار",
            "شارع الاخطاب",
            "شارع إبن عباس",
            "شارع ابن معصوم",
            "شارع طمازين",
            "شارع مصطفي صادق الرافعي",
            "شارع محمد حلمي",
            "شارع إبن دريد",
            "شارع أبو جبار",
            "شارع ثاقب باشا",
            "شارع عبيدة",
            "إمتداد السماحي",
            "شارع الراغب",
            "شارع إبن فرناس",
            "شارع محسن بك هاشم",
            "شارع مرتضي باشا",
            "شارع ابو قير - طريق الحرية"
        ];
        $parent = Location::where('name', 'باكوس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع أبو قير - طريق الحرية",
            "شارع الفتح",
            "شارع مرتضي باشا"
        ];
        $parent = Location::where('name', 'جناكليس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "خالد إبن الوليد",
            "مدخل النخيل",
            "الصفا",
            "مناطق فرعية بالمعمورة",
            "المعمورة البلد",
            "شارع 17",
            "شارع الزهراء",
            "شارع رقم 3",
            "شارع رقم 21",
            "شارع رقم 5",
            "شارع محمد إبراهيم العطار",
            "شارع النصر",
            "شارع يوسف دنلي",
            "شارع رقم 19",
            "شارع 11",
            "شارع جلال زكي",
            "شارع إسماعيل مختار",
            "شارع عزبة الجبل",
            "شارع الشهيد يوسف السباعي",
            "شارع رقم 1",
            "شارع علي حمدي الجمال",
            "شارع رقم 7",
            "شارع فكري اباظة",
            "شارع الشرطة",
            "المعمورة الشاطئ",
            "الطابية"
        ];
        $parent = Location::where('name', 'المعمورة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع ملوي",
            "شارع الدلتا",
            "شارع منير السيد الفار",
            "شارع محمد يقوت عطية",
            "شارع طيبة",
            "ميدان الكورنيش",
            "شارع الاقصر",
            "شارع الشهيد محمد السيد حفني",
            "شارع سيدي جابر",
            "شارع عمر لطفي",
            "شارع محمود الطريني",
            "شارع إبن سعود",
            "شارع مصطفي محمد مرسي",
            "شارع اللخمي",
            "شارع عرفي باشا",
            "شارع الباسوس",
            "شارع بن عزب",
            "شارع عبد العزيز فهمي",
            "شارع الشهيد شهاب أبو السنون",
            "شارع توت عنخ امون",
            "شارع عبد الله دراز",
            "شارع المنتصر",
            "شارع زهير بن سامي",
            "شارع 121",
            "شارع البيروني",
            "شارع إسماعيل عيد",
            "شارع يحي سيد إبراهيم",
            "شارع أبو قير",
            "شارع محمود حسن فهمي",
            "شارع عبد الكريم الخطابي",
            "شارع فاطمة اليوسف",
            "شارع زكريا غنيم",
            "شارع العقبة",
            "شارع سيد حنفي",
            "شارع إبن بشير",
            "شارع حسن سرور",
            "شارع بور سعيد"
        ];
        $parent = Location::where('name', 'سبورتنج')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع عبد العزيز فهمي",
            "شارع المنصورة",
            "شارع غزة",
            "شارع مختار عبد الرحيم خلاف",
            "شارع بيك",
            "شارع خليل مطران",
            "شارع النقيب أحمد ممدوح",
            "شارع محمد رجب",
            "شارع السيد عبد العال",
            "شارع عبد الله باشا الغرباني",
            "شارع بدر الدين",
            "شارع أبو قير - طريق الحرية",
            "شارع إبن مرزوق",
            "شارع خلف رقم 29",
            "شارع عائشة فهمي",
            "شارع بيسلون",
            "شارع علي فخري",
            "شارع عبد القادر عطية",
            "شارع الدكتور الصابونجي",
            "شارع عبد السلام عارف",
            "شارع مصطفي فهمي",
            "شارع بطليموس الفلكي",
            "شارع عبد المنصف غازي",
            "شارع تاج الرؤساء",
            "شارع خلف 22",
            "شارع البساتين",
            "شارع مصطفي أبو هيف",
            "طريق الجيش"
        ];
        $parent = Location::where('name', 'سابا باشا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الحضره الجديده",
            "مناطق فرعية بالحضرة",
            "شارع السودان",
            "شارع الخرطوم",
            "حارة عبد المقصود",
            "شارع باستور",
            "شارع إبن ذنبل",
            "شارع طه عبد الجواد",
            "شارع عمر زاهر",
            "شارع حافظ إبراهيم",
            "شارع المقتدر",
            "شارع الشيخ السعدي",
            "شارع كسري",
            "شارع الشنقيطي",
            "شارع العراقي",
            "شارع أبو يوسف",
            "شارع النقيب شريف رمزي",
            "شارع أحمد فاروق علي عزت",
            "شارع الدقهلية",
            "شارع دمنهور",
            "شارع إبن الغرب",
            "شارع المروة",
            "شارع إبن عسكر",
            "شارع كارم محمود عبد العاطي",
            "شارع ابن ملاعب",
            "شارع طاهر باشا",
            "شارع مسعد",
            "شارع الشيخ موسي كلة",
            "شارع عثمان عبد الكريم",
            "شارع أبو العلا",
            "شارع الشعب",
            "شارع الحكمة",
            "شارع محمد مجدي",
            "شارع منيرة ثابت",
            "شارع زينهم",
            "شارع ابراهيم البشبيشي",
            "شارع إبن ظفر",
            "شارع تميم",
            "شارع إمام العبد",
            "شارع المنارة",
            "شارع المعتمد",
            "شارع عبد الكريم الخطابي",
            "شارع حامد الشواربي",
            "شارع المقيد",
            "شارع الجواهر",
            "شارع النابغة",
            "شارع عبد الرحمن عودة",
            "شارع الهلالي",
            "شارع إبن اللبان",
            "شارع إبن المقفع",
            "شارع رقم 285",
            "شارع أبو الحارث",
            "شارع المؤيد بالله",
            "شارع أبو زرعة",
            "شارع العقيلي",
            "شارع المنوفية",
            "شارع الغربية",
            "شارع عبد الرحمن فهمي",
            "شارع ابن عبد ربي",
            "شارع إبن عايشة",
            "شارع الشهيد صبحي إبراهيم",
            "شارع ثقيف",
            "شارع جورجي زيدان",
            "شارع الشهيد علي صالح",
            "شارع الست النعم",
            "شارع المفتش",
            "شارع داوود حلمي",
            "شارع رمضان حلاوة",
            "شارع زاهي بيومي",
            "شارع تاج الدين",
            "شارع محمد مسعود",
            "شارع تومورت",
            "شارع أحمد إسماعيل",
            "شارع المالك الصالح",
            "شارع الواثق",
            "شارع عز الدين الشامي",
            "شارع الاخلاق",
            "شارع المعهد",
            "شارع النوجي",
            "شارع المستعين",
            "شارع إبن جهير",
            "شارع البصري",
            "شارع الجرجاني",
            "شارع بن نهير",
            "شارع الطوسي",
            "شارع رقم 284",
            "شارع رقم 286",
            "شارع داوود حسني",
            "شارع الفيوم",
            "شارع إبن شمس الخلافة",
            "شارع إبن عدي",
            "شارع إبن كرينب",
            "شارع عبد العزيز أبو غنيمة",
            "شارع البابلي",
            "شارع الجزيرة الخضراء",
            "شارع الدكتور حسين كمال",
            "شارع ابن راحمون",
            "شارع الشيخ محمد باز",
            "شارع أحمد تاج الدين",
            "شارع سوارس",
            "شارع هنو",
            "شارع بهريغ",
            "شارع الشهيد جلال الدسوقي",
            "شارع ابن طليع",
            "شارع إبن الجهم",
            "شارع أحمد نسيم",
            "شارع العدالة",
            "شارع الواقدي",
            "شارع العريش",
            "شارع الجواد",
            "شارع شمس الدين البابلي",
            "شارع فخر الملك",
            "شارع زكي الدين",
            "شارع سعيد الجندي",
            "شارع سمير عبد الله",
            "شارع رقم 1",
            "شارع الحديدة",
            "الحضرة قبلي",
            "الحضرة البحرية"
        ];
        $parent = Location::where('name', 'الحضرة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع عبد الحميد أحمد أبو هيف",
            "شارع سليم حسن",
            "شارع محمد حجاب",
            "شارع محمد شفيق غربال",
            "شارع علي مصطفي مشرفة",
            "شارع أحمد محمد حسنين",
            "شارع الدكتور كامل مرسي",
            "شارع عبد المعطي الخيال",
            "شارع بور سعيد",
            "شارع هيرودت",
            "شارع إمتداد الدكتور عبد الحميد سيد",
            "شارع أفلاطون",
            "شارع محمد فكري",
            "شارع الزركشي",
            "شارع محمد فؤاد حلمي",
            "شارع ارستوفان",
            "شارع زكريا غنيم",
            "شارع عمر لطفي",
            "شارع دكتور سامي جنينه",
            "شارع سوتر"
        ];
        $parent = Location::where('name', 'الشاطبي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "أليكستند - السلام انتربيلد",
            "شارع محمد رشيد",
            "كينج هايتس - طابا"
        ];
        $parent = Location::where('name', 'كينج مريوط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع الدكتور محمد بدير",
            "شارع الصباغ",
            "شارع طة حمدي",
            "شارع أرمنت",
            "شارع ولي الدين يكن",
            "شارع السيد عثمان الساعي",
            "شارع شيبوب",
            "شارع البليسي",
            "شارع الديب",
            "شارع الفسطاط",
            "شارع إبن نوفل",
            "شارع إبن أبي وقاص",
            "شارع الجمال",
            "شارع عبد العزيز فهمي",
            "شارع مدحت سيف اليزل خليفة",
            "شارع السيد مرسي",
            "شارع بورسعيد",
            "شارع صفوت منصور",
            "شارع سليمان محمود",
            "شارع اللواء أحمد علي",
            "شارع إبن بشير",
            "شارع إبن الجراح",
            "شارع رشدي",
            "شارع خليل البنداري",
            "شارع عمر الخيام",
            "شارع الدار البيضاء",
            "طريق الجيش",
            "شارع أبو قير - طريق الحرية"
        ];
        $parent = Location::where('name', 'كليوباترا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع القمر",
            "شارع محمد الشيمني",
            "شارع النجاة",
            "حارة الحداد",
            "شارع الأمير",
            "شارع محمد يوسف فخر",
            "حارة موسي",
            "شارع إبن الثعلبي",
            "شارع سيدي ونس",
            "حارة أبو علي",
            "شارع العسيلي",
            "حارة العيوني",
            "شارع الاشراف",
            "شارع الوسطي",
            "شارع أبو الفدا",
            "شارع الدسوقي",
            "شارع بني أمية",
            "شارع أحمد بك ندا",
            "شارع إسماعيل مهنا",
            "حارة الزيدية",
            "شارع الكواكب",
            "شارع الحنابلة",
            "شارع مزروعة",
            "شارع السيوني",
            "حارة الدراويش",
            "شارع ثابت باشا",
            "شارع حافظ باشا",
            "حارة القبطان",
            "شارع سيدي الاسكندر",
            "شارع عبد العال حلمي",
            "حارة الخلع",
            "شارع إبن ميد",
            "شارع الفراعنة",
            "شارع إبن العرب",
            "حارة الواحات",
            "حارة سيدي سعيد",
            "شارع الحلبي",
            "شارع اسكال الغلال",
            "شارع البيضاوي",
            "شارع الخلفاء",
            "شارع سيدي عماد",
            "شارع المصري",
            "شارع شريف",
            "شارع سلامة موسي",
            "شارع سيدي الزهري",
            "شارع النجمة",
            "حارة سيدي محمد العريان",
            "شارع إبن سهيل",
            "شارع مظلوم باشا",
            "شارع الزهراء",
            "شارع الجنينة",
            "شارع الفارابي",
            "حارة حمزة",
            "شارع خلف الدرداء",
            "شارع أبو الدرداء",
            "شارع واصف",
            "شارع الفراهدة",
            "شارع الفقيه",
            "شارع إبن جبير",
            "شارع الورش",
            "شارع الجيزويت",
            "شارع المختار",
            "شارع أبو تمام",
            "شارع إبن خلدون",
            "شارع الجوهري",
            "شارع الخلعي",
            "شارع الشيخ علي يوسف",
            "شارع الذهبي",
            "شارع رجب الطويل",
            "شارع الإمام مالك",
            "شارع سيدي سعيد",
            "شارع صور",
            "شارع رفاعة بك",
            "شارع مسمط البصل",
            "شارع القفاصي",
            "شارع ابن زيتونة",
            "شارع صلاح الدين",
            "شارع علي باشا مبارك",
            "شارع قطب عثمان",
            "حارة قاصد خير",
            "شارع حوران",
            "شارع سيدي المقدسي",
            "شارع سيدي محمد العريان",
            "شارع زقاق العطن",
            "شارع الشهيد عادل محسن",
            "حارة حوش قدمرا",
            "حارة عبد الباري",
            "شارع مراد بك",
            "شارع أمحتب",
            "شارع رجب الطويل 5",
            "شارع إبن باجة",
            "حارة سيدي ونس",
            "شارع بعلبك",
            "شارع حسن البصري",
            "حارة البهاء الزهير",
            "شارع خلف ساحة بكير",
            "شارع صيدا",
            "حارة حرباء",
            "شارع الرافعي",
            "حارة التمساح",
            "شارع الإمام علي",
            "شارع أبو ضيف",
            "شارع إبن طولون",
            "شارع السمعاني",
            "حارة جدة",
            "شارع دار السلام",
            "شارع الباب الاخضر",
            "شارع إبن بطوطة",
            "شارع شبين الكوم",
            "حارة الحجاج",
            "حارة الخلفاء",
            "شارع هارون الرشيد",
            "شارع علي بك المصري",
            "شارع كرم",
            "شارع عمرو بن كلثوم",
            "شارع قراقوش",
            "شارع الأيوبين",
            "شارع سيدي محمد البردي",
            "شارع إبن العربي",
            "شارع البيطاش",
            "شارع الواسطي",
            "شارع عمر عربي",
            "شارع الجزائر",
            "حارة إبن عطا الله",
            "شارع عثمان اباظة",
            "شارع النابلسي",
            "شارع القاضي سند",
            "حارة سيدي الطعاني",
            "شارع الشيخ جنيدي",
            "حارة الطبي",
            "شارع أبو الخير",
            "حارة المعتز",
            "شارع سيدي المتولي",
            "شارع أحمد فاروق عزت",
            "شارع محمد الشافعي",
            "شارع الكفاح",
            "حارة ظافر الحداد",
            "شارع عبد الله بن المبارك",
            "شارع أبو مسلم",
            "حارة أرتين بك",
            "شارع إسحاق القديم",
            "شارع الغزالي",
            "حارة الحسان",
            "شارع سيف الدولة",
            "حارة الشاذلي",
            "شارع البصيلي",
            "شارع زقاق الصين",
            "شارع الجله خان",
            "شارع مخيمر",
            "شارع عبد الله فكري",
            "حارة الحلواني",
            "حارة الطبراني",
            "شارع عرفة الخيالي",
            "شارع زخاري",
            "شارع بحري بك",
            "حارة السيد الجداوي",
            "شارع أبو الهول",
            "شارع الوداد",
            "شارع المويلحي",
            "شارع التبريزي",
            "شارع الكلزة",
            "شارع النعناعي",
            "شارع عبد المنعم الشرقاوي",
            "حارة الطبري",
            "حارة دغرة",
            "شارع خلف علي بك",
            "شارع البرديس",
            "حارة رسلان",
            "شارع سيدي السوري",
            "شارع سيدي عبد الرازق",
            "شارع إبن زيتران",
            "شارع القاضي جمال الدين",
            "شارع طارق بن زياد",
            "شارع النور",
            "حارة سيدي الطوربيني",
            "شارع حسين باشا فهمي",
            "شارع الاحرار",
            "شارع إبراهيم حسان علي",
            "شارع دمشق",
            "حارة باغوص بك",
            "شارع مدين",
            "شارع الاسراء",
            "شارع سيزوستريس",
            "شارع خلف 116",
            "شارع جبران خليل جبران",
            "شارع عبد الهادي حنفي",
            "شارع إبراهيم ندي",
            "شارع النجع القديم",
            "شارع حسن حجازي",
            "شارع ورشة الطبجية",
            "شارع الراكشي",
            "شارع خلف أحمد عرابي",
            "حارة بدير",
            "حارة شكري يوسف",
            "شارع بلقيس",
            "حارة الست نعيمة",
            "شارع الطور",
            "شارع المولوتي",
            "شارع العناني",
            "شارع عادل خيري",
            "شارع علي الليثي",
            "شارع أحمد مرسي",
            "شارع صفي الدين",
            "شارع قرطبة",
            "شارع مكابس",
            "شارع أحمد حبيب",
            "شارع الاسقف",
            "شارع ترعة المحمودية",
            "شارع أديب",
            "شارع نوبار",
            "شارع زقاق العرب",
            "شارع الالف عامود",
            "شارع الشيخ علي شلبي",
            "شارع البحتري",
            "حارة المتوكل",
            "حارة عطالله",
            "شارع الشريف الرضي",
            "شارع عصمت ام البحرية",
            "شارع حمام العباني",
            "حارة فرغلي",
            "حارة قبو الملاح",
            "شارع النصر",
            "حارة المتنببي",
            "شارع زاوية القلعي",
            "حارة غطاس",
            "شارع بيبرس",
            "شارع مبارك عبد الجليل",
            "شارع الصباب",
            "شارع سبا",
            "شارع يوسف المغيرة",
            "شارع عمر بن عبد العزيز",
            "شارع محمد فهمي حسن",
            "شارع المعلم غالي",
            "شارع الثلاث اعمدة",
            "شارع برهام باشا",
            "شارع محمود مصطفي عسل",
            "شارع طلبة العلم"
        ];
        $parent = Location::where('name', 'المنشية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع إبن الصائغ",
            "شارع جلال رمضان",
            "شارع الباطيني",
            "حارة سيدي عبد ربة",
            "شارع السيالة",
            "شارع السيد محمد كريم",
            "حارة محسن باشا",
            "شارع محمود تيمور",
            "حارة كريم",
            "حارة المكتب",
            "شارع مولاي محمد",
            "شارع وكالة الليمون - حسين توفيق سعد",
            "شارع بيروني",
            "شارع صقر باشا",
            "حارة الفولي",
            "شارع حلايو",
            "حارة شريف باشا",
            "شارع منصور الدمنهوري",
            "زقاق إبن المنذر",
            "شارع النعناعيِ",
            "حارة الصالح الحكيم",
            "حارة سيدي مسعود",
            "حارة عبد الوهاب",
            "شارع الحديني",
            "شارع سيدي الطرودني",
            "شارع التوسيلي",
            "شارع سليم البشري",
            "شارع زاوية الورداني",
            "شارع العياني",
            "شارع الهلال",
            "شارع هدية",
            "شارع جودة",
            "شارع إبن قوم",
            "شارع إبن الفرات",
            "حارة اغا الشاعر",
            "شارع طاهر بك",
            "شارع الترسانة",
            "شارع سيدي عبد الرحمن",
            "شارع الصالح الحكيم",
            "شارع الناضوري",
            "شارع سيدي أبو وردة",
            "حارة سيدي داوود",
            "شارع يحيي",
            "شارع إبن عبد السلام",
            "شارع الجزائلي",
            "شارع أبو يوسف",
            "حارة السماء",
            "شارع سيدي أبو العباس",
            "شارع سيدي الموازيني",
            "شارع إبن النصر",
            "شارع إبن صفوان",
            "شارع حافظ باشا",
            "شارع جعفر",
            "شارع إسماعيل صبري",
            "حارة النخلة",
            "شارع بيرم التونسي",
            "شارع سيدي خليفة",
            "حارة رضوان باشا",
            "شارع زاوية الرجباني",
            "شارع راسم باشا",
            "شارع الدكتور عبد المنعم الرباح",
            "زقاق عابدين",
            "شارع موتش",
            "شارع أبي سفيان",
            "شارع الاباصيري",
            "حارة زاوية بكير",
            "شارع الصحف",
            "حارة الصحن",
            "حارة قراقيش",
            "شارع المسافر خانة",
            "شارع سيدي ياقوت",
            "شارع سيدي كظمان",
            "شارع المغاوري",
            "شارع سيدي نصر الدين",
            "شارع الكناني",
            "شارع البحرية",
            "حارة زاوية شلتوت",
            "شارع الشمرلي",
            "شارع الكابتن عبد القادرة كورة",
            "شارع حسين باشا عاصم",
            "شارع صرواح",
            "شارع مدورة",
            "حارة سلطان",
            "حارة أبو شوشة",
            "حارة عبد الخالق البواب",
            "شارع سوق السمك القديم",
            "حارة قبو الملاح",
            "شارع إبن حنبل",
            "شارع الدكاكين",
            "شارع الخضري",
            "شارع محمد إبن رفيع",
            "حارة ادهم",
            "حارة سيدي خضر",
            "حارة إبن عفيفي",
            "شارع الشوربجي",
            "شارع الجمرك القديم",
            "شارع عمر لطفي",
            "حارة الكيال",
            "شارع ذهني بك",
            "شارع سيد لالو",
            "شارع إبن رشد",
            "حارة دويكو",
            "حارة الرحباني",
            "شارع إسحاق افندي",
            "شارع محمود فهمي النقراشي",
            "شارع البستاني",
            "شارع الصفصاف",
            "شارع منيرة توفيق",
            "شارع الشيخ مصطفي الجزيري",
            "شارع موافي",
            "حارة الاوحدي",
            "شارع مصطفي باشا العرب",
            "حارة الدخاخني",
            "حارة إبن اللبان",
            "شارع رفيعة الشال",
            "شارع زاوية",
            "شارع البلقاني",
            "شارع فهمي الناضوري",
            "شارع الشيخ محمد عبده",
            "حارة حلاوة",
            "شارع الاوزعي",
            "شارع إبن طيعوز",
            "حارة زكريا بك",
            "شارع قيس بن سعد",
            "حارة ابطال الرياضة",
            "شارع الدرملي",
            "شارع الشيخ سليمان",
            "حارة النيلي"
        ];
        $parent = Location::where('name', 'بحرى - الأنفوشى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "النصر",
            "الجيش",
            "نبوي المهندس",
            "ملك حفني",
            "مناطق فرعية بالمنتزه",
            "شارع خالد بن الوليد",
            "ميدان محمد نجيب",
            "شارع الصاغ محمد عبد السلام",
            "شارع الملك",
            "شارع الراون",
            "شارع نورالاسلام",
            "شارع عبد العزيز عبد الحكيم",
            "شارع الحاجة ظريفة",
            "شارع السلام",
            "شارع معاذ بن جبل",
            "شارع الثلاثيني",
            "شارع أحمد الربحاني",
            "شارع الملاحة",
            "شارع السيد نصر",
            "شارع عمر بن الخطاب",
            "شارع المدارس",
            "طريق عزبة العرب",
            "شارع الفرن",
            "شارع عدلان",
            "شارع أحمد الموجي",
            "شارع الأمير",
            "شارع الوكيل",
            "خلف شارع نبوي المهندس",
            "شارع مستودع الدقيق",
            "شارع الجمعية",
            "شارع أحمد رشوان",
            "شارع السيد حنتيرة",
            "شارع خميس أبو كليلة",
            "شارع نشأت",
            "ابراج شيراتون"
        ];
        $parent = Location::where('name', 'المنتزه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "العطارين",
            "وينجت",
            "الورديان",
            "العوايد",
            "الكيلو 21",
            "الحى اللاتينى",
            "وابور المياه",
            "الأزاريطة",
            "شاطئ شهر العسل"
        ];
        $parent = Location::where('name', 'مناطق فرعية بالأسكندرية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع مصطفي كامل",
            "اسكوت",
            "شارع مدرسة القدس",
            "الطريق الدولي الساحلي",
            "شارع 16",
            "شارع 10"
        ];
        $parent = Location::where('name', 'ميامي الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            'قرية سيدي كرير - القوات المسلحه'];
        $parent = Location::where('name', 'سيدى كرير')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الروضة الخضرا",
            "كليوباترا بلازا",
            "مارسيليا فلورينس",
            "حياة مارسيليا",
            "جوار",
            "اليكس ويست",
            "بالم هيلز الاسكندرية",
            "كمبوند رياض العمار",
            "كمبوند جراند فيل",
            "فلورانس ميجا مول - مارسيليا",
            "كمبوند العروبة رويال",
            "كمبوند سالوجا",
            "كمبوند ايفوري مروج - أرض الفيروز",
            "زينيا مروج",
            "كمبوند يو بارك - تشييد",
            "كمبوند مروج هايتس - البارون",
            "ذا رايز",
            "توين فيلات - الفرات",
            "مروج لايف - المعماري",
            "تيفانى انتربيلد - السلام انتربيلد",
            "مروج لاكجري - بنيان",
            "كمبوند في مروج - الغنيمي",
            "كمبوند سموحة فيستيفال سيتي",
            "كمبوند كينج هيلز",
            "بارك بلازا - المعمارى",
            "سكاي لاين ريزيدنس - العروبة",
            "زيننا صواري",
            "ميروزا",
            "جرين فيو",
            "فيروزة سموحة",
            "في صواري - الغنيمي",
            "الفرات سكوير",
            "كمبوند بريميرو - سابا باشا جيت",
            "بوليفارد صواري - لوران",
            "اليكس ستارت",
            "منتجع المهندسين",
            "حدائق السرايا",
            "سيتي لايت - أميال الخليج",
            "بانوراما سيتي - الديوان ",
            "كمبوند البركة"
        ];
        $parent = Location::where('name', 'كمبوند بالأسكندرية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع السفارة الإيطالية",
            "شارع بن بسام",
            "شارع جمال الدين ياسين",
            "شارع دجلة",
            "شارع النبي دانيال",
            "شارع البورصة القديمة",
            "شارع السوق الفرنساوي",
            "شارع المقدم حسن الشيخ",
            "شارع إبن زنكي",
            "شارع الظاهر",
            "شارع سعد زغلول",
            "شارع محمد طلعت نعمان",
            "شارع سيزوستريس",
            "شارع الابياري",
            "شارع الأهرام",
            "شارع سان مارك",
            "شارع بروكش",
            "شارع محمود عزمي",
            "شارع عباس محمود العقاد",
            "شارع المقدم وجية خليل",
            "شارع فخري",
            "شارع اللواء جمال راشد",
            "شارع محمد صادق عمارة",
            "شارع محمد إبراهيم سليم",
            "شارع محمد أحمد الطيب",
            "شارع محمود الفلكي",
            "حارة السقا",
            "شارع أديب بك إسحاق",
            "شارع صلاح سالم",
            "شارع كريت",
            "شارع صعدوا",
            "شارع طلعت حرب",
            "شارع عريان باشا",
            "شارع الدكتور عبد الله يوسف",
            "شارع سيدي المتولي",
            "شارع احمد عرابي",
            "شارع محمد فريد",
            "شارع نجيب الريحاني",
            "شارع الدكتور حسن فضالي",
            "شارع زاهر جلال",
            "شارع فؤاد",
            "شارع كنيسة الاقباط",
            "شارع أنطونيادس",
            "شارع زاوية سلطان",
            "شارع فرج إسماعيل",
            "شارع صفية زغلول",
            "شارع أدهم والي",
            "شارع الدكتور علي إبراهيم",
            "شارع محمد رأفت",
            "شارع كلية الطب",
            "شارع عمر لطفي",
            "طريق الجيش",
            "شارع الشهداء",
            "ميدان الجندي المجهول",
            "حارة الاقباط",
            "شارع اللواء عبد الفتاح الحضري",
            "شارع جميل زهوي",
            "شارع جليس",
            "شارع شكور",
            "السلطان حسين",
            "ميدان الناموس",
            "شارع أحمد أبو سليمان"
        ];
        $parent = Location::where('name', 'محطة الرمل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الفلكي",
            "أحمد إبن حنبل",
            "السيوف بحري",
            "ميدان الساعه",
            "شارع أمين حسونة",
            "شارع جميلة بو حريد"
        ];
        $parent = Location::where('name', 'السيوف')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع بدوي",
            "شارع القاضي",
            "شارع الحلقات",
            "شارع طوسون",
            "شارع محمود سامي البارودي",
            "شارع أنس بن جعفر",
            "شارع أبو قير",
            "شارع رقم 1",
            "شارع متفرع من الخواتلي",
            "شارع الجهاد",
            "شارع الإمام الشافعي",
            "شارع شكري الخواتلي",
            "حارة أبو سمرة",
            "شارع متولي اشمون",
            "طريق اتحاد القضاة",
            "شارع الهدايا",
            "شارع شجرة الدر",
            "شارع الهاشمي",
            "شارع الرحاب",
            "شارع رقم 16",
            "شارع التأمين",
            "شارع رقم 105",
            "شارع الزهراء",
            "شارع الاصلاح",
            "شارع الشهيد طيار أحمد بكر",
            "شارع الإمام مالك",
            "شارع السوق",
            "شارع معسكر الشباب البحر الميت",
            "شارع سلامه عبد الله",
            "شارع البحر الاعظم",
            "شارع 10",
            "شارع رقم 20",
            "شارع الرحمة",
            "شارع الألفي",
            "شارع أبو النصر",
            "شارع محمد أنيس",
            "حارة البحري",
            "شارع الفرات",
            "شارع البنك",
            "شارع هدي الاسلام",
            "شارع أبو سمرة",
            "شارع مساكن الضباط",
            "شارع 25",
            "شارع 8",
            "شارع القسم",
            "شارع رقم 16 طريق قطار رشيد",
            "شارع الظاهر بيبرس"
        ];
        $parent = Location::where('name', 'أبو قير')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'كمبوند بالإسكندرية الجديدة'
        ];
        $parent = Location::where('name', 'الإسكندرية الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي التاسع",
            "الحي العاشر"
        ];
        $parent = Location::where('name', 'برج العرب الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "البيطاش",
            "شاطئ النخيل - ٦ اكتوبر",
            "أبو يوسف",
            "العجمي البحري",
            "العجمي القبلية"
        ];
        $parent = Location::where('name', 'العجمي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            'سوليك جاردنز'
        ];
        $parent = Location::where('name', 'صواري')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End Alex
         *********/


        /*******
        Start sahel
         *********/


        $subs_cairo = [
            "العلمين",
            "منتجعات الساحل الشمالى",
            "العلمين الجديدة",
            "سيدى عبد الرحمن"
        ];
        $parent = Location::where('name', 'الساحل الشمالى')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة العلمين",
            "سيدى عبد الرحمن",
            "تل العيس"
        ];
        $parent = Location::where('name', 'العلمين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "جراند ريزورت",
            "قرية سلاح المهندسين الكيلو 34 ",
            "قرية لؤلؤة كرير",
            "قرية اتحاد ملاك سيدي كرير",
            "قرية الدبلوماسيين 1",
            "سدرا الساحل الشمالى",
            "قرية رع السياحية",
            "قرية امون",
            "قرية شاطئ الفيروز",
            "قرية داليا",
            "منتجع مايوركا",
            "قرية الفيروز",
            "قرية مصر للتعمير",
            "كرير برادايس",
            "قريه المصرين الجديده",
            "قرية كرير لاجون",
            "قريه كيان",
            "قرية السراب ميراج بيتش",
            "قرية كرير جاردنز",
            "قرية الشروق",
            "قرية يولاند الشروق",
            "قرية البنوك",
            "قرية كاربيانو",
            "قرية الأطباء",
            "قرية الطيران",
            "قرية المحامين",
            "الصفا",
            "قرية ديار",
            "قرية جامعة القاهرة",
            "قرية ديبلو",
            "قرية رمسيس",
            "قرية بورتو بيرلة",
            "قرية كازابلانكا",
            "قرية أمراء البحار",
            "قرية جولدن بيتش",
            "قريه بريسدينتال",
            "قرية فينوس 1",
            "قرية فينوس 2",
            "منتجع الياسمين",
            "قرية جنوب مراقيا",
            "هليو بيتش",
            "قرية مراقيا",
            "ابروتيل",
            "قرية ديبلو 2",
            "قرية زمردة",
            "قرية العلميين",
            "جمعية السلام",
            "منتجع غرناطة",
            "منتجع روزانا",
            "قرية فالنسيا",
            "ديانا بيتش",
            "لا جولى بلاج",
            "منتجع سيلا",
            "منتجع هايدى",
            "ريفيرا",
            "منتجع الأصيل",
            "طيبة روز",
            "جراند هيلز الساحل",
            "منتجع شاطئ سلسبيل",
            "منتجع المروة",
            "منتجع تاهيتي",
            "قرية سلمى",
            "قرية دعاء السماء",
            "منتجع لا بالما",
            "قرية الموناليزا",
            "قرية التجاريين",
            "قريه بارادايس",
            "نيس 2",
            "نيس 1 ",
            "قريه بيلا",
            "نيو ماربيلا",
            "قرية قناة السويس",
            "سلينا الساحل الشمالي",
            "اوندكسا ",
            "قرية الرواد",
            "بالم بيتش",
            "قرية الكروان السياحية",
            "الاهرام مرسى مطروح",
            "قرية جامعة الدول العربية",
            "راماتان",
            "قرية مارسيليا",
            "كازابيانكا",
            "قرية المهندسين الجامعيين",
            "مارسيليا بيتش 3",
            "المعموره الجديده",
            "قرية اعضاء التدريس بجامعة عين شمس",
            "مينا 4",
            "زاهراء",
            "حورس",
            "قرية علاء الدين",
            "بانجلوس",
            "قريه جامعه القاهره 2",
            "نيس 4",
            "جرين",
            "ديمورا - الحلو",
            "مارسيليا بيتش 1",
            "نيس 3",
            "بلوز 2",
            "مينا 3",
            "بانوراما بيتش",
            "قريه مرحبا",
            "قرية مصر الجديدة السياحية",
            "قريه المعادي",
            "الساحل الجديد",
            "ريماس",
            "اغادير",
            "قريه موناليزا",
            "قرية كاريبيان الساحل الشمالى",
            "المنتزة",
            "ووتر فالي",
            "قريه مرجان",
            "بتروليم",
            "مارينا فلورز",
            "نسمه",
            "منتجع كرتاج",
            "كوستا ديل سول الساحل",
            "قريه الصحفين",
            "رويال بلازا",
            "قريه بدر",
            "روتوندو - بنيان",
            "سيرينا",
            "مودرن هيلز",
            "فيرجينيا",
            "بالما ريزورت",
            "سي فيو",
            "الزهور",
            "قرية شوكليت كوست",
            "قريه موري",
            "مينا 2",
            "مينا 1",
            "كليوبترا",
            "مارينا سان شاين",
            "لونج بيتش",
            "قريه جامعه اسيوط",
            "جرين بيتش",
            "بيرلا",
            "قريه بوسيت",
            "اتيس",
            "سوميد",
            "قرية مارينا جاردنز",
            "دايموند",
            "قريه اللوتس",
            "باترسي",
            "بيترو بيتش",
            "قرية الأحلام",
            "مارينا فينسيا",
            "قرية الفرسان",
            "مارينا بلازا",
            "قريه تيمبو",
            "قريه بورتو مارينا - عامر جروب",
            "اوشن بلو",
            "مارينا فالى",
            "لابلاج",
            "كاسيا",
            "ماكسيم",
            "مارينا لايف",
            "منتجع ساندز",
            "ستيلا مارينا - رمكو",
            "بورتو جولف مارينا - عامر جروب",
            "جولف باي",
            "مارسيليا لاند",
            "اكوا بورتو",
            "فيستا مارينا الساحل الشمالى",
            "لاجون - أركو",
            "مارينا بوترولايم",
            "بلو فالي",
            "باب البحر",
            "ايطاليان سولجرز",
            "منتجع سهول الساحل الشمالي",
            "بو ساندس",
            "بو ايلاند - مكسيم",
            "لازوردي باي",
            "فرح 1",
            "جنه الريف",
            "ماكسيم 3",
            "مارسيليا بيتش 4",
            "لؤلؤة هليوبوليس",
            "هاسيندا باي - بالم هيلز",
            "قرية الاصدقاء",
            "ديبلو 3",
            "ستيلا - رمكو",
            "مراسي",
            "ماستر",
            "منتجع صن فيجن",
            "ابن سينا",
            "ريتان",
            "فرح 2",
            "قرية كرما",
            "ستيلا هايتس - رمكو",
            "لافيستا كاسكادا",
            "التجارين",
            "بيانكي",
            "سى شيلز",
            "امواج - الاهلي صبور",
            "بلومار وادي دجله",
            "تركواز",
            "هاسيندا وايت - بالم هيلز",
            "تلال",
            "غزالة الوادى",
            "ريكسوس العلمين",
            "كورنادو الساحل الشمالي",
            "لاسرينا الساحل الشمالي",
            "لافيستا باي",
            "تلال 2",
            "ساينس هايتس",
            "امارايتس هايتس",
            "سواني",
            "لامورا الساحل الشمالي",
            "قرية الياسمين",
            "ذا شور",
            "جفيرا - انرشيا",
            "منتجع كورال هيلز",
            "قرية لاميرا",
            "جفيرا باي",
            "كريستال الساحل",
            "سوان ليك الساحل",
            "السكريه",
            "ماونتين فيو",
            "سيزر ايلاند",
            "مينا 5",
            "سيزر باي",
            "بلوز تيفانى",
            "الجوهرة ريزورت",
            "منتجع رويال بيتش",
            "كونتيننتال كوست",
            "سما بيتش",
            "منتجع اماسيا",
            "كوست 82 - هايد بارك",
            "هاسيندا ويست - بالم هيلز",
            "قريه الكوثر",
            "فوكا باي - تطوير مصر",
            "قريه عتاب",
            "ميلسيا",
            "حكمه باي",
            "قريه باغوش",
            "الماظه باي - ترافكو",
            "جاز الماظه بيتش 5",
            "سولى مار الماظه جاردنز",
            "كرستال لاجونز",
            "فلوريا بيتش",
            "كوستا دى لونا",
            "بالم بلاجا",
            "منتجع سي اند سي مطروح",
            "سيسليا لاجونز",
            "قرية كريستال باي الساحل الشمالي",
            "قرية الميريلاند السياحية",
            "سانتا مونيكا",
            "قرية الإعلاميين",
            "جزر ميامي",
            "لافيستا باي إيست",
            "لافيستا رأس الحكمة",
            "لافيستا سول",
            "قرية عايدة",
            "قرية الروضة",
            "مارينا",
            "رو مارينا",
            "كاى الساحل",
            "لازوردى",
            "ملاذ",
            "جايا - الاهلي صبور",
            "وايت باى - باكت",
            "قطامية كوست - ستار لايت",
            "كمبوند المصيف - إم سكوير",
            "مارسيليا علم الروم",
            "ايكو",
            "ميدوى سيدى عبد الرحمن",
            "بالي - الشهاوي",
            "سانتوريني - أباتشى",
            "مارسيليا بيتش 2",
            "سيتي ستارز الساحل - أركو",
            "ماونتن فيو الدبلوماسيين",
            "وايت ساند - جي فى",
            "كاريبيان",
            "زهره - معمار المرشدي",
            "ازميرالدا باي - كليوباترا",
            "تروبيا مارينا",
            "كريت",
            "ماونتن فيو راس الحكمة",
            "منتجع دي باي - تطوير مصر",
            "منتجع واتر واي",
            "سيلا - كونسبت",
            "سي شيل بلايا - نيو جيزة",
            "منتجع أكوا فيو - الأباظية",
            "كاسكاديا - مارسيليا",
            "مارينا 5",
            "مارسيليا بوكيه",
            "منتجع بلايا",
            "منتجع بيلاميرا - العمار",
            "مارينا 2",
            "مارينا 4",
            "مارينا 7",
            "منتجع الروان - شروق الغد",
            "باي ويست",
            "منتجع ريزيه",
            "نايا باي - جمير ايجيبت",
            "جون فيلدج - سوديك",
            "سيلفر ساندس - اورا",
            "هايد بارك الساحل الشمالي",
            "كالي كوست - ميفين",
            "ليك يارد - بالم هيلز",
            "منتجع بلو بلاجا - ايفنت",
            "منتجع بيانكي إليوس - ديفلوبر إكس",
            "منتجع جراندا بيتش - العمار",
            "منتجع أغادير بيتش - العمار",
            "منتجع جوليانا",
            "هاسيندا ريد",
            "قرية فيرونا",
            "سيريديا ريزورت - القادسية",
            "مسايا ريزورت - ايجي جاب ",
            "أزار - ريدي",
            "ازها - مدار",
            "لارينا - ليوبارد",
            "دوس - أكام الراجحي",
            "ذا ميد - بيبول اند بليسز",
            "زويا غزاله باي - LMD",
            "مينا كلوب",
            "روز فالي - الحياة",
            "سانتوريني - سموحة علمين",
            "سيزن - القمزي",
            "مارسيليا بيتش 5",
            "دايركشن وايت - ارابيلا",
            "ريتال",
            "سيلفر بيتش",
            "ماربيلا",
            "سول - اعمار"
        ];
        $parent = Location::where('name', 'منتجعات الساحل الشمالى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "منتجعات العلمين الجديدة",
            "بورتو كروز - عامر جروب",
            "الحي اللاتيني - الشركة السعودية المصرية للتعمير"
        ];
        $parent = Location::where('name', 'العلمين الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End sahel
         *********/


        /*******
        Start matrouh
         *********/


        $subs_cairo = [
            "مدينة مرسى مطروح",
            "الحمام",
            "الضبعه",
            "النجيلة",
            "سيدي براني",
            "السلوم",
            "سيوة",
            "مناطق فرعية بمرسى مطروح",
            "منتجعات مرسى مطروح",
            "راس الحكمة",
            "الليدو"
        ];
        $parent = Location::where('name', 'مرسى مطروح')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }




        $items = [
            "مدينة الحمام",
            "العميد",
            "ساحل العميد",
            "أولاد مسعود",
            "بنجر السكر"
        ];
        $parent = Location::where('name', 'الحمام')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'مدينة الضبعة'
        ];
        $parent = Location::where('name', 'الضبعه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'مدينة النجيلة'
        ];
        $parent = Location::where('name', 'النجيلة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'مدينة سيدى براني'];
        $parent = Location::where('name', 'سيدي براني')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'مدينة السلوم'
        ];
        $parent = Location::where('name', 'السلوم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            'مدينة واحة سيوة'
        ];
        $parent = Location::where('name', 'سيوة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "لاسبيرو مطروح",
            "منتجع ديركو",
            "اندلسية",
            "قريه اصاله",
            "منتجع مايوركا",
            "منتجع سموحة",
            "قرية خليج الكاسح",
            "فندق بوسيت",
            "سابيا ريزورت",
            "قرية القصر السياحية",
            "رويال بلاس",
            "قريه الاصيل",
            "قرية الابيض",
            "منتجع سان جوفاني",
            "تلال الجونة",
            "قرية الهدى",
            "قرية الأطباء",
            "قرية النجيله البحريه",
            "بورتو مطروح بيتش ريزورت - عامر جروب",
            "عجيبة باى",
            "منتجع مارينا مطروح",
            "الأبيض سيتى",
            "عجيبة سيتى ",
            "تاهيتى باى غراولة",
            "باراديس مطروح",
            "جاراولة ايلاندز",
            "فراندا مطروح",
            "قرية الجوهرة",
            "جنوة مطروح",
            "ريڤ",
            "لونج ايلاند",
            "منتجع تلال - روتس",
            "سرايا باي",
            "قرية جميرا بيتش ",
            "منتجع سيا مطروح - المطورون العرب"
        ];
        $parent = Location::where('name', 'منتجعات مرسى مطروح')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End matrouh
         *********/






        /*******
        Start matrouh
         *********/


        $subs_cairo = [
            "منتجعات العين السخنه",
            "مدينة الجلالة الجديدة",
            "طريق العين السخنة - الزعفرانة"
        ];
        $parent = Location::where('name', 'العين السخنة')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "القريه الاولمبيه",
            "شاطئ ذكريات السخنة",
            "كريستال بيتش",
            "جاردينيا بيتش",
            "قرية الزهور للقوات المسلحة",
            "منتجع سلاح الحرب الإلكترونية",
            "شاطئ السادات",
            "شاطئ الكناري 2 - إسحق جروب",
            "شاطئ الكناري 1 - إسحق جروب",
            "قرية جيت بيتش",
            "ساند بيتش",
            "منتجع السماد",
            "اميجو بيتش",
            "منتجع بالميرا",
            "منتجع أكواريوس",
            "ساند بيتش 1",
            "لا سيرينا ميني مصر",
            "فندق الهافير",
            "بلومار السخنة - وادي دجلة",
            "بالم بيتش",
            "أروما ريزيدنس",
            "توليب",
            "العين باى 2",
            "العين باى",
            "مارينا وادي دجلة",
            "ازها - مدار",
            "ستيلا دي ماري 2 - رمكو",
            "ستيلا دي ماري - رمكو",
            "قرية الوادي",
            "ميناء السخنة",
            "رمادا",
            "واحة مينا",
            "منتجع دولفينز بيتش",
            "قرية الحجاز",
            "قرية اميجو 3",
            "المنال 1",
            "المنال 2",
            "سوميد السخنة",
            "مورانو السخنة - وادي دجلة",
            "بورتريت",
            "منتجع العين",
            "موفنبيك السخنة",
            "فندق رمادا",
            "جولدن كوست",
            "المونت جلالة - تطوير مصر",
            "سخنه بالمز",
            "ذا جروف - دار مصر",
            "منتجع جبال",
            "بلومار هيلز - وادي دجلة",
            "سينيكو لا سيستا",
            "لا سيستا",
            "مارينا وادي الدوم",
            "بورتو السخنة - عامر جروب",
            "بلومار الدوم - وادي دجلة",
            "السخنة هايتس",
            "لافيستا 6",
            "لافيستا توباز",
            "لافيستا 2",
            "لافيستا 1",
            "اوشن بلو",
            "قرية حورمحب",
            "منتجع أريج",
            "بورتو ساوث بيتش - عامر جروب",
            "لافيستا جاردنز",
            "هوليداي بيتش",
            "لاجونا باي - بالم هيلز",
            "مصر سينين",
            "ستيلا دي ماري سي فيو - رمكو",
            "هدير لاند 4",
            "فانار دي لونا",
            "لافيستا 3",
            "بياسيرا",
            "منتجع رومانس",
            "منتجع وسبا كانكون السخنة",
            "تورست فاليدج",
            "منتجع أورورا",
            "لا سيرينا بيتش",
            "فينيسيا بنت السلطان",
            "اميكسيكو - آل فرغلي",
            "لا لونا بيتش",
            "اورلاندو",
            "قرية السخنة",
            "كورونادو مارينا السخنة",
            "منتجع امباير",
            "ماليبو",
            "أورلاندو 2",
            "بلو بلو - إم جي",
            "ماونتن فيو السخنة 2",
            "لافيستا 7",
            "منتجع بيلا فيستا",
            "لافيستا 5",
            "نيو فينيسيا",
            "كورال سي بيتش",
            "لافيستا 4",
            "كاي السخنة - مصر ايطاليا",
            "بيلاجيو",
            "لاجولي",
            "بلو باي",
            "منتجع شاطئ الحياة",
            "ماونتن فيو السخنة 1",
            "ريجينا العين السخنة",
            "فندق رويال الزعفرانة",
            "لافيستا راي",
            "تلال السخنة",
            "الجلالة بلازا",
            "ستيلا دى ماري كانترى كلوب - رمكو",
            "مدى - وادي دجلة",
            "عين هيلز - الشهاوي",
            "لاسيرينا السخنة",
            "منتجع جولف جاز ليتل فينس",
            "لولي بيتش",
            "لاسيرينا بالم بيتش",
            "مجادا - ايوان",
            "كارنيليا - أجنا",
            "ابيزا تشيل اوت - ماستر جروب",
            "سانتا كلوز",
            "باي مونت - ميفين",
            "هيفين بيتش - ويست جولف",
            "منتجع فيفا السخنة",
            "منتجع بوهو",
            "جورا الجلالة",
            "ماجيستي باي الجلالة - لاسيرينا",
            "كاب باي - لاسيرينا",
            "منتجع كابري - عامر جروب",
            "جي باي - يونايتد",
            "سخنه هيلز - الحجاز",
            "لاسيرينا ريد كاربت",
            "مول السخنة - أوربت"
        ];
        $parent = Location::where('name', 'منتجعات العين السخنه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "سكاي سيتي - بيراميدز",
            "بيلا فينتو",
            "منتجع فيدالا - بتر هاوس"
        ];
        $parent = Location::where('name', 'مدينة الجلالة الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End matrouh
         *********/





        /*******
        Start herghada
         *********/


        $subs_cairo = [
            "مدينة الغردقه",
            "سهل حشيش",
            "الجونة",
            "السقالة",
            "الميناء",
            "المنطقة الصناعية",
            "الهضبة",
            "الدهار",
            "العرب",
            "الهلال",
            "الاحياء",
            "جمشة",
            "مرسى علم",
            "منتجعات الغردقة",
            "كورنيش الغردقة",
            "حي الكوثر",
            "منطقة الأنتر"
        ];
        $parent = Location::where('name', 'الغردقة / البحر الأحمر')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "سفاجا",
            "وسط البلد",
            "طريق الحجاز"
        ];
        $parent = Location::where('name', 'مدينة الغردقه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            'منتجعات سهل حشيش'
        ];
        $parent = Location::where('name', 'سهل حشيش')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "منتجعات الجونة",
            "سابينا أريا",
            "شارع محمد إبراهيم كامل",
            "طريق كايت سنتر",
            "البستان",
            "طريق نادي واستاد الجونة",
            "2 طريق الجونة"
        ];
        $parent = Location::where('name', 'الجونة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }




        $items = [
            'شارع الشيراتون'
        ];
        $parent = Location::where('name', 'الهضبة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            'منتجعات مرسى علم'
        ];
        $parent = Location::where('name', 'مرسى علم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الداو هايتس",
            "سينزو مول",
            "منتجع عطلة للقوات الجوية المصرية",
            "منتجع بلاتينيوم",
            "الغردقة جراند أكواريوم",
            "قلعة وندسور",
            "مبارك 6",
            "منتجع هيلتون الغردقة",
            "قصر الحمراء",
            "إسبلانادا ريسيدنس",
            "قرية خليجية",
            "قريه اولد فيك",
            "مجمع قرطبة",
            "منتجع بريتيش",
            "مجمع اللوتس الكوثر",
            "قرية ويست سايد",
            "أولد فيك توريست فيلاج",
            "بالما هاوس",
            "ماريوت بيتش ريزورت",
            "منتجع دايموند",
            "دباج مول",
            "مجمع الفرسان",
            "حي الكوثر الجديدة",
            "الداو ستراند",
            "دريم بيتش",
            "فيرجن الغردقه",
            "بيتش فيو",
            "ذا فيو",
            "السيرافي",
            "كازابلانكا بيتش",
            "بلومار الغردقة - وادي دجلة",
            "سى تاج",
            "ستيلا دى ميرى مكادى بى ذا بيتش - رمكو",
            "ستيلا دى ميرى مكادى بى ذا جاردنز - رمكو",
            "سمرا باي",
            "سارا ريزيدنس",
            "كازابلانكا ريزورت",
            "كازابلانكا ستار",
            "سيتي بالس",
            "الربوة ريزيدينس",
            "مكادي هايتس - اوراسكوم",
            "سيلينا باي - بالما جروب",
            "البارون بيتش",
            "برنسيس بالاس",
            "سوما بريز - سوما باي",
            "ابو سوما ريف - سوما باي",
            "وادي جبال - سوما باي",
            "أكوا فن",
            "منتجع برينسس",
            "باي سنترال ريزيدنس - سوما باي",
            "مبارك 2",
            "ميسكا - سوما باي",
            "الدرة ريزيدنس - الدار",
            "منتجع ماجيك فيو",
            "بلو ويفز - الرواد",
            "منتجع بلو باي - الرواد",
            "نعمه تاون - الرواد",
            "بانوراما بارك ريزيدنشال - الرواد",
            "مجاويش",
            "منتجع أرابيا أزور",
            "منتجع تركواز باي",
            "منتجع فيو اكوا - برايم",
            "منتجع ماجرا - برايم",
            "باي ويست - سوما باي",
            "كوستا بلو - الرواد",
            "مبارك 5",
            "كمبوند جانجل",
            "مبارك 11",
            "طيبه جولدن ريزورت",
            "البايو - ذا لاند ",
            "فلورنزا خمسين - رودان جروب"
        ];
        $parent = Location::where('name', 'منتجعات الغردقة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End herghada
         *********/






        /*******
        Start Sedr
         *********/


        $subs_cairo = [
            'منتجعات راس سدر'
        ];
        $parent = Location::where('name', 'راس سدر')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "منتجع سانتا كلوز",
            "عيون موسي",
            "منتجع موسى كوست",
            "قرية الحياة",
            "لا سيرينا عيون موسى",
            "الباتروس اميرة ريزورت",
            "قريه وندر لاند",
            "ماونتن فيو",
            "النزهة بيتش",
            "مراسي",
            "القريه الهولنديه",
            "شاطئ كوين",
            "قرية ماسالا بيتش",
            "قريه الحياه 2",
            "سيينتيدو مملوك بالس ريزورت",
            "مارينا سدر بيتش ريزورت",
            "منتجع بانانا بيتش",
            "تماركو روز",
            "كاليبسو راس سدر",
            "جولدن بيتش 2",
            "اميجو راس سدر",
            "قرية وايت ويف",
            "منتجع بنت السلطان هوليداي",
            "روزا ريزورت",
            "شاطئ فينيسيا",
            "صن لايت",
            "برنسيس باتروس",
            "كنوز رأس سدر",
            "قرية يارا",
            "منتجع لابيرلا",
            "هلنان كونكورد رويال بيتش ريزورت",
            "بالم بيتش",
            " قرية العبور",
            "بون فيل",
            "منتجع بلو لاجون",
            "قرية ريفيرا 1",
            "قرية ريفيرا 2",
            "شاطئ أميجو",
            "شاطئ السرة",
            "منتجع باراديس بيتش",
            "ايلاند بيتش ريزورت",
            "منتجع جرين سدر",
            "دايموند راس سدر",
            "منتجع سيناء ستارس",
            "منتجع جولدن بيتش 1",
            " شمندوره",
            "منتجع قرية جرندل",
            "منتجع فانتازيا",
            "تاج سيناء",
            "لا هاسيندا راس سدر",
            "آزون ريفيرا",
            "منتجع كارما بيتش راس سدر",
            "ريماس هايتس",
            "تافيرا رأس سدر",
            " اولمبيا راس سدر",
            "مون بيتش",
            "إيليت ريزورت",
            "لا في ريزورت",
            "لا بلايا ريزورت",
            " جريك ايلاند ريزورت",
            "دايموند باى",
            "النخيلة هيلز",
            "وايت باى ريزورت",
            "مطارمة بيتش ريزدنس",
            "سيان - امباير ستيت",
            "جراند ريزورت",
            "مينا ريزورت",
            "بورتو رافتي",
            "فالي ريد سي",
            "جازي باي",
            "مطارمة باي",
            "منتجع باي سايد - العتال",
            "منتجع كاريبيانو",
            "ياسمينا بيتش",
            "منتجع ريزورا - اي سي",
            "قرية لافينتو",
            "الجيرو موسي كوست"
        ];
        $parent = Location::where('name', 'منتجعات راس سدر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End Sedr
         *********/







        /*******
        Start sharm
         *********/


        $subs_cairo = [
            'منتجعات شرم الشيخ',
            'شرم الشيخ'
        ];
        $parent = Location::where('name', 'شرم الشيخ')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "الخيمة بيتش ريزورت",
            "بالما بيتش ريزورت",
            "صن رايز مونتيمار ريزورت - جراند سيليكت",
            "كارلتون ريزورت أبارتمنتس",
            "منتجع كورال هيلز",
            "صن تيرا ريزورت",
            "جولدن شرم",
            "ديار الربوة ريزيدنس",
            "رويسات ",
            "مجمع شهد",
            "طلعت ريزيدنس",
            "كريس ريزيدنس",
            "هالومي فيلاز",
            "ليتل هافانا ريزيدنس",
            "حى السلام ريزيدنس",
            "فندق رويال أواسيس",
            "جنينة سيتي",
            "صن شاين ريزيدنس",
            "كليو بارك",
            "صنى لايكس ريزورت",
            "هوليوود",
            "جولدن كوست",
            "دريمز فاكيشن",
            "بالم أريا",
            "دومينة كورال باى اوسيس",
            "فيروز ريزورت",
            "سوزان بارك",
            "سيناء جراند ريزورت",
            "بودوا",
            "سافانا ريزورت",
            "جاردينيا بلازا",
            "لوجينا ريزورت",
            "منتجع مزار",
            "سولى مار شاركس باى",
            "كونكورد السلام",
            "كورال بيتش ريورت المنتزه",
            "ميلتون بيتش ريزورت",
            "كورال سى سينستورى",
            "بارون بالمز ريزورت",
            "أورورا سيرين ريزورت",
            "روابي",
            "منتجع اكسبرينس ايجبت",
            "تيرانا أكوابارك",
            "سييرا ريزورت",
            "ذي فيو نبق ريسيدنس",
            "منتجع هورايزون",
            "كورال سي أكوا كلوب",
            "لاجونا فيستا بيتش ريزورت",
            "بورتو شرم - عامر جروب",
            "لاجونا قرية لودينج",
            "الفراعنه هايتس",
            "نعمة هايتس",
            "لاسيرينا",
            "كونتينينتال شرم",
            "شرم هيلز",
            "دلتا شرم",
            "منتجع جولف هايتس",
            "رويال ريزيدنس 2 - شرم الشيخ",
            "منتجع كوميتا - شرم الشيخ",
            "رويال ريزيدنس 4 - شرم الشيخ",
            "منتجع داون تاون - كونكريت شرم",
            "شرم ريزيدنس",
            "منتجع أكوا مارين",
            "نعمه تاون - بروموشارم"
        ];
        $parent = Location::where('name', 'منتجعات شرم الشيخ')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "مدينة شرم الشيخ",
            "الرويسات",
            "شرم المية",
            "الهضبة",
            "حى النور",
            "خليج نعمة",
            "السفارى",
            "شمال نعمة",
            "نبق",
            "المنتزه"
        ];
        $parent = Location::where('name', 'شرم الشيخ')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End sharm
         *********/






        /*******
        Start dakahleya
         *********/


        $subs_cairo = [
            "المنصوره",
            "طلخا",
            "ميت غمر",
            "دكرنس",
            "اجا",
            "منية النصر",
            "السنبلاوين",
            "الكردي",
            "بنى عبيد",
            "المنزله",
            "تمي الامديد",
            "الجماليه",
            "شربين",
            "المطريه",
            "بلقاس",
            "ميت سلسيل",
            "جمصه",
            "محلة دمنه",
            "نبروه",
            "مناطق فرعية بالدقهلية",
            "مدينة الدقهلية",
            "مدينة المنصورة الجديدة",
            "المنصورة القديمة"
        ];
        $parent = Location::where('name', 'الدقهلية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أويش الحجر",
            "البدالة",
            "البرامون",
            "البقلية",
            "البنديرة",
            "الحواوشة",
            "الخليج",
            "قرية الخيارية",
            "الدنابيق",
            "المالحة",
            "النزهة",
            "بحقيرة",
            "بدواي",
            "بدين",
            "برق العز",
            "بلجاي",
            "تلبانة",
            "جديدة الهالة",
            "جميزة بلجاي",
            "دبوعوام",
            "سلامون القماش",
            "سلكا",
            "سللنت",
            "شاوة",
            "شبرا بدين",
            "شها",
            "طرانيس البحر",
            "طناح",
            "كرم الجديدة",
            "كفر الأمشوطي",
            "كفر البرامون",
            "كفر الشنهاب",
            "كفر بدواي الجديد",
            "كفر بدواي القديم",
            "كفر تلبانة",
            "كفر ميت فاتك",
            "كوم الدربي",
            "كوم بني مراس",
            "منية بدواي",
            "منية سندوب",
            "ميت الأكراد",
            "ميت الصارم",
            "ميت بدر خميس",
            "ميت جراح",
            "ميت خيرون",
            "ميت عزون",
            "ميت علي",
            "ميت عوام",
            "ميت محمود",
            "ميت مزاح",
            "نقيطة",
            "كمبوند بالمنصورة",
            "مدينة المنصورة",
            "إمتداد شارع جيهان",
            "شارع سامية الجمل",
            "توريل",
            "حي الجامعة",
            "شارع الجلاء",
            "شارع الهدى والنور",
            "عبد السلام عارف",
            "شارع الزعفران",
            "جديلة",
            "عزبة الشال",
            "الناصرية",
            "شرق المنصورة",
            "ميدان الحرية",
            "حي الفردوس",
            "مدينة مبارك",
            "شارع الجيش",
            "تقسيم خطاب",
            "شارع المطافي",
            "توريل الجديدة",
            "مدينة النهضة"
        ];
        $parent = Location::where('name', 'المنصوره')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أورمان طلخا",
            "الروضة",
            "الطويله",
            "المنيل",
            "بساط",
            "بطرة",
            "جوجر",
            "دارالسلام",
            "دميرة",
            "ديسط",
            "كتامة الشرقية",
            "كفر الخوازم",
            "كفر الطويلة",
            "كفر العرب",
            "كفر القصالي",
            "كفر بساط",
            "كفر دميرة الجديد",
            "كفر دميرة القديم",
            "كفور العرب",
            "منشأة البدوي",
            "ميت الكرماء",
            "ميت زنقر",
            "ميت عنتر",
            "ميت نابت",
            "مدينة طلخا"
        ];
        $parent = Location::where('name', 'طلخا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أتميدة",
            "أوليلة",
            "البوها",
            "الحاكمية",
            "الدبونية",
            "الرحمانية",
            "القيطون",
            "المعصرة",
            "بشالوش",
            "بشلا",
            "بهيدة",
            "تفهنا الأشراف",
            "جصفا",
            "دماص",
            "دنديط",
            "سرنجا",
            "سنبو مقام",
            "سنفا",
            "صهرجت الكبرى",
            "عزبه عفيفي",
            "كفر أبو العينين",
            "كفر أبو نبهان",
            "كفر إبراهيم يوسف",
            "كفر الجوهري",
            "كفر الحجازي",
            "كفر الشراقوة",
            "كفر الشهيد",
            "كفر الشيخ هلال",
            "كفر المحمدية",
            "كفر المقدام",
            "كفر النعيم",
            "كفر الوزير",
            "كفر بربري سليمان",
            "كفر بهيدة",
            "كفر داود مطر",
            "كفر رشدي",
            "كفر سرنجا",
            "كفر سليمان تادرس",
            "كفر شرف",
            "كفر عطا الله سليمان",
            "كفر على بدرة",
            "كفر علي عبد الله",
            "كفر ميت العز",
            "كفر نعمان",
            "كفور البهايتة",
            "كوم النور",
            "مت يعيش",
            "ميت أبو خالد",
            "ميت العز",
            "ميت الفرماوي",
            "ميت القرشي",
            "ميت محسن",
            "ميت ناجي",
            "هلا",
            "مدينة ميت غمر"
        ];
        $parent = Location::where('name', 'ميت غمر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو طه",
            "أشمون الرمان",
            "البشمور",
            "الجنادي",
            "الحرية",
            "الخشاشنة",
            "القباب الصغرى",
            "القباب الكبرى",
            "القليوبية",
            "الكرماء",
            "المحمودية",
            "المرساة",
            "النهضة الجديدة",
            "جزيرة القباب",
            "حمادة",
            "دموه",
            "ديمشلت",
            "كفر أبو علي",
            "كفر أبو ناصر",
            "كفر الباز",
            "كفر الزهايرة",
            "كفر القباب",
            "كفر عبد المؤمن",
            "منشأة عبد الرحمن",
            "منشأة عبد الرحمن",
            "ميت السودان",
            "ميت النحال",
            "ميت سعدان",
            "ميت شرف",
            "ميت ضافر",
            "ميت طريف",
            "نجير",
            "مدينة دكرنس"
        ];
        $parent = Location::where('name', 'دكرنس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو داود العنب",
            "أبو زيد",
            "إخطاب",
            "الأنشاصية",
            "البساتين",
            "البهو فريك",
            "البيلوق",
            "الدبوس",
            "الدير",
            "السبخا",
            "السلامية",
            "الغراقة",
            "الكرامة",
            "المندرة",
            "برج نور الحمص",
            "بقطارس",
            "تلبنت أجا",
            "جراح",
            "جلموة",
            "جلموة",
            "دروة",
            "ديرب بقطارس",
            "سماحة",
            "سنبخت",
            "سنجيد",
            "شبرا البهو",
            "شبراويش",
            "شنشا",
            "شنيسة",
            "شيوة الشرقية",
            "شيوة الغربية",
            "صهرجت الصغرى",
            "طنامل",
            "طنامل الشرقي",
            "طنامل الغربي",
            "عزب العرب",
            "فيشا بنا",
            "قرموط البهو",
            "كفر الشراقوة السنيطة",
            "كفر اللاوندي",
            "كفر المندرة",
            "كفر النجبا",
            "كفر النجباء",
            "كفر ديرب بقطارس",
            "كفر عوض السنيطة",
            "منشأة الأخوة",
            "منشأة عبد النبي",
            "منشأة منصور",
            "منية سمنود",
            "ميت أبو الحارث",
            "ميت أبو الحسين",
            "ميت أشنا",
            "ميت العامل",
            "ميت دمسيس",
            "ميت فضالة",
            "ميت مسعود",
            "ميت معاند",
            "نوسا البحر",
            "نوسا الغيط",
            "مدينة أجا"
        ];
        $parent = Location::where('name', 'اجا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "البجلات",
            "الجنينة",
            "الحميدية",
            "الدراكسه",
            "الطاهري",
            "النزل",
            "برمبال الجديدة",
            "برمبال القديمة",
            "غنيم شطا",
            "كفر أبو ذكري",
            "كفر علام",
            "كفر قنيش",
            "منشأة الجمال",
            "منشأة عاصم",
            "منشأة مبارك",
            "ميت القمص",
            "ميت تمامة",
            "ميت حديد",
            "ميت عاصم",
            "مدينة منية النصر"
        ];
        $parent = Location::where('name', 'منية النصر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو قراميط",
            "الأورمان",
            "البشنيني",
            "البكارية",
            "البلامون",
            "التمد الحجر",
            "الجلايلة",
            "الحاج عزب",
            "الحجايزة",
            "الحصاينة",
            "الحصوة",
            "الرمزية",
            "الروضة",
            "الزريقي",
            "الزهايرة",
            "الشعالة",
            "الفتح",
            "القنان",
            "المتوة",
            "المخزن",
            "المقاطعة",
            "الوحدة العربية",
            "برج نور العرب",
            "برقين",
            "برهمتوش",
            "بشمس",
            "ديو الوسطى",
            "شبرا قبالة",
            "شبراسندي",
            "شبراهور",
            "طرانيس العرب",
            "طماي الزهايرة",
            "طنبارة",
            "طنبول الكبرى",
            "طهواي",
            "طوخ الأقلام",
            "غزالة",
            "قرقيرة",
            "كفر الروك",
            "كفر الشرفا",
            "كفر الشهيد مصطفى حمودة",
            "كفر العزاوي",
            "كفر بدوي جرجس",
            "كفر بني سالم",
            "كفر سعد",
            "كفر سلامة",
            "كفر شبراهور",
            "كفر طنبول الجديد",
            "كفر طنبول القديم",
            "كفر عبد الأمين حسب الله",
            "كفر غنام",
            "كفر قنصوة",
            "كفر محمد الشناوي",
            "كفر يوسف عوض",
            "منشأة رضا",
            "منشأة عزت",
            "منشأة هلال",
            "ميت غراب",
            "ميت غريطة",
            "نوب طريف",
            "مدينة السنبلاوين"
        ];
        $parent = Location::where('name', 'السنبلاوين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "أبو المعاطي الباز",
            "الحدادة",
            "الديسة",
            "الزهيري",
            "الصلاحات",
            "اليوسيفية",
            "ديرب الخضر",
            "طلمبات بني عبيد",
            "كفر الصلاحات",
            "كفر ميت فارس",
            "مبارك",
            "منشأة مصبح",
            "ميت سويد",
            "ميت عدلان",
            "مدينة بنى عبيد"
        ];
        $parent = Location::where('name', 'بنى عبيد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد بانة",
            "أولاد حانة",
            "أولاد سراج",
            "أولاد علم",
            "أولاد ناصر",
            "أولاد نور",
            "إسكندرية الجديدة",
            "البصايلة",
            "البصراط",
            "الجماملة",
            "الحوتة",
            "الخلايفة",
            "الدقانوة",
            "الرودة",
            "الستايتة",
            "الشبول",
            "الشريفية",
            "العامرة",
            "العريان",
            "العزيزة",
            "العمارنة",
            "الفروسات",
            "القزاقزة",
            "القطشة",
            "المواجد",
            "النسايمة",
            "الهنايدة",
            "بني هلال",
            "جديدة المنزلة",
            "دار السلام",
            "عزبة الطوابرة",
            "كفر حجاج",
            "ميت خضير",
            "ميت شريف",
            "مدينة المنزلة"
        ];
        $parent = Location::where('name', 'المنزله')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو الصير",
            "أبو داود",
            "البيضا",
            "الخمسة",
            "الربع",
            "السعودية",
            "السمارة",
            "الصفا",
            "العميد",
            "الكمال",
            "الميهي",
            "تاج العز",
            "زفر",
            "صدقا",
            "كفر الأمير عبد الله",
            "كفر سنجاب",
            "منشأة المعالوة",
            "منشأة صبري",
            "منشية السلام",
            "منشية الشرفا",
            "منشية الغربي",
            "مدينة تمى الأمديد"
        ];
        $parent = Location::where('name', 'تمي الامديد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المحلاوي",
            "الهيشة",
            "مبارك",
            "ميت مرجا سلسيل",
            "مدينة الجمالية"
        ];
        $parent = Location::where('name', 'الجماليه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو جلال",
            "الأحمدية",
            "الحصص",
            "السعدية",
            "السلام",
            "الشناوي",
            "الصبرية",
            "الضهرية",
            "العوضية",
            "بساط كريم الدين",
            "ترعة غنيم",
            "دنجواي",
            "رأس الخليج",
            "كفر أبو زاهر",
            "كفر الأطرش",
            "كفر الترعة الجديد",
            "كفر الترعة القديم",
            "كفر الحاج شربيني",
            "كفر الحطبة",
            "كفر الدبوسي",
            "كفر الشيخ عطية",
            "كفر الوكالة",
            "كفر منشأة النصر",
            "كفر يوسف",
            "محلة أنشاق",
            "مدينة شربين"
        ];
        $parent = Location::where('name', 'شربين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "اولاد صبور",
            "الضاهر",
            "العصافره",
            "مدينة المطرية"
        ];
        $parent = Location::where('name', 'المطريه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو بصل",
            "أبو دشيشة",
            "أبو شريف",
            "أبو طه",
            "الجوادية",
            "الحفير والأمل",
            "الخلالة",
            "الخلالة الحديثة",
            "الدمايرة",
            "الرملة",
            "الزهراء",
            "الستاموني",
            "السماحية الكبرى",
            "الشركة",
            "الشوامي",
            "العريض",
            "المعصرة",
            "النشرة",
            "بسنديلة",
            "جميانة",
            "زيان",
            "قلبشوة",
            "كفر الغنامة",
            "كفر دملاش",
            "منشأة بسنديلة",
            "منشأة شومان",
            "منشأة عبد القادر",
            "مدينة بلقاس"
        ];
        $parent = Location::where('name', 'بلقاس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الاتحاد",
            "الجوابر",
            "الكفر الجديد",
            "حي السلام",
            "مدينة ميت سلسيل"
        ];
        $parent = Location::where('name', 'ميت سلسيل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            'المروة'
        ];
        $parent = Location::where('name', 'جمصه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الناصرية",
            "كفر سعفان",
            "مبارك الجديدة",
            "منشأة السلام",
            "مدينة محلة دمنة"
        ];
        $parent = Location::where('name', 'محلة دمنه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أفنيش",
            "الدروتين",
            "الطيبة",
            "بانوب",
            "بهوت",
            "تيرة",
            "درين",
            "طبنوها",
            "كفر الأبحر",
            "كفر الجنينة البحري",
            "كفر الحصة",
            "كفر الدكروري",
            "كفر بهوت",
            "ميت عياد",
            "نشا",
            "مدينة نبروة"
        ];
        $parent = Location::where('name', 'نبروه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "زاهية - سيتي ايدج",
            "ذا بيرل - الصفوة",
            "كمبوند سيبيل - المعادي جروب",
            "مارينا دلتا",
            "اسكان الفيلات",
            "سكن مصر",
            "جنة مصر",
            "الاسكان المتميز",
            "اسكان الابراج",
            "مول المنصورة الجديدة - أركانيا",
            "مركز المنصورة الجديدة الطبي - أيسلز",
            "لافيدا مول - السلام للتعمير"
        ];
        $parent = Location::where('name', 'مدينة المنصورة الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع جلجل الشرقي",
            "شارع أبو عبيدة",
            "شارع المكتب الشرقي",
            "شارع الزناتي",
            "شارع البنا",
            "شارع شمس",
            "شارع جلجل الغربي",
            "شارع الإمام أحمد",
            "شارع القناوي حسن",
            "شارع أحمد سلامة",
            "شارع نسيم",
            "شارع الشهيد محمد سعد حمد",
            "شارع الأسواق",
            "شارع السبكي",
            "شارع مراد",
            "شارع فؤاد",
            "شارع المساكن",
            "شارع محمد البلطجي",
            "شارع السيد سليم",
            "شارع محمد أبو سمرا",
            "شارع الحداد",
            "شارع الحفناوي",
            "شارع سلام",
            "شارع جاد",
            "شارع أبو عبد الله",
            "شارع رضا",
            "شارع عزام",
            "شارع القزاز",
            "شارع وهبه ياقوت",
            "شارع إبراهيم الفلاح",
            "شارع محمد السلموني",
            "شارع المهدي",
            "شارع الجلاء",
            "شارع أبو السعود",
            "شارع الساعي",
            "شارع فوزي",
            "شارع الشهيد محمد صلاح عويس",
            "شارع الاتربي",
            "شارع محمد بيك فتحي",
            "شارع سابق",
            "شارع الشيمي",
            "شارع أبو غريب",
            "حارة عبد الغفار",
            "شارع إبراهيم أبو السعود",
            "شارع إبراهيم درويش",
            "شارع السلخانة",
            "شارع صابون",
            "شارع العسقلاني",
            "شارع الإسكندراني",
            "شارع النوتي",
            "شارع السرج",
            "شارع محمد عبد الغني",
            "شارع الشهيد محمد مطاوع",
            "شارع أبو عوف",
            "شارع حمد",
            "شارع العطار",
            "شارع القطب",
            "شارع السكة الحديدية الجديدة",
            "شارع علي العبد",
            "شارع إسكندر صموله",
            "شارع العباسي",
            "شارع الكامب",
            "شارع زهران",
            "شارع إبراهيم الشناوي",
            "شارع المكباتي",
            "شارع الزهراء",
            "شارع نوح",
            "شارع الكناني",
            "شارع جاويش",
            "شارع الشيخة عائشة",
            "شارع النحاس",
            "شارع إبراهيم العطار",
            "شارع أبو الصعيدي",
            "شارع الأبيض",
            "شارع محمد فريد",
            "شارع إبراهيم جمال",
            "شارع الثورة",
            "شارع خليل حبشي",
            "شارع كراس",
            "شارع إبن لقمان",
            "شارع إبن لقمان القبلي",
            "شارع علي شرف",
            "شارع أبو الدويل",
            "حارة المرشدي",
            "شارع علي محمود طه",
            "شارع كامل",
            "شارع سوق السمك",
            "شارع الهمزاوي",
            "شارع سيدي ياسين",
            "حارة الصقلاني",
            "شارع محمد رضا عنان",
            "شارع الأباصيري",
            "حارة الشريف",
            "شارع جاد الله",
            "شارع المدرسة",
            "شارع حسين يونس",
            "شارع العجمي",
            "شارع الظاهر",
            "شارع سيدي عبد القادر",
            "شارع خيري الجوهري",
            "شارع متري",
            "شارع النقيب محمد أمين السلموني",
            "شارع آغا",
            "شارع الامبابي",
            "شارع المدير",
            "شارع حسين بيك",
            "شارع نصار",
            "شارع جامعة الدول العربية",
            "شارع عوضين",
            "شارع المرسي غزالة",
            "حارة السلحدار",
            "شارع ريحان",
            "شارع فريدة حسان",
            "شارع الشيج أحمد العيساوي",
            "شارع الأساقفة",
            "شارع الجمهورية",
            "شارع ممتاز",
            "شارع الشهيد إبراهيم رضوان",
            "شارع المعصراني",
            "شارع الثلاجة",
            "شارع الحوت",
            "شارع صيام",
            "شارع الطنطاوي",
            "شارع سكة سندوب",
            "شارع الصالح أيوب",
            "شارع الشهيد هاني كامل عبد الرحمن",
            "شارع المغربي",
            "شارع بور سعيد",
            "شارع ثروت",
            "شارع علي نوشي",
            "شارع حسن",
            "شارع أمين الحسيني",
            "شارع الممر التجاري",
            "شارع الأربعين",
            "شارع الشابوري",
            "شارع سعيد",
            "شارع السيدين",
            "شارع النذير",
            "شارع محمد صبري أبو علم",
            "شارع عبد الباري حافظ",
            "شارع خيري",
            "شارع البردانية",
            "شارع الغمراوي",
            "شارع بدر",
            "شارع عبد البديع",
            "شارع إبراهيم خليل",
            "شارع سوق الجبانات",
            "شارع محمود فهمي النقرشي",
            "شارع قلاده"
        ];
        $parent = Location::where('name', 'المنصورة القديمة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End dakahleya
         *********/




        /*******
        Start sharkeya
         *********/


        $subs_cairo = [
            "الزقازيق",
            "منيا القمح",
            "بلبيس",
            "مشتول السوق",
            "القنايات",
            "ابو حماد",
            "القرين",
            "ههيا",
            "ابو كبير",
            "فاقوس",
            "الصالحية الجديدة",
            "الابراهيميه",
            "ديرب نجم",
            "كفر صقر",
            "اولاد صقر",
            "الحسينيه",
            "صان الحجر",
            "منشأة ابو عمر",
            "مناطق فرعية بالشرقية",
            "مدينة الشرقية",
            "شارع التجنيد"
        ];
        $parent = Location::where('name', 'الشرقية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أم الزين",
            "أم رماد",
            "أنشاص البصل",
            "البيوم",
            "الرياض",
            "الزنكلون",
            "الزهراء",
            "السعادة",
            "الشبانات",
            "الصفا",
            "الطاهرة",
            "الطيبة",
            "العصلوجي",
            "العلوية",
            "الغار",
            "القصالي",
            "المسلمية",
            "النخاس",
            "النكارية",
            "بنايوس",
            "بني شبل",
            "بني عامر",
            "بني عباد",
            "بهجات",
            "بهنباي",
            "بيشة قايد",
            "تل حوين",
            "تل مسمار",
            "حوض الطرفة",
            "دويدة",
            "شبية النكارية",
            "شرويدة",
            "شنبارة الميمونة",
            "شوبك بسطة",
            "شيبة النكارية",
            "طاروط",
            "طهرة حميد",
            "غزالة الخيس",
            "فرسيس",
            "كفر أباظة",
            "كفر أبو جبل",
            "كفر أبو نجاح",
            "كفر أحمد برهام",
            "كفر أحمد جبران",
            "كفر أحمد صالح",
            "كفر الأشراف",
            "كفر الجراية",
            "كفر الحصر",
            "كفر الحلبي",
            "كفر الحمام",
            "كفر السطوحية",
            "كفر الشاويشية",
            "كفر الشيخ موسى عمران",
            "كفر جمصة",
            "كفر دنوهيا",
            "كفر سليمان موسى",
            "كفر عبد الملك منصور",
            "كفر عطا الله سلامة",
            "كفر عوض الله حجازي",
            "كفر محمد حسين",
            "كفر محمد شاويش",
            "كفر محمود شاويش",
            "كفر مكاوي",
            "كفر نوار حنا",
            "كفر يوسف سلامة",
            "كوم الأشراف",
            "مشتول القاضي",
            "منشأة أبو الأخضر",
            "ميت أبو عربي",
            "ميت أبو علي",
            "ميت ركاب",
            "ميت زافر",
            "نشوة",
            "هرية رزنة",
            "مناطق فرعية بالزقازيق",
            "مدينة الزقايق",
            "القومية",
            "شارع مساكن الاستاد"
        ];
        $parent = Location::where('name', 'الزقازيق')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو طوالة",
            "الاعراس",
            "الجديدة",
            "الحميدية",
            "الحوض الطويل",
            "الخرس",
            "السعديين",
            "الصنافين البحرية",
            "الصنافين القبلية",
            "العزيزية",
            "العقدة",
            "القبة",
            "القراقرة",
            "المجازر",
            "المحمدية",
            "المساعدة",
            "المعالي",
            "الميمونة",
            "النعامنة",
            "الولجا",
            "بندف",
            "بني حسين",
            "بني قريش",
            "بني هلال",
            "بيشة عامر",
            "تلبانة",
            "خلوة الشعراوي",
            "سنهوا",
            "سنهوت",
            "سنيطة ابو طواله",
            "شبرا السلام",
            "شبرا العنب",
            "شلشلمون",
            "شيبة قش",
            "ظهر شرب",
            "قطيفة العزيزية",
            "قمرونة",
            "كرديدة",
            "كفر أبو دقن",
            "كفر أبو شحاتة",
            "كفر أيوب عوض",
            "كفر الدير",
            "كفر الزقازيق القبلي",
            "كفر الشعاورة",
            "كفر الشيخ خليفة",
            "كفر الصعايدة",
            "كفر الغنيمي",
            "كفر المراغة",
            "كفر بدران",
            "كفر بقطر سعد",
            "كفر حسن عطا الله",
            "كفر حسن عكاشة",
            "كفر حسن ندا",
            "كفر حسين الطوبجي",
            "كفر سلامة إبراهيم",
            "كفر سلامة بشارة",
            "كفر شعبان",
            "كفر شلشلمون",
            "كفر صليب رزق",
            "كفر عبد الله شنقاص",
            "كفر عبد الله عزيزة",
            "كفر عبد النبي",
            "كفر عثمان عفت",
            "كفر علي غالي",
            "كفر عمر مصطفى",
            "كفر فرج جرجس",
            "كفر محمد أحمد",
            "كفر محمد الغتوري",
            "كفر مصطفى",
            "كفر موسى شاويش",
            "كفر ميت بشار",
            "كفر ميت سهيل",
            "كفر نشوة",
            "كفر يوسف سمري",
            "كوم حلين",
            "ملامس",
            "منشأة شفيق",
            "ميت بشار",
            "ميت ربيعة الدللا",
            "ميت سهيل",
            "ميت يزيد",
            "مدينة منيا القمح"
        ];
        $parent = Location::where('name', 'منيا القمح')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد سيف",
            "أولاد مهنا",
            "البلاشون",
            "الجوسق",
            "الدهاشنة",
            "الروضة",
            "الزوامل",
            "السعادات",
            "السعيدية",
            "السلام",
            "الشولية",
            "الطحاوية",
            "العبسي",
            "العدلية",
            "الكتيبة",
            "الكفر القديم",
            "المنشية",
            "بساتين الإسماعيلية",
            "بساتين سراج الدين",
            "بني صالح",
            "تل روزن",
            "حفنا",
            "حوض الندى",
            "سلمنت",
            "سندنهور",
            "سيكم",
            "شبرا النخلة",
            "غيتة",
            "قرملة",
            "قهلة الجبلة",
            "كفر أكياد",
            "كفر أيوب سليمان",
            "كفر إبراهيم العايدي",
            "كفر السلوى",
            "كفر الشيخ عيسى",
            "كفر العرب",
            "كفر بني عليم",
            "كفر حفنا",
            "كفر مسعود حجازي",
            "منشأة السلام",
            "منية سلمنت",
            "منية سنتا",
            "ميت جابر",
            "ميت حبيب",
            "ميت حمل",
            "ميت ربيعة البيضاء",
            "ميت معلا",
            "نوبة",
            "مدينة بلبيس",
            "شارع المعاهدة",
            "شارع لطفي السيد",
            "شارع رقم 138",
            "شارع بور سعيد",
            "شارع حلمي جمعة",
            "شارع عبد القادر موسي",
            "شارع الأشرم",
            "حارة مكي",
            "شارع مكي",
            "شارع الفاهم",
            "شارع زكي عبده",
            "شارع سعد زغلول",
            "شارع رقم 139",
            "شارع رقم 144",
            "شارع مصطفي كامل",
            "شارع السعيد علي طرطور",
            "حارة المليجي",
            "شارع محمد رفعت",
            "شارع الجمل",
            "حارة أسر",
            "حارة رمضان",
            "حارة شازلي",
            "شارع رقم 124",
            "شارع أبو حيفه",
            "حارة الفيشاوي",
            "شارع رقم 143",
            "شارع يوسف الفقي",
            "شارع الشيخ صالح",
            "شارع أمير المؤمنين",
            "شارع فيشاوية",
            "شارع فلفل",
            "شارع الفواخري",
            "شارع عبد العزيز الكوشي",
            "شارع رقم 145",
            "شارع العراقي",
            "شارع الشيخ داوود",
            "شارع أبو زيد",
            "شارع الشحات أبو عبادة",
            "حارة زاوية الكبير",
            "شارع أمين الأقطع",
            "شارع رقم 134",
            "شارع رقم 136",
            "شارع رقم 146",
            "شارع عوض سالم",
            "شارع عبدالرحمن",
            "شارع العجوزة",
            "شارع رقم 147",
            "شارع شيخ المنسي",
            "شارع الجبانة",
            "شارع القاضي",
            "شارع رب الخلايا",
            "شارع شاويش",
            "شارع البراهي",
            "شارع مجدي الكردي",
            "شارع المولد",
            "حارة الحصري",
            "شارع السادات",
            "شارع أبو حسين",
            "شارع درب الوكالة",
            "شارع الصديق",
            "شارع المنسي",
            "شارع فخر",
            "حارة العيش",
            "شارع زاميل",
            "شارع أسامة بن عفان",
            "شارع رقم 119",
            "شارع عمرو بن العاص",
            "شارع الشيخ خلف",
            "حارة السهداني",
            "شارع مهدي الجفاص",
            "شارع رقم 103",
            "شارع المظلوم",
            "شارع محفوظ الهش",
            "شارع عبد الرازق عيد",
            "شارع محمد سامي فتحي",
            "شارع الزاهد",
            "شارع البوابين",
            "شارع عواد محمد عواد",
            "شارع شاكر",
            "شارع عبد العزيز",
            "حارة عبد الفتاح جاد",
            "حارة مسلم",
            "شارع محمد عبد الهادي",
            "حارة مرسي",
            "شارع بدوي",
            "حارة رقم 72",
            "حارة رقم 108",
            "شارع الطباخ",
            "شارع البطريق",
            "شارع عابدين",
            "شارع فؤاد محرم",
            "شارع أحمد الأنصاري",
            "شارع رقم 88",
            "شارع رقم 96",
            "شارع نبوي",
            "حارة حمام",
            "شارع رقم 91",
            "حارة أمين عيد",
            "شارع أبو النور",
            "شارع رقم 49",
            "شارع مكة المكرمة",
            "شارع عمر المختار",
            "شارع رقم 154",
            "شارع نادي البلدية",
            "شارع أبو صقر",
            "شارع عصام",
            "شارع عبد الوهاب الجمل",
            "شارع حسن عبد ربه",
            "حارة محمود عبد الله",
            "شارع المحكمة",
            "شارع رقم 127",
            "شارع رقم 110",
            "شارع عبد الهادي حسن",
            "شارع علي الديب",
            "شارع الباهي",
            "شارع الترعة الحمراء",
            "شارع عمر بن الخطاب",
            "حارة رقم 111",
            "شارع الأصلي",
            "شارع جمال عبد الناصر",
            "شارع بلال بن رباح",
            "شارع رقم 150",
            "حارة رقم 44",
            "شارع اموت",
            "شارع أبو فودة",
            "شارع الجبغانة",
            "شارع محمد سليمان",
            "شارع أبو شوشة",
            "شارع نورالاسلام",
            "شارع رقم 115",
            "شارع نجيب محفوظ",
            "شارع أبو العلا",
            "زقاق عايدة",
            "شارع رقم 69",
            "شارع حبيب الشبراوي",
            "شارع الحسين",
            "شارع سعيد الشبراوي",
            "شارع رقم 81",
            "شارع درب دلال",
            "شارع عبد الرحمن الربيع",
            "شارع رقم 82",
            "حارة زايد",
            "حارة الجنينة",
            "شارع رقم 83",
            "شارع رقم 120",
            "شارع العلوية",
            "شارع زويد",
            "حارة داوود",
            "شارع رقم 98",
            "شارع رقم 61",
            "شارع رقم 95",
            "شارع رقم 97",
            "شارع عبد الرؤوف",
            "شارع أبو عبيدة الجراح",
            "حارة موسي",
            "شارع الخلايا",
            "حارة البرق",
            "حارة السيد الغربية",
            "شارع رقم 176",
            "شارع صلاح بركات",
            "حارة رقم 50",
            "حارة النشار",
            "زقاق صابر",
            "شارع رقم 59",
            "شارع حسن البطريق",
            "حارة القفاص",
            "شارع رجب بيك",
            "حارة رقم 34",
            "حارة أبو تراب",
            "شارع رقم 101",
            "حارة العلوية",
            "شارع فتحي",
            "حارة رقم 109",
            "شارع رقم 102",
            "شارع زاوية رمضان",
            "شارع الربيع",
            "حارة شيخ جودة",
            "شارع عبد العزيز أبو قعود",
            "حارة جاد الله",
            "حارة رقم 42",
            "شارع عادل صيقع",
            "شارع محمد القفص",
            "شارع رقم 85",
            "شارع السوق",
            "شارع رقم 90",
            "شارع حارة أبو هاشم",
            "شارع عسكر",
            "حارة رقم 71",
            "شارع الحاج عبد السلام",
            "شارع أبو النجا",
            "حارة رقم 91",
            "شارع أحمد العصر",
            "شارع علي أبو عيسي",
            "شارع خلف الثانوية",
            "شارع رشيد أبو لبن",
            "شارع رقم 70",
            "شارع أحمد متولي رضوان",
            "حارة رقم 48",
            "حارة أبو عيسي",
            "شارع رقم 77",
            "شارع القومي",
            "شارع الاستاذ احمد طرطور",
            "حارة رقم 73",
            "شارع عبد الحامد الطحاوي",
            "شارع حميد النجار",
            "شارع فتوح الشامي",
            "شارع محي الدين الراعي",
            "شارع عبد المعطي الحمصاني",
            "شارع رقم 89",
            "شارع فؤاد السقا",
            "شارع رقم 86",
            "شارع رقم 15",
            "شارع رقم 87",
            "شارع عبد الرحمن الزيان",
            "شارع عبد الخالد عاشور",
            "شارع حسن أيوب",
            "شارع علي بن أبي طالب",
            "شارع رقم 72",
            "شارع أحمد أبو ضيف",
            "شارع رفاعي",
            "شارع رقم 79",
            "حارة رقم 89",
            "شارع محمد مهدي",
            "حارة رقم 90",
            "شارع رمضان عيد مليجي",
            "شارع سليم",
            "شارع رقم 67",
            "شارع حارة العلاوي",
            "شارع حارة أبو سالم",
            "شارع رقم 401",
            "شارع محي بزناء",
            "شارع رقم 40",
            "شارع رقم 6",
            "شارع عبد المحسن محمد حسين",
            "شارع رقم 1",
            "شارع رقم 75",
            "شارع أحمد فؤاد",
            "شارع رقم 66",
            "شارع رقم 62",
            "حارة عبيد",
            "شارع علي الدق",
            "شارع عبد العزيز رفعت",
            "شارع رقم 10",
            "شارع رقم 7",
            "حارة قللي",
            "شارع رقم 2",
            "شارع النقرشي",
            "شارع الثورة",
            "شارع محمد علي",
            "شارع الحناوي",
            "شارع رقم 22",
            "شارع رقم 45",
            "شارع رقم 47",
            "شارع رقم 46",
            "شارع إبراهيم أحمد",
            "شارع ابو شوالي",
            "شارع رقم 31",
            "شارع رقم 32",
            "شارع سعيد أيوب",
            "شارع محمد السيد أيوب",
            "شارع رقم 80",
            "شارع السيد رشاد",
            "حارة رقم 35",
            "شارع عبد العظيم الفيشاوي",
            "شارع محمد العش",
            "شارع عمار بن ياسر",
            "شارع رقم 9",
            "شارع السجال القديم",
            "شارع الشهيد محمد حسن",
            "شارع مصطفي محمود",
            "شارع المتاجر الشابية",
            "شارع الجهاد",
            "شارع الهدي",
            "شارع رقم 55",
            "شارع محمد سامي البغدادي",
            "محمد علي سلطان"
        ];
        $parent = Location::where('name', 'بلبيس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبراش",
            "البتية",
            "الخشة",
            "الصحافة",
            "الغفارية",
            "المناصرة",
            "المنير",
            "دهمشا",
            "قشا",
            "كفر أبراش",
            "كفر الشرابية",
            "كفر دهمشا",
            "كفر يوسف شحاتة",
            "نبتيت",
            "مدينة مشتول السوق"
        ];
        $parent = Location::where('name', 'مشتول السوق')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "الأسدية",
            "الجعفرية",
            "الحرية",
            "الحلميه",
            "الخيس",
            "السعدية",
            "السناجرة",
            "الشيخ جبيل",
            "الصوة",
            "العباسة",
            "العراقي",
            "العمارة",
            "القطاوية",
            "المسيد",
            "النصر",
            "بحطيط",
            "بني أيوب",
            "بني جري",
            "تل مفتاح",
            "شنبارة الطنانات",
            "صفط الحنا",
            "طويحر",
            "عرب الفدان",
            "عليم",
            "عمريط",
            "كشيك",
            "كفر أبو مسلم",
            "كفر أبو نجم",
            "كفر العزازي",
            "كفر حافظ",
            "كفر زيدان منديل",
            "كفر عياد كريم",
            "منشأة العباسة",
            "ميت ردين",
            "مدينة أبو حماد"
        ];
        $parent = Location::where('name', 'ابو حماد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }




        $items =[
            "الاحسانية",
            "الزرزمون",
            "السكاكرة",
            "السلامون",
            "الشبراوين",
            "العدوة",
            "العواسجة",
            "الفواقسة",
            "المحمودية",
            "المسلمي",
            "المطاوعة",
            "المهدية",
            "حوض نجيح",
            "خلوة أبو حطب",
            "شرشيمه",
            "صبيح",
            "كفر أبو حطب",
            "كفر أولاد عطية",
            "كفر الخضيري",
            "كفر الشيخ الظواهري",
            "كفر العايد",
            "كفر حمودة أرناؤوط",
            "كفر دبوس",
            "كفر عجيبة",
            "منزل حيان",
            "منشأة غالي منصور",
            "مدينة ههيا"
        ] ;
        $parent = Location::where('name', 'ههيا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو ياسين",
            "أولاد موسى",
            "الأحراز",
            "الحصوة",
            "الحماديين",
            "الدهتمون",
            "الرحمانية",
            "الرياض",
            "العزازية",
            "الغابة",
            "القراموص",
            "المشاعلة",
            "بني عياض",
            "جزيرة الشيخ",
            "سنتريس",
            "طوخ القراموص",
            "فراشة",
            "كفر السواقي",
            "كفر النصيري",
            "كفر هربيط",
            "منزل ميمون",
            "منشأة المناسترلي",
            "منشأة رضوان",
            "منشأة صدقي",
            "نزلة العارين",
            "نزلة خيال",
            "هربيط",
            "مدينة أبو كبير"
        ];
        $parent = Location::where('name', 'ابو كبير')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أشكر",
            "أكياد البحرية",
            "أكياد القبلية",
            "أولاد العدوي",
            "أولاد عابدين",
            "الأخميين",
            "الجعافرة",
            "الحجاجية",
            "الحجاجية المستجدة",
            "الخطارة",
            "الدميين",
            "الديدامون",
            "الروضة",
            "السماعنة",
            "الصالحية القديمة",
            "الصوالح",
            "الطويلة",
            "الغزالي",
            "النحاسين",
            "النمروط",
            "النوافعة",
            "الهيصمية",
            "بني صريد",
            "جهينة البحرية",
            "درويش",
            "دوار جهينة",
            "دوامة",
            "سنيطة الرفاعيين",
            "سوادة",
            "الصالحية",
            "غزالة أبو عبدون",
            "قنتير",
            "كفر الأشقم",
            "كفر البلاسي",
            "كفر الحاج عمر",
            "كفر العدوي",
            "كفر العلماء",
            "كفر شاويش",
            "كفر كشك",
            "منزل نعيم",
            "منشأة القاضي",
            "منشأة نبهان",
            "ميت العز",
            "مدينة فاقوس"
        ];
        $parent = Location::where('name', 'فاقوس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المجاورة الاولي",
            "المجاورة الثانية",
            "المجاورة الثالثة",
            "المجاورة الرابعة",
            "مجاورة 5",
            "مجاورة 6",
            "مجاورة 7",
            "مجاورة 8",
            "مجاورة 9",
            "مجاورة 10",
            "مجاورة 11",
            "مجاور 12"
        ];
        $parent = Location::where('name', 'الصالحية الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحبش",
            "الحلوات",
            "الخضارية",
            "السدس",
            "الطرادية",
            "تل محمد",
            "شرقية مباشر",
            "طواحين أكراش",
            "قطيفة مباشر",
            "كفر أبو الديب",
            "كفر الجلايلة",
            "كفر الشرفا البحري",
            "كفر الشيخ داود",
            "كفر عوض سليمان",
            "كفر محسن",
            "كفور نجم",
            "مباشر",
            "منشأة التحرير",
            "مدينة الابراهيمية"
        ];
        $parent = Location::where('name', 'الابراهيميه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو عيد",
            "أكوة",
            "إكراش",
            "الجواشنه",
            "الصانية",
            "الصويني",
            "العصايد",
            "القطايع",
            "المجفف",
            "المناصافور",
            "الميساة",
            "الهوابر",
            "برمكيم",
            "تل القاضي",
            "حصة الرهبان",
            "شبرا صورة",
            "شنبارة منقلا",
            "شوبك أكراش",
            "صافور",
            "صفط زريق",
            "صهبرة",
            "طحا المرج",
            "فرغان",
            "قاويشة",
            "قرموط صهبرة",
            "كفر أبو بري",
            "كفر الباشا",
            "كفر الحاج حسن",
            "كفر العكل",
            "كفر اللبا",
            "كفر جنيدي",
            "مناحريت",
            "منشأة العطارين",
            "منشأة صفوت",
            "منشأة صهبرة",
            "منشأة عودة سالم",
            "منشأة قاسم",
            "منشأة كشك",
            "مدينة ديرب نجم",
            "ديرب السوق"
        ];
        $parent = Location::where('name', 'ديرب نجم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو الشقوق",
            "أبو حريز",
            "البوها",
            "الحوامدة",
            "الرباعيين",
            "الشرقاية",
            "الصورة",
            "الفرايين",
            "القضاة",
            "المنشأة الجديدة",
            "الموانسة",
            "الهجارسة",
            "تليجة",
            "حانوت",
            "سنجها",
            "شنيط الحرابوة",
            "شيط الهوى",
            "قراجة",
            "كفر أبو شرابية",
            "كفر الحديدي",
            "كفر السويركي",
            "كفر عبد الشهيد شنودة",
            "منشأة ابن العاص",
            "منشأة شلبي",
            "منشأة عبد اللطيف واكد",
            "منشأة يوسف منصور",
            "ناطورة",
            "نجوم",
            "مدينة كفر صقر",
            "كفر حماد"
        ];
        $parent = Location::where('name', 'كفر صقر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "إبراهيم حسن",
            "الصوفية",
            "بني عبس",
            "تلراك",
            "جزيرة مطاوع",
            "حمادة",
            "زور أبو الليل",
            "قصاصين الأزهار",
            "كفر الشوافين",
            "كفر الفرايحة",
            "منشأة الأمير",
            "منشية السادات",
            "مدينة أولاد صقر"
        ];
        $parent = Location::where('name', 'اولاد صقر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الأخيوة",
            "البكارشة",
            "الجمالية",
            "الحجازية",
            "الحماديين",
            "الصالحية الأبطال",
            "الصالحية الأحرار",
            "الصالحية البساتين",
            "الملكيين البحرية",
            "الملكيين القبلية",
            "المناجاة الصغرى",
            "المناجاة الكبرى",
            "الناصرية",
            "النجيحي",
            "بحر البقر",
            "جزيرة سعودي",
            "حصة المناصرة",
            "سماكين الشرق",
            "سماكين الغرب",
            "شهداء بحر البقر",
            "صان الحجر القبلية",
            "قصاصين الشرق",
            "قهبونة",
            "منشأة أبو عمر",
            "منشأة بشارة الطحاوي",
            "منشأة راغب الطحاوي",
            "منشأة مصطفى خليل",
            "منشية أبو عامر",
            "مدينة الحسينية"
        ];
        $parent = Location::where('name', 'الحسينيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        /*******
        End sharkeya
         *********/



        /*******
        Start gharbeya
         *********/


        $subs_cairo = [
            "طنطا",
            "كفر الزيات",
            "السنطة",
            "المحلة الكبرى",
            "بسيون",
            "زفتى",
            "سمنود",
            "قطور",
            "مناطق فرعية بالغربية"
        ];
        $parent = Location::where('name', 'الغربية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "مدينة طنطا",
            "أخناواى",
            "برما",
            "قرية دفرة",
            "قرية الرجدية",
            "قرية شوبر",
            "قرية شونى",
            "محلة مرحوم",
            "منوف",
            "السنطه",
            "الإستاد",
            "العجيزي",
            "سيجر"
        ] ;
        $parent = Location::where('name', 'طنطا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة كفر الزيات",
            "قرية أبو الغر",
            "قرية أبيار",
            "كفر الهلباوى",
            "قرية الدلجمون",
            "قرية كفور بلشاى",
            "قرية مشلة"
        ];
        $parent = Location::where('name', 'كفر الزيات')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة السنطة",
            "قرية أشناواى",
            "قرية الجعفرية",
            "قرية شبراقاص",
            "قرية القرشية",
            "قرية كفر كلا الباب",
            "قرية ميت الحواى",
            "منية طوخ",
            "بلكيم",
            "مسهلة",
            "كفر الحاج داود",
            "الانبوطين",
            "عزبة مبارك",
            "البندرة",
            "منية البندرة",
            "عزبة طوخ",
            "عزبة ابو عماد",
            "عزبة احمد صقر",
            "ميت الليت",
            "شبرا بيل",
            "ميت غزال",
            "كفر الشيخ مفتاح",
            "تطاى",
            "ابو الجهور",
            "البدنجانية",
            "الكرما"
        ];
        $parent = Location::where('name', 'السنطة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة المحلة الكبرى",
            "قرية بشبيش",
            "دمرو",
            "قرية شبرا بابل",
            "قرية الشهيدى",
            "قرية صفط تراب",
            "قرية العامرية",
            "محلة أبو على القنطرة",
            "قرية محلة حسن",
            "قرية المعتمدية",
            "قرية الهياتم",
            "السادات",
            "النصر",
            "محلة البرج",
            "أبو راضي",
            "منشية السلام",
            "محب",
            "سوق اللبن",
            "منشية خضر",
            "السبع بنات",
            "شكرى القوتلى",
            "مدينة بسيون",
            "قرية صان الحجر",
            "قرية قرنشو",
            "قرية كتامة الغابة",
            "قرية كفر المنشى أبو الحمر",
            "شارع الانتاج",
            "شارع مستشفى الصفوة",
            "شارع نعمان الاعصر",
            "السكي الوسطي",
            "شارع الترعة "
        ];
        $parent = Location::where('name', 'المحلة الكبرى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            'قرية مشال'
        ];
        $parent = Location::where('name', 'بسيون')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة زفتى",
            "قرية تفهنا العزب",
            "قرية سنباط",
            "قرية سندبسط",
            "قرية سنبو الكبرى",
            "قرية شبراملس",
            "قرية شرشابة",
            "قرية الغريب",
            "قرية نهطاى",
            "الضببشة",
            "السملاوية",
            "حنون",
            "كفر الدغايدة"
        ];
        $parent = Location::where('name', 'زفتى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة سمنود",
            "قرية أبو صير بنا",
            "قرية بنا أبو صير",
            "الراهبين",
            "قرية محلة زياد",
            "قرية ميت بدر حلاوة",
            "قرية ميت دمسيس"
        ];
        $parent = Location::where('name', 'سمنود')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة قطور",
            "قرية أبشواى الملق",
            "قرية بلتاج",
            "قرية دماط",
            "قرية شبرا نباص",
            "قرية الشين",
            "العمه",
            "نجريج",
            "صرد"
        ];
        $parent = Location::where('name', 'قطور')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End gharbeya
         *********/





        /*******
        Start ismaleya
         *********/


        $subs_cairo = [
            "مدينة الاسماعيلية",
            "فايد",
            "القنطره شرق",
            "القنطره غرب",
            "التل الكبير",
            "ابو صوير",
            "القصاصين",
            "مناطق فرعية بالاسماعيلية",
            "الاسماعيلية الجديدة",
            "حي الاسرة",
            "ارض الجمعيات",
            "ارض المزادات",
            "الدوحة",
            "قرية الجندول"
        ];
        $parent = Location::where('name', 'الاسماعيلية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الاسماعيلية",
            "عزبة ابو حسين",
            "متحف الشرطة",
            "شارع الأقصر",
            "شارع جرجا",
            "شارع الشرقية",
            "شارع دندرة",
            "شارع طنطا",
            "شارع المنيرة",
            "شارع وادي حلفه",
            "شارع الحلمية",
            "شارع الزقازيق",
            "شارع العريش",
            "شارع أنور السادات",
            "شارع النيل",
            "شارع قاروون",
            "شارع السانتا",
            "شارع ماروت",
            "شارع الإسكندرية",
            "شارع طارق بن زياد",
            "شارع حسين حجازي",
            "شارع قناة السويس",
            "شارع عثمان",
            "شارع المطرية",
            "شارع المدارس",
            "شارع المحلة",
            "شارع الشهيد عبد الصديق",
            "شارع عمرو بن العاص",
            "شارع الإمام علي",
            "شارع القاهرة",
            "شارع النخيل",
            "شارع يوليو-26",
            "شارع طريق الإسماعيلية",
            "شارع الزاهر",
            "شارع سيد مكاوي",
            "شارع محمد فوزي",
            "شارع المرحوم صالح عيد صالح",
            "شارع طريق الشهيد عبد المنعم رياض",
            "شارع عمر",
            "شارع طلعت حرب",
            "شارع مريم",
            "شارع المنوفية",
            "شارع الشهيد سيد ماري",
            "شارع المشير أحمد إسماعيل علي",
            "شارع الجيش",
            "شارع الشهيد أحمد مدحت عادل",
            "ميدان الجمهورية",
            "شارع أبو بكر الصديق",
            "شارع بنها",
            "شارع الشهيد السيد كامل",
            "شارع الشهيد محمد أحمد القاضي",
            "شارع الاسبتاليا",
            "شارع الثورة",
            "شارع القليوبية",
            "شارع التحرير",
            "شارع شبين",
            "شارع عدلي",
            "شارع أكتوبر-6",
            "شارع مارسيليا",
            "شارع فريد",
            "شارع عثمان بن عفان",
            "شارع مصعب بن عمير",
            "شارع حافظ إبراهيم",
            "شارع أم كلثوم",
            "شارع عباس العقاد",
            "شارع النجدة",
            "شارع أحمد صقر",
            "شارع خضر",
            "شارع التكنولوجيا",
            "شارع المتحف",
            "شارع الجراج",
            "شارع الشرف",
            "شارع أحمد شوقي",
            "شارع الترك",
            "شارع الشهيد حسن عبد العزيز",
            "شارع عبد الله فخري",
            "شارع الخليفة المأمون",
            "شارع معاذ بن جبل",
            "شارع طيار اسلام عبداللطيف",
            "شارع طريق أحمد أبو زيد",
            "شارع الشارع الجديد",
            "شارع البستان",
            "شارع عبد السلام عارف",
            "شارع أنس إبن النذير",
            "شارع عمر مكرم",
            "شارع أبو الهول",
            "شارع الأندية",
            "شارع الإذاعة والتلفزيون",
            "شارع الشروق",
            "الشارع السريع",
            "شارع الأمام مالك",
            "شارع السلام",
            "شارع أبو ذر الغفاري",
            "منطقة موظفي الحكومة",
            "شارع العدل",
            "شارع نجيب محفوظ",
            "شارع الزراعيين",
            "شارع العشرين",
            "شارع الشيخ زايد",
            "شارع نسيم الجزار",
            "شارع زمزم",
            "شارع سليمان الحلبي",
            "شارع رضا",
            "شارع سيناء",
            "شارع البحيرة",
            "شارع الجيزة",
            "شارع المنصورة",
            "شارع دمنهور",
            "شارع شريف",
            "شارع اسماعيل سري باشا",
            "شارع حسن درويش",
            "شارع سعد زغلول",
            "شارع الشهيد يحي الفولي",
            "شارع كليوبترا",
            "شارع النهضة",
            "شارع عمر بن الخطاب",
            "شارع صلاح سالم",
            "شارع رقم 6",
            "شارع عثمان أحمد عثمان",
            "شارع الجامعة",
            "شارع السودان",
            "شارع المروة",
            "شارع غريب أبو الرجال",
            "شارع سليمان عبد الحميد",
            "شارع أبو هريرة",
            "شارع الأطباء",
            "شارع محمد صبري مبدي",
            "شارع العاشر من رمضان",
            "شارع أبو حسين",
            "شارع الروضة",
            "شارع عبد الله النديم"
        ];
        $parent = Location::where('name', 'مدينة الاسماعيلية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "شارع مصطفي كامل",
            "شارع النادي",
            "شارع جمال عبد الناصر",
            "شارع السواحل",
            "شارع المهندسين",
            "شارع البوسطة",
            "شارع فريد ندي",
            "شارع فايد الجديده",
            "طريق المنياوي",
            "شارع التجاري",
            "شارع العبور",
            "شارع عمرو بن العاص"
        ];
        $parent = Location::where('name', 'فايد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        $items = [
            "شارع الصادق",
            "شارع عمار بن ياسر",
            "شارع كريم وجانا",
            "شارع الابراج - ارض الجمعيات"
        ];
        $parent = Location::where('name', 'ارض الجمعيات')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End ismaleya
         *********/





        /*******
        Start Demyat
         *********/


        $subs_cairo = [
            "مدينة دمياط",
            "مدينة دمياط الجديدة",
            "راس البر",
            "فارسكور",
            "كفر سعد",
            "الزرقا",
            "السرو",
            "الروضه",
            "كفر البطيخ",
            "عزبة البرج",
            "ميت ابو غالب",
            "مناطق فرعية بدمياط",
            "الشارع الحربي"
        ];
        $parent = Location::where('name', 'دمياط')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة دمياط",
            "الخياطة",
            "الجواهرة",
            "شط جريبة",
            "عزبة اللحم",
            "الشعراء",
            "عزبة العنانية",
            "السنانية",
            "عزب النهضة",
            "عزبة أولاد حمام",
            "الخليفة",
            "غيط النصارى",
            "شطا",
            "الشيخ درغام",
            "البصارطة",
            "البستان",
            "العدلية",
            "شط محب",
            "السيالة",
            "شارع الأعصر "
        ];
        $parent = Location::where('name', 'مدينة دمياط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "المنطقة الصناعية",
            "امتداد المنطقه الصناعية",
            "منطقة الشاليهات",
            "بيت الوطن",
            "منطقة القري السياحية",
            "الحي المتميز",
            "الحي الاكثر تميزا",
            "كمبوند في دمياط الجديدة",
            "المنطقة المركزية",
            "منطقة نوادي",
            "شارع الجامعة",
            "شارع جمال عبد الناصر",
            "طريق دمياط الجديدة"
        ];
        $parent = Location::where('name', 'مدينة دمياط الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة رأس البر",
            "صن ست ريزورت 1",
            "صن ست ريزورت 3",
            "صن ست ريزورت 4",
            "اس يو دي مول"
        ];
        $parent = Location::where('name', 'راس البر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة فارسكور",
            "الروضة",
            "الرحمنة",
            "أبو جريدة",
            "العزازمة",
            "العبيدية",
            "البراشية",
            "الغوابين",
            "كفر الغوابين",
            "الغنيمية",
            "الضهرة",
            "السالمية",
            "النجارين",
            "كفر العرب",
            "كفر الشناوى",
            "عزبة الناصرية",
            "عزبة كرم و مرزوق",
            "عزبة الأربعين",
            "الحورانى",
            "العطوى",
            "عزبة حجاجة",
            "ميت الشيوخ"
        ];
        $parent = Location::where('name', 'فارسكور')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة كفر سعد",
            "كفر سعد البلد",
            "النواصيرية",
            "كفر الغاب",
            "الدهايمة",
            "منشأة ناصر",
            "كفر الوسطانى",
            "البدراوى",
            "عزبة راشد",
            "المحمدية",
            "عزبة الابراهيمية القبلية",
            "تفتيش تانى",
            "كفر سليمان البحرى",
            "اللوزى",
            "السوالم",
            "كفر شحاتة",
            "عزبة دار السلام",
            "كفر المنازلة",
            "كفر ميت أبو غالب",
            "أم الرزق",
            "العباسية",
            "عزبة الابراهيمية البحرية",
            "كفر المرابعين الشرقية",
            "أبو عياد",
            "السعيدية البحرية",
            "السعيدية القبلية",
            "عزبة التوفيقية",
            "عزبة الاسماعيلية",
            "الحسينية"
        ];
        $parent = Location::where('name', 'كفر سعد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الزرقا",
            "ميت الخولى عبدالله",
            "شرمساح",
            "كفر تقى",
            "الزعاترة",
            "سيف الدين",
            "دقهلة",
            "عزبة على الباز",
            "كفر المياسرة",
            "الكاشف الجديد"
        ];
        $parent = Location::where('name', 'الزرقا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة كفر البطيخ",
            "المشايخ",
            "عزبة كحيل",
            "العوامر",
            "عزبة السواحل",
            "أم الرضا",
            "أم الرضا الجديدة",
            "الركابية",
            "الركابية الجديدة",
            "عزبة اللضامين",
            "جمصة",
            "جمصة الشرقية",
            "جمصة الغربية"
        ];
        $parent = Location::where('name', 'كفر البطيخ')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End Demyat
         *********/








        /*******
        Start seuis
         *********/


        $subs_cairo = [
            "مدينة السويس",
            "الاربعين",
            "عتاقة",
            "الجناين",
            "فيصل",
            "بور توفيق",
            "مدينة السويس الجديدة"
        ];
        $parent = Location::where('name', 'السويس')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة السويس",
            "حوض الدرس",
            "بورتوفيق",
            "شارع عبد الخالق ثروت",
            "شارع النادي",
            "شارع صلاح الدين",
            "شارع عمرو بن العاص",
            "شارع الشهداء",
            "شارع التحرير",
            "شارع الجمهورية",
            "شارع الانابيب",
            "طريق الشركات",
            "طريق المحاجر الدائري",
            "طريق الصفا",
            "شارع حافظ إبراهيم",
            "شارع خالد بن الوليد",
            "شارع النهضة",
            "طريق مصر للبترول",
            "منطقة شباب المثلث"
        ];
        $parent = Location::where('name', 'مدينة السويس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الاربعين",
            "السادات",
            "العبور",
            "الموشي",
            "الكويت",
            "منطقة 24 أكتوبر",
            "ايمان",
            "شارع الخواجة",
            "شارع اسامة",
            "شارع احمد عرابي",
            "طريق الإسماعيليه - السويس",
            "شارع النيل",
            "شارع يوليو-23",
            "شارع يعقوب",
            "شارع الدكتور أحمد ماهر"
        ];
        $parent = Location::where('name', 'الاربعين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مناطق فرعية بفيصل",
            "الحرفيين",
            "الصباح",
            "الأمل",
            "مبارك",
            "التعاوينات",
            "السلام",
            "النور",
            "الفردوس",
            "التوفيقية",
            "عرب المعمل"
        ];
        $parent = Location::where('name', 'فيصل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }





        /*******
        End seuis
         *********/




        /*******
        Start behera
         *********/


        $subs_cairo = [
            "دمنهور",
            "كفر الدوار",
            "رشيد",
            "ادكو",
            "أبو المطامير",
            "أبو حمص",
            "الدلنجات",
            "المحموديه",
            "الرحمانيه",
            "إيتاي البارود",
            "حوش عيسى",
            "شبراخيت",
            "كوم حمادة",
            "بدر",
            "وادي النطرون",
            "النوبارية الجديدة",
            "مناطق فرعية بالبحيرة"
        ];
        $parent = Location::where('name', 'البحيرة')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبعادية دمنهور",
            "أفلاقة",
            "البرنوجي",
            "البساتين",
            "الحمامية",
            "الشوكة",
            "الصفاصيف",
            "العمرية",
            "العوجا",
            "المخايض",
            "المنشية الإبراهيمية",
            "بسطرة",
            "بني هلال",
            "حفص",
            "دسونس أم دينار",
            "دنشال",
            "زاوية غزال",
            "زرقون",
            "زهرة البحرية",
            "زهرة القبلية",
            "سنطيس",
            "سنهور",
            "شرنوب",
            "طرابنبا",
            "عزب الأوقاف",
            "عزب سكندية",
            "عزب شبرا دمنهور",
            "عزب قابل",
            "عزبة الأبريقجي",
            "عزبة الدرويش",
            "عزبة السرو",
            "عزبة السلانكي",
            "عزبة بدر الدين",
            "عزبة بسطرة",
            "عزبة حسين عمرو",
            "عزبة طرابنبا",
            "عزبة محمد عوض",
            "قابيل",
            "قراقص",
            "كفر الحمايدة",
            "كفر سانطيس",
            "منشأة الحبشي",
            "منشأة الخزان",
            "منشأة المطران",
            "منشأة حمور",
            "منشأة راغب",
            "منشأة سعيد طوسون",
            "منشأة غربال",
            "منشأة محمد الوكيل",
            "منشأة نصار",
            "منشية الأوقاف",
            "منية بني موسى",
            "منية عطية",
            "نديبة",
            "عزبة سليم طوبجيان",
            "عزبة طرابنبا",
            "كفر سنطيس",
            "منشأة الأوقاف",
            "منية بنى موسى",
            "مدينة دمنهور",
            "عزب نقرها "
        ];
        $parent = Location::where('name', 'دمنهور')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الأمراء",
            "البسلقون",
            "البيضا",
            "التمامة",
            "الخضرة",
            "الطرح",
            "العالى",
            "العرقوب",
            "الكريون",
            "الكنايس",
            "الملقة",
            "النشوة البحرى",
            "النشو البحري",
            "الوسطانية",
            "زهرة",
            "سيدى غازى",
            "صيرة",
            "عزب دفشو",
            "قومبانية أبو قير",
            "قومبانية لوقين",
            "كنج عثمان",
            "كوم إشو",
            "كوم البركة",
            "كوم الطرفاية",
            "كوم دفشو",
            "لوقين",
            "معمل الزجاج",
            "منشأة الهلباوى",
            "منشأة بسيونى",
            "منشأة بلبع",
            "منشأة بولين",
            "منشأة عامر",
            "منشأة يونس",
            "شارع المحكمة"
        ];
        $parent = Location::where('name', 'كفر الدوار')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "إدفينا",
            "التفتيش",
            "الجدية",
            "الحماد",
            "الساحل",
            "الشماسمة",
            "العامرية الشرقية",
            "مدينة رشيد",
            "العامرية",
            "الكوم",
            "برج رشيد",
            "ديبى",
            "سيدى عمر",
            "محلة الأمير",
            "منشية علوان",
            "مدينة رشيد الجديدة"
        ];
        $parent = Location::where('name', 'رشيد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المعدية",
            "منشية دبونو",
            "مدينة إدكو"
        ];
        $parent = Location::where('name', 'ادكو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو المطامير البحرية",
            "الغيتة",
            "القطاع الشمالي",
            "المهدية",
            "النجيلي وأولاد الشيخ",
            "النمرية",
            "الياسينية",
            "تروجي",
            "زاوية سالم",
            "زاوية صقر",
            "قطاع غرب النوبارية",
            "كوم الفرج",
            "كوم القدح",
            "كوم حفين",
            "منشأة ثروت",
            "منشأة جناكليس",
            "منشأة علوية",
            "مدينة أبو المطامير"
        ];
        $parent = Location::where('name', 'أبو المطامير')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو الخذر",
            "الجرادات",
            "الجرن",
            "الحرفة",
            "الرزقة",
            "الزيني",
            "الشهيد جواد حسني",
            "الصخرة",
            "الغابة",
            "القروي",
            "النخلة البحرية",
            "برسيق",
            "بركة غطاس",
            "بسنتاواي",
            "بطورس",
            "بلقطر",
            "بلقطر الغربية",
            "دسونس الحلفاية",
            "ديرامس",
            "روضة خيري",
            "زاوية نعيم",
            "سحالي",
            "طلمبات حلق الجمل",
            "عزب أمين سيد أحمد",
            "قافلة",
            "كفر حصام",
            "كفر عزاز",
            "كوم القناطر",
            "محلة كيل",
            "منشأة الوكيل",
            "منشأة دميسنا",
            "مدينة أبو حمص"
        ];
        $parent = Location::where('name', 'أبو حمص')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو صمادة",
            "أبو مسعود",
            "أطلميس",
            "إبيا الحمراء",
            "البستان",
            "الحجر المحروق",
            "الخليلية",
            "الطيرية",
            "العلامية",
            "القاسي مطرود",
            "المسين",
            "المنشاوي اللحلاح",
            "المنشية الجديدة",
            "الوفائية",
            "اليوسيفية",
            "جزائر عيسى",
            "درشاي",
            "رزفة",
            "زاوية أبو شوشة",
            "زاوية حمور",
            "زاوية مسلم",
            "زمران النخل",
            "زهور الأمراء",
            "سعد داود",
            "طيبة",
            "مدينة الدلنجات",
            "عزبة حسين الديب"
        ];
        $parent = Location::where('name', 'الدلنجات')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "العطف",
            "اللوية",
            "دسيا الكنايس",
            "ديروط",
            "سرنباي",
            "سنابادة",
            "سيدى عقبة",
            "عزب بستناوى",
            "فزارة",
            "فيشا بلخة",
            "كفر إمليط",
            "كفر الرحمانية",
            "كفر نكلا",
            "منشأة أريمون",
            "منية السعيد",
            "نظارة الروضة",
            "نظارة السعيدية",
            "نظارة المسعدة"
        ];
        $parent = Location::where('name', 'المحموديه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو خراش",
            "الأبريقجي",
            "البكوات",
            "القهوقية",
            "كفر الجديد",
            "المجد",
            "بويط",
            "جرجس نخلة",
            "حسن قبودان",
            "درشابة",
            "سماديس",
            "سمخراط",
            "كفر الشيخ حسن",
            "كفر غنيم",
            "كفر محلة داود",
            "محلة ثابت",
            "محلة داود",
            "منية سلامة",
            "نظارة الإنشاء",
            "نظارة المنشية",
            "نظارة المنيا",
            "نظارة بويط",
            "مدينة الرحمانية"
        ];
        $parent = Location::where('name', 'الرحمانيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أثريات فاضل",
            "أرمانية",
            "إبراك حمام",
            "إشليمة",
            "إمليط",
            "الإبراهيمية",
            "البهي",
            "التوفيقية",
            "الحوتة",
            "الخوالد",
            "الدرملية",
            "الروقة",
            "الشعيرة",
            "الضهرية",
            "العوامر",
            "العيون",
            "النبيرة",
            "النقراش",
            "برقامة",
            "تلبانة",
            "جبارس البحرية",
            "جبارس القبلية",
            "جعيف",
            "جنبواي",
            "حصة الضهرية",
            "حوض فارس",
            "خمارة",
            "دقدوقة",
            "دميسنا",
            "راضي",
            "ربع شنديد",
            "رمسيس",
            "زبيدة",
            "شبرا النونة",
            "ششت الأنعام",
            "شنديد",
            "صافية",
            "صفط الحرية",
            "صفط خالد",
            "طلعت",
            "ظهر التمساح",
            "قادوس",
            "قليشان",
            "كفر أبو مندور",
            "كفر الحاجة",
            "كفر السقا",
            "كفر الشيخ مخلوف",
            "كفر الغابة",
            "كفر خليفة",
            "كفر عسكر شنديد",
            "كفر عسكر صفط",
            "كفر عوانة",
            "كفر مساعد",
            "كفور السوالم بحري",
            "كفور السوالم قبلي",
            "كنيسة الضهرية",
            "محلة عبيد",
            "محلة عبيد الوسطانية",
            "معنيا",
            "منشأة الصيرفي",
            "منشأة النصر",
            "منية بني منصور",
            "نكلا العنب",
            "يوسف العسكري",
            "مدينة أيتاى البارود"
        ];
        $parent = Location::where('name', 'إيتاي البارود')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو الشقاف",
            "الأبقعين",
            "الحرفة",
            "الرزيمات",
            "الستمائة",
            "القرنين",
            "الكردود",
            "الكوم الأخضر",
            "حرارة",
            "شلتوت",
            "قرى الخريجين",
            "كفر الواق",
            "منشأة خياط",
            "مدينة حوش عيسى"
        ];
        $parent = Location::where('name', 'حوش عيسى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبتوك",
            "أبو السحما",
            "أبو درة",
            "أبو منجوج",
            "أبو يحيى",
            "أم حكيم",
            "أورين",
            "إمري",
            "اسمانية",
            "الاصلاب",
            "الدفراوى",
            "الربدان",
            "المناشلة",
            "جزيرة نكلا",
            "زمزم",
            "شبراريس",
            "عزبة عباس",
            "عزبة أبراهيم أغا",
            "عزبة الأشراك",
            "عزبة الجوخدار",
            "عزبة الدفراوى",
            "عزبة الرجايبة ",
            "عزبة الشماشرجي",
            "عزبة الكنيسة",
            "عزبة بشارة حنا",
            "عزبة سعادة",
            "عزبة فتح الله الجزار",
            "عزبة فرنوى",
            "عزبة كفر السابي",
            "عزبة يعقوب",
            "عزبة يوسف كمال",
            "فرنوى",
            "كفر الدفراوى",
            "كفر الصناديدى",
            "كفر خضير",
            "كفر عثمان",
            "كفر قشقاش",
            "كفر مستنان",
            "كنيسة أورين",
            "لقانة",
            "محلة بشر",
            "محلة صا",
            "محلة فرنوى",
            "محلة قيس",
            "محلة نصر",
            "منشأة أبو هنا",
            "منشأة أبو حنا",
            "منشأة رزافة",
            "منشأة أوقاف لقانة",
            "منشية حمادة"
        ];
        $parent = Location::where('name', 'شبراخيت')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبسوم الشرقية",
            "أبسوم الغربية",
            "أبو الخاوى",
            "أبيوقا",
            "ابراهيمية مهنا",
            "الإيمان",
            "البلاكوس",
            "الهيدين",
            "الداخلى",
            "الزعفرانى",
            "السخنة",
            "الصواف",
            "الطود",
            "الطرية",
            "القلاوات",
            "النجيلة",
            "النقيدي",
            "بريم",
            "بولين الفوايد",
            "بيبان",
            "تلبقا",
            "خربتا",
            "خنيزة",
            "دست الأشراف",
            "دمتيو",
            "دمشلى",
            "زاوية البحر",
            "زاوية خنيزة",
            "زاوية مبارك",
            "سرسيقة",
            "شابور",
            "شبرا أوسيم",
            "صفط العنب",
            "عبد المجيد موسى",
            "عرب الدالى",
            "عزبة حسن على حمزة",
            "علقام",
            "قرى الخريجين",
            "كفر العيص",
            "كفر بولين",
            "كفر دمتيوه",
            "كفر زيادة",
            "كفرسلامون",
            "كفر غانم",
            "كفرعزين",
            "كفر مجاهد",
            "كوم شريك",
            "محلة أحمد",
            "مصطفى كامل",
            "مغنين",
            "مليحة بريم",
            "منشأة أبو راية",
            "منشأة الشوربجي",
            "منشأة راضى",
            "منشأة على مهنا",
            "ميت يزيد",
            "نتما"
        ];
        $parent = Location::where('name', 'كوم حمادة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو بكر الصديق",
            "أحمد عرابي",
            "أم صابر",
            "التل الكبير",
            "الخرطوم",
            "العزيمة",
            "الفالوجا",
            "الكفاح",
            "المجد",
            "المعركة",
            "النجاح",
            "بغداد",
            "حراء",
            "خالد بن الوليد",
            "صلاح الدين",
            "عبد الحميد أبو زيد",
            "عبد السلام عارف",
            "عثمان بن عفان",
            "علي بن أبي طالب",
            "عمر شاهين",
            "عمر مكرم",
            "عين جالوت",
            "فلسطين",
            "نبيل الوقاد",
            "مناطق فرعية بمدينة بدر",
            "عمر بن الخطاب"
        ];
        $parent = Location::where('name', 'بدر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "بنى سلامة",
            "الجعار",
            "الحمراء",
            "كفر داود"
        ];
        $parent = Location::where('name', 'وادي النطرون')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المنطقة السكنية الاولي",
            "المنطقة السكنية الثانية",
            "ابني بيتك"
        ];
        $parent = Location::where('name', 'النوبارية الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End behera
         *********/






        /*******
        Start aswan
         *********/


        $subs_cairo = [
            "مدينة اسوان",
            "مدينة اسوان الجديدة",
            "دراو",
            "كوم امبو",
            "نصر النوبه",
            "كلابشه",
            "ادفو",
            "الرديسيه",
            "السباعيه",
            "ابو سمبل",
            "مناطق فرعية بأسوان",
            "توشكي الجديدة"
        ];
        $parent = Location::where('name', 'أسوان')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "قرية ابو الريش بحرى",
            "قرية ابو الريش قبلى",
            "قرية الاعقاب",
            "قرية بهريف",
            "قرية غرب اسوان",
            "قرية الكوبانية",
            "قرية وادى العلاقى",
            "مدينة أسوان"
        ];
        $parent = Location::where('name', 'مدينة اسوان')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي السياحي",
            "فيلات الممشي السياحي",
            "كورنيش اسوان الجديدة"
        ];
        $parent = Location::where('name', 'مدينة اسوان الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "الشطب",
            "المنصورية",
            "بنبان قبلى",
            "الجعافرة",
            "مدينة دراو"
        ];
        $parent = Location::where('name', 'دراو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "قرية سلوا بحرى",
            "قرية العباسية",
            "قرية المنشية الجديدة",
            "قرية كفور كوم امبو",
            "قرية حجازة",
            "قرية اقليت",
            "قرية فارس",
            "مدينة كوم أمبو"
        ];
        $parent = Location::where('name', 'كوم امبو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "قرية بلانة",
            "قرية المالكى",
            "قرية ابوسمبل",
            "قرية الدكة",
            "قرية عنيبة",
            "قرية قورته",
            "قرية ابوهور",
            "قرية وادى النقرة",
            "مدينة نصر النوبة"
        ];
        $parent = Location::where('name', 'نصر النوبه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        $items = [
            "أبو سعد",
            "البراسي",
            "الحبارى",
            "الحجز بحري",
            "الحصايا",
            "الرمادي بحري",
            "الرمادي قبلي",
            "الريديسية بحري",
            "الزنيقة",
            "الشجيرة عامرة",
            "الصعايدة بحري",
            "الصيلية قبلي",
            "الطوناب",
            "الغوالية",
            "الفقرا",
            "الكرابلة فوق",
            "الكلح شرق",
            "المريناب",
            "دار الهنا",
            "قرية البحيرة",
            "نجع أبو عرفة",
            "نجع الحقنة",
            "نجع الدومارية",
            "نجع الدومة",
            "نجع الشهيد",
            "نجع الشيخ على",
            "نجع الكيال",
            "نجع المفالسة",
            "نجع مشالى",
            "نجع هارون",
            "نجع هلال",
            "وادي الريديسية",
            "وادي الصعايدة",
            "وادي عبادي",
            "مدينة ادفو"
        ];
        $parent = Location::where('name', 'ادفو')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        /*******
        Start aswan
         *********/




        /*******
        Start luxor
         *********/


        $subs_cairo = [
            "مدينة الاقصر",
            "الاقصر الجديدة",
            "مدينة طيبة الجديدة",
            "الزينيه",
            "البياضيه",
            "القرنه",
            "ارمنت",
            "الطود",
            "اسنا",
            "مناطق فرعية بالأقصر"
        ];
        $parent = Location::where('name', 'الاقصر')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الزينية بحري",
            "الصعايدة",
            "العشي",
            "المدامود",
            "مدينة الزينية",
            "الزينيه قبلي"
        ];
        $parent = Location::where('name', 'الزينيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "البغدادى",
            "الحبيل",
            "مدينة البياضية"
        ];
        $parent = Location::where('name', 'البياضيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "البعيرات",
            "الضبعية",
            "الغربي قمولا",
            "القبلي قمولا",
            "مدينة القرنة"
        ];
        $parent = Location::where('name', 'القرنه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الديمقراط",
            "الرزيقات القبلية",
            "الرزيقات بحري",
            "الريانية",
            "المحاميد البحرية",
            "المحاميد القبلية",
            "أرمنت"
        ];
        $parent = Location::where('name', 'ارمنت')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "العديسات",
            "العديسات القبلية",
            "المريس",
            "مدينة طود"
        ];
        $parent = Location::where('name', 'الطود')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أصفون",
            "الترعة",
            "الحلة",
            "الحميدات",
            "الديابية",
            "الدير",
            "الشغب",
            "العضايمة",
            "الغريرة",
            "القرايا",
            "الكلابية",
            "المساوية",
            "المعلة",
            "النجوع قبلي",
            "النمسا",
            "الهنادي",
            "توماس وعافية",
            "جزيرة راجح",
            "طفنيس",
            "كومير",
            "كيمان المطاعنة",
            "الدمقراط",
            "الرزيقات القبلية",
            "مدينة إسنا"
        ];
        $parent = Location::where('name', 'اسنا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End luxor
         *********/





        /*******
        Start Asioud
         *********/


        $subs_cairo = [
            "مدينة اسيوط",
            "مدينة اسيوط الجديدة",
            "ديروط",
            "منفلوط",
            "القوصيه",
            "ابنوب",
            "ابو تيج",
            "الغنايم",
            "ساحل سليم",
            "البدارى",
            "صدفا",
            "مناطق فرعية بأسيوط",
            "محور هضبة أسيوط الغربية",
            "نيوم أسيوط - المطورون العرب",
            "مدينة المعلمين",
            "تقسيم الحقوقيين",
            "مدينة ناصر الجديدة"
        ];
        $parent = Location::where('name', 'أسيوط')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد إبراهيم",
            "أولاد رايق",
            "أولاد علي",
            "البورة",
            "الزاوية",
            "الشغبة",
            "العدر",
            "المطيعة",
            "النمايسة",
            "الهدايا",
            "بني حسين",
            "بني غالب",
            "بهيج",
            "درنكة",
            "دير درنكة",
            "شارع العدلي",
            "شارع تقسيم الطرابيشي",
            "شارع مكة المكرمة",
            "شارع عبد اللطيف",
            "شارع الجلاء",
            "شارع الأمين",
            "شارع عثمان بن عفان",
            "شارع سيد خشبه",
            "ميدان أكتوبر-6",
            "شارع أحمد علي علوبة",
            "شارع تقسيم الخياط 2",
            "شارع الرشيدي",
            "شارع اسلام محمد جمال",
            "شارع ميتياس",
            "شارع الساحل",
            "شارع قباء",
            "شارع جمال عبد الناصر",
            "شارع النزهة",
            "شارع محمد عباس",
            "شارع الحكمدار",
            "شارع الشامية",
            "شارع عطفة الدبغ",
            "شارع التجنيد",
            "شارع أبو بكر الصديق",
            "شارع الجمهورية",
            "شارع المأمون",
            "شارع جودة الأسدي",
            "شارع ممتاز نصار",
            "شارع الإمام علي",
            "شارع تقسيم البترول",
            "شارع الزبير بن العوام",
            "شارع عمر بن عبد العزيز",
            "شارع تقسيم البترول",
            "شارع أبو طويلة",
            "شارع الهلالي",
            "شارع الخلفاء",
            "شارع الزراعيين",
            "شارع جمال ثابت",
            "شارع مكرم الله",
            "شارع الضرائب",
            "شارع المهندسين",
            "شارع عمرو إبن العاص",
            "شارع شكري عبد الخالق",
            "شارع محمود رشوان",
            "حارة خالد فوزي",
            "شارع فاروق كدواني",
            "شارع وبور النور",
            "شارع تقسيم الكاسان رقم 2",
            "شارع كيدواني",
            "شارع نجيب الريحاني",
            "شارع مديرية الزراعة",
            "حارة شعبان",
            "شارع تقسيم الامريكان",
            "حارة العلماء",
            "شارع خلف المساكن",
            "شارع عمر بن الخطاب",
            "شارع البان بركه",
            "شارع خالد بن الوليد",
            "شارع عمار",
            "شارع الصواف",
            "شارع مديرية الامن",
            "شارع العسال",
            "شارع المنقبادي",
            "شارع خضر",
            "شارع الحداد",
            "شارع المنار",
            "شارع قاسم أمين",
            "شارع رياض",
            "حارة مسجد السلام",
            "شارع عمر إبن عبد العزيز",
            "حارة أحمد الشريف",
            "شارع الإمام المنصور",
            "شارع الحرية",
            "شارع الثورة",
            "شارع المعتصم بالله",
            "شارع رفاعي",
            "شارع رمضان 10",
            "شارع ميدان أم البطل",
            "شارع المنشاوي",
            "شارع حشكل",
            "شارع الإمام علي بن أبي طالب",
            "شارع عمر عبد الله",
            "شارع أحمد بهاء الدين",
            "حارة العين",
            "طريق ترعة عبد الله",
            "شارع سوق الست",
            "شارع سوق الغله",
            "شارع ادولف ماكر",
            "شارع كورنيش النيل - الثورة",
            "شارع نزية خليفة",
            "شارع المشير أحمد إسماعيل",
            "شارع علوه النصاره",
            "شارع أبو سعده",
            "شارع مدينة كربيت",
            "شارع الأوقاف",
            "حارة شاكر",
            "شارع ممتاز",
            "شارع السادات",
            "تقسيم توفيق شارع رقم 1",
            "شارع الحرمين",
            "شارع المساحة",
            "شارع ضرب الحدادين",
            "شارع سيدي عبد الرحيم القناوي",
            "شارع عبد المنعم رياض",
            "شارع النصر",
            "شارع المحافظة",
            "شارع ضرب العجيل",
            "شارع الشادر",
            "شارع يوليو 23",
            "شارع الظافر",
            "شارع بريد الحمراء",
            "درب الحنفي",
            "شارع جسر الصليبه الحمراء",
            "شارع ناصر",
            "شارع اسلام محمد",
            "شارع فهمي النقراشي",
            "شارع الفردوس",
            "شارع الإمام مالك",
            "شارع التدريب المهني",
            "درب طنبور",
            "شارع طه حنفي",
            "شارع أحمد الهلالي",
            "شارع ابو النور",
            "طريق البيسري",
            "شارع محمد جمال عبد الناصر",
            "حارة خشبة",
            "شارع حارة الرشيدي",
            "شارع النميس - صلاح الدين الأيوبي",
            "درب بدوي",
            "شارع عزت جلال",
            "شارع توفيق خشبة",
            "شارع عمر إبن الخطاب",
            "شارع إسماعيل القباني",
            "شارع فرحات معوض",
            "شارع سيري",
            "شارع المصري",
            "شارع أبو تيج - النخيلة",
            "شارع مصطفي عبد الرازق",
            "شارع سلامه حجازي",
            "شارع قوم باهيج",
            "شارع مساكن النزله القبلي",
            "شارع كليوبترا",
            "شارع تقسيم الكاسان رقم 1",
            "شارع حبيب باشا شنوده",
            "شارع الجامع الكببير",
            "شارع العبور",
            "حارة الساعاتي",
            "شارع محمد عبد العزيز",
            "شارع أمين عثمان",
            "شارع الشيخ صالح",
            "شارع عزبة أبو القاسم",
            "شارع 26 يوليو",
            "شارع منشية الامراء",
            "شارع طبونه ابو ضوح",
            "شارع المحكمة القديم",
            "شارع جمعية المحافظه علي القران",
            "شارع أحمد عبد الله",
            "شارع غرب السكة الحديد",
            "شارع مدرسة النوتردام",
            "شارع عباس محمود العقاد",
            "حارة عرفة",
            "شارع سعد زغلول",
            "شارع المسيد",
            "شارع أحمد سيد",
            "درب العجمي",
            "شارع الجعفرية",
            "طريق الببسيري",
            "شارع الصاغة",
            "شارع الشهيد محمد رشاد زياد (فريد سابقا)",
            "درب خلاصة",
            "شارع الشهيد اللواء أحمد كامل",
            "طريق القصر",
            "شارع صبري",
            "شارع الدب الكبير",
            "حارة البدري",
            "شارع جلال عفيفي محمود",
            "شارع السلام",
            "شارع فلسطين",
            "شارع خوفو",
            "شارع جلال الدين الأفغاني",
            "شارع الملك سيتي الأول",
            "حارة النزهة",
            "شارع المنتزه",
            "شارع ثابت",
            "حارة الملجأ",
            "شارع اسامه مصطفي",
            "شارع عثمان بن عفان",
            "شارع الجيش",
            "شارع عدلي يكن",
            "شارع النهضه",
            "شارع عيسي كرم عيسي",
            "شارع الشهيد فتحي السيوفي",
            "شرق مسجد الفتح",
            "شارع محمد علي مكارم",
            "حارة المنياوي",
            "حارة تقسيم الجندي",
            "شارع احمد مرسي",
            "شارع كوثر",
            "شارع الشهيد كمال إبراهيم",
            "شارع الفداء",
            "شارع البرنس",
            "شارع القيسارية الرئيسي",
            "شارع البركة",
            "شارع نور الدين",
            "شارع عبد العزيز",
            "شارع الشيخ مرزوق",
            "شارع الجباني",
            "شارع النيل",
            "شارع الشوني",
            "شارع محمد حسنين",
            "شارع الأثرية الأولي",
            "شارع محمد فريد",
            "شارع نفق الزهراء",
            "شارع الإمام محمد عبده",
            "شارع توت عنخ آمون",
            "حارة الكويس",
            "شارع الخازندار",
            "حارة مطعم الشعب",
            "شارع الفسطاط",
            "شارع شركة اليوسفي",
            "شارع النور و الأمل",
            "شارع الخياط",
            "شارع سعد بديري",
            "شارع الانسانيه",
            "شارع الشيخ فايق أبو المعالي",
            "شارع إمام الجوزي",
            "امتداد شارع برعي راغب",
            "شارع عنتر",
            "الوليدية"
        ];
        $parent = Location::where('name', 'مدينة اسيوط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "كمبوند أصايله - مباني ادريس",
            "منطقة شمال الجامعة",
            "حي رجال الاعمال",
            "ابني بيتك المرحلة الثانية",
            "ابني بيتك المرحلة الرابعة",
            "ابني بيتك المرحلة الاولي",
            "ابني بيتك المرحلة الخامسة",
            "حي الزهور",
            "الاسكان العائلي 1",
            "الاسكان العائلي 2",
            "الاسكان العائلي 3",
            "اسكان المستقبل",
            "مدينة الرحاب",
            "الإسكان المتميز",
            "بيت الوطن",
            "منطقة الفيلات",
            "منطقة العمارات",
            "كابيتال مول - داون تاون"
        ];
        $parent = Location::where('name', 'مدينة اسيوط الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو الهدر",
            "أبو كريم",
            "أمشول",
            "الحوطا الشرقيه",
            "الحوطا الغربية",
            "الرياض",
            "الشراقوة",
            "المحمودية",
            "المطاوعة",
            "المناشي",
            "المندرة بحري",
            "النهاية",
            "بانوب ظهر الجمل",
            "باويط",
            "ببلاو",
            "بني يحيى بحري",
            "جرف سرحان",
            "خارفة",
            "دشلوط",
            "ديروط الشريف",
            "زاوية هارون",
            "ساو",
            "سرقنا",
            "شلش",
            "صنبو",
            "عرامية الخضيري",
            "عواجة",
            "ديروط"
        ];
        $parent = Location::where('name', 'ديروط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أم القصور",
            "الحواتكة",
            "السهريج",
            "العتامنة",
            "العزبة",
            "المدور",
            "المندرة قبلي",
            "بني رافع",
            "بني سند",
            "بني شعران",
            "بني شقير",
            "بني عديات",
            "بني مجد",
            "جحدم",
            "جزيرة المعابدة البحرية",
            "دمنهور",
            "سراوة",
            "سكرة",
            "عرب العمايم",
            "قريه السهريج",
            "كوم الشهيد",
            "كوم بوها قبلي",
            "نزة قرار",
            "نزلة رميح",
            "منفلوط"
        ];
        $parent = Location::where('name', 'منفلوط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو خليل",
            "الأنصار",
            "التتالية",
            "التمساحية",
            "الحبالصة",
            "الحرادنة",
            "السراقنا",
            "الشيخ داود",
            "الشيخ عون الله",
            "الصبحة",
            "المنشأة الصغرى",
            "المنشأة الكبرى",
            "بلوط",
            "بني إدريس",
            "بني زيد بوق",
            "بني صالح",
            "بني قرة",
            "بني هلال",
            "بني يحيى قبلي",
            "بوق",
            "تناغة",
            "دير القصير",
            "رزقة الدير المحرق",
            "عرامية الديوان",
            "عرب الجهمة",
            "عنك",
            "فزاره",
            "قصير العمارنة",
            "منشأة خشبة",
            "مير",
            "نزالي جانوب",
            "قوص"
        ];
        $parent = Location::where('name', 'القوصيه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحمام",
            "السوالم البحرية",
            "العوامر",
            "المعابدة الشرقية",
            "المعابدة الغربية",
            "بني إبراهيم",
            "بني محمديات",
            "دير شو",
            "سوالم أبنوب",
            "شقلقيل",
            "عرب الشنابلة",
            "عرب العطيات البحرية",
            "كوم أبو شبل",
            "كوم المنصورة",
            "نزلة القداديح",
            "أبنوب"
        ];
        $parent = Location::where('name', 'ابنوب')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو خرص",
            "البلايزة",
            "الزرابي",
            "الزيرة",
            "القادمة",
            "الزيرة",
            "المسعودي",
            "النخيلة",
            "باقور",
            "بني سميع",
            "دكران",
            "دوينة",
            "نزلة باقور",
            "نزلة دوينة",
            "أبو تيج"
        ];
        $parent = Location::where('name', 'ابو تيج')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "العامري",
            "العزايزة",
            "المشايعة",
            "المشايعة قبلي",
            "دير الجنادلة",
            "نزلة أولاد محمد",
            "نزلة القديم",
            "الغنايم"
        ];
        $parent = Location::where('name', 'الغنايم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "التناغة",
            "الخوالد",
            "الرويجات",
            "الشامية",
            "العفادرة",
            "العونة",
            "الغريب",
            "المطمر",
            "النزلة المستجدة",
            "بويط",
            "تاسا",
            "دير تاسا",
            "عزبة الورد",
            "نزلة الشيخ شحاتة",
            "نزلة الملك",
            "نزلة باخوم",
            "ساحل سليم"
        ];
        $parent = Location::where('name', 'ساحل سليم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "البياضية",
            "الشيخ عتمان",
            "العتمانية",
            "العقال بحري",
            "العقال قبلي",
            "الكوم الأحمر",
            "المراونة",
            "النواميس",
            "النواورة",
            "الهمامية",
            "طعمة",
            "عزبة الأقباط",
            "كوم سعدة",
            "منشأة البداري",
            "منشأة العقال",
            "منشأة همام",
            "نجع جزيرة فاو",
            "نجع زريق",
            "نجوع المعادي",
            "البدارى"
        ];
        $parent = Location::where('name', 'البدارى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد إلياس",
            "البارود شرق",
            "البارود غرب",
            "البربا",
            "البلق",
            "الدوير",
            "الشناينة",
            "الوعاضلة",
            "بني فيز",
            "كردوس",
            "كوم أبو حجر",
            "كوم إسفحت",
            "كوم سعيد الغربي",
            "كيمان سعيد الشرقي",
            "مجريس",
            "نجوع السدادرة",
            "صدفا"
        ];
        $parent = Location::where('name', 'صدفا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End Asioud
         *********/





        /*******
        Start menouf
         *********/


        $subs_cairo = [
            "شبين الكوم",
            "مدينة السادات",
            "منوف",
            "سرس الليان",
            "اشمون",
            "الباجور",
            "قويسنا",
            "بركة السبع",
            "تلا",
            "الشهداء",
            "مناطق فرعية بالمنوفية",
            "مدينة المنوفية"
        ];
        $parent = Location::where('name', 'المنوفية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "إصطباري",
            "البتانون",
            "الكوم الأخضر",
            "عزبة أبو سمك",
            "بخاتي",
            "شبرا باص",
            "منشأة الشريكين",
            "منشأة عصام",
            "شنوان",
            "المصيلحة",
            "مليج",
            "مدينة شبين الكوم",
            "شارع الجلاء البحري"
        ];
        $parent = Location::where('name', 'شبين الكوم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المنطقة 1",
            "المنطقة 2",
            "المنطقة 3",
            "المنطقة 4",
            "المنقطة 5",
            "المنطقة 6",
            "المنطقة 7",
            "المنقطة 8",
            "المنطقة 9",
            "المنطقة 10",
            "المنطقة 11",
            "المنطقة 12",
            "المنطقة 13",
            "المنطقة 14",
            "المنطقة 15",
            "المنطقة 16",
            "المنطقة 17",
            "المنطقة 18",
            "المنطقة 19",
            "المنطقة 20",
            "المنطقة 21",
            "المنطقة 22",
            "المنطقة 23",
            "المنطقة 24",
            "المنطقة 25",
            "المنطقة 26",
            "المنطقة 27",
            "المنطقة 28",
            "المنطقة 29",
            "المنطقة 30",
            "المنطقة 31",
            "المنطقة 32",
            "المنطقة 33",
            "المنطقة 34",
            "المنطقة 35",
            "المنطقة 36",
            "حي الكوثر",
            "حي النرجس",
            "الاسكان الاجتماعي",
            "الحي المتميز",
            "حي النور",
            "حي الروضة",
            "شارع ابو بكر الصديق",
            "شارع طه حسين",
            "شارع عبد المنعم رياض",
            "تروفال مول - عقار جروب",
            "فيوتشر بيزنس بارك - عقار جروب",
            "كوينز سنتر - عقار جروب",
            "ميديكال بارك مول - عقار جروب",
            "المنطقة الصناعية",
            "ابني بيتك",
            "منطقة ال 2000 فدان"
        ];
        $parent = Location::where('name', 'مدينة السادات')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "برهيم",
            "الحامول",
            "بهواش",
            "دمليج",
            "زاوية رزين",
            "سدود",
            "كفر السنابسة",
            "طملاي",
            "فيشا الكبرى",
            "كفر فيشا الكبرى",
            "تتا",
            "سنجرج",
            "غمرين",
            "منشأة سلطان",
            "مدينة منوف"
        ];
        $parent = Location::where('name', 'منوف')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو رقبة",
            "أبو عوالي",
            "الأنجب",
            "البرانية",
            "الخور",
            "الغنامية",
            "الفرعونية",
            "القناطرين",
            "الكوادي",
            "النعناعية",
            "براشيم",
            "جريس",
            "دروة",
            "دلهمو",
            "رملة الأنجب",
            "ساقية أبو شعرة",
            "ساقية المنقدي",
            "سبك الأحد",
            "سمادون",
            "سملاي",
            "سنتريس",
            "سهواج",
            "شعشاع",
            "شما",
            "شنشور",
            "شنواي",
            "شوشاي",
            "صراوة",
            "طليا",
            "طهواي",
            "قورص",
            "كفر أبو رقبة",
            "كفر أبو محمود",
            "كفر الحما",
            "كفر السيد",
            "كفر الطراينة",
            "كفر الغريب",
            "كفر الفرعونية",
            "كفر صراوة",
            "كفر قورص",
            "كفر منصور",
            "كوم عياد",
            "لبيشة",
            "مؤنسة",
            "مجيريا",
            "محلة سبك",
            "منشأة جريس",
            "منيل دويب",
            "منيل عروس",
            "مدينة أشمون"
        ];
        $parent = Location::where('name', 'اشمون')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أبشيش",
            "اسطنها",
            "تلبنت أبشيش",
            "ميت الوسطى",
            "أسريجة",
            "الكتامية",
            "بهناي",
            "بير شمس",
            "كفر محمود",
            "أبو سنيطة",
            "بي العرب",
            "كفر الغنامية",
            "كفر سنجلف القديم",
            "تلوانة",
            "قلتى الكبرى",
            "جروان",
            "زاوية جروان",
            "شبرا زنجي",
            "أبخاص",
            "البرانقة",
            "القرينين",
            "سبك الضحاك",
            "كفر القرينين",
            "كفر سبك",
            "منشأة سيف",
            "فيشا الصغرى",
            "كفر سنجلف الجديد",
            "سنجلف",
            "كفر الباجور",
            "الخضرة",
            "سمان",
            "كفر الخضرة",
            "العطف",
            "مسجد الخضر",
            "مشيرف",
            "منشأة مسجد الخضر",
            "ميت البيضا",
            "الأطارشة",
            "المقاطع",
            "المنشأة الجديدة",
            "كفر مناوهلة",
            "كوم الضبع",
            "مناوهلة",
            "الجزيرة الشرقية",
            "كفر الدوار",
            "ميت عفيف",
            "مدينة الباجور"
        ] ;
        $parent = Location::where('name', 'الباجور')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أبشيش",
            "اسطنها",
            "تلبنت أبشيش",
            "ميت الوسطى",
            "أسريجة",
            "الكتامية",
            "بهناي",
            "بير شمس",
            "كفر محمود",
            "أبو سنيطة",
            "بي العرب",
            "كفر الغنامية",
            "كفر سنجلف القديم",
            "تلوانة",
            "قلتى الكبرى",
            "جروان",
            "زاوية جروان",
            "شبرا زنجي",
            "أبخاص",
            "البرانقة",
            "القرينين",
            "سبك الضحاك",
            "كفر القرينين",
            "كفر سبك",
            "منشأة سيف",
            "فيشا الصغرى",
            "كفر سنجلف الجديد",
            "سنجلف",
            "كفر الباجور",
            "الخضرة",
            "سمان",
            "كفر الخضرة",
            "العطف",
            "مسجد الخضر",
            "مشيرف",
            "منشأة مسجد الخضر",
            "ميت البيضا",
            "الأطارشة",
            "المقاطع",
            "المنشأة الجديدة",
            "كفر مناوهلة",
            "كوم الضبع",
            "مناوهلة",
            "الجزيرة الشرقية",
            "كفر الدوار",
            "ميت عفيف",
            "مدينة الباجور"
        ] ;
        $parent = Location::where('name', 'قويسنا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو مشهور",
            "شنتنا الحجر",
            "طوخ طنبشا",
            "كفر هلال",
            "هورين",
            "مدينة بركة السبع"
        ];
        $parent = Location::where('name', 'بركة السبع')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "بابل",
            "زاوية بمم",
            "صفط جدام",
            "طوخ دلكة",
            "كفر عسكر",
            "كفر السكرية",
            "مدينة تلا"
        ];
        $parent = Location::where('name', 'تلا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }





        /*******
        End menouf
         *********/





        /*******
        Start qena
         *********/


        $subs_cairo = [
            "مدينة قنا",
            "قنا الجديدة",
            "ابو طشت",
            "نجع حمادى",
            "دشنا",
            "الوقف",
            "قفط",
            "نقاده",
            "قوص",
            "فرشوط",
            "مناطق فرعية بقنا",
            "حوض 10"
        ];
        $parent = Location::where('name', 'قنا')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الأشراف البحرية",
            "الأشراف الشرقية",
            "الأشراف القبلية",
            "الترامسة",
            "الجبلاو",
            "الحجيرات",
            "الدير",
            "الدير الشرقي",
            "الشيخ عيسى",
            "الصالحية",
            "الطوابية",
            "الطويرات",
            "العسلية",
            "القناوية",
            "الكلاحين",
            "المخادمة",
            "مدينة قنا"
        ];
        $parent = Location::where('name', 'مدينة قنا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "المنطقة السياحية والترفيهية",
            "إسكان متميز"
        ];
        $parent = Location::where('name', 'قنا الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الأوسط سمهود",
            "البحري سمهود",
            "الحبيلات الغربية",
            "الحسانات",
            "الخوالد",
            "الرزقة",
            "الرفشة",
            "الرواتب",
            "الزرائب",
            "السليمات",
            "الشرقي سمهود",
            "الشقيفي",
            "العمرة",
            "العوامر وبني برزة",
            "القارة",
            "القلعية",
            "الكرنك",
            "النجمة والحمران",
            "بني برزة",
            "جزيرة الدوم",
            "سمهود",
            "عزبة البوصة",
            "قصير بخانس",
            "كوم جابر",
            "كوم يعقوب",
            "مدينة أبو تشت"
        ];
        $parent = Location::where('name', 'ابو طشت')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد نجم القبلية",
            "أولاد نجم بهجورة",
            "البوصة",
            "الحفناوية",
            "الحلفاية بحري",
            "الحلفاية قبلي",
            "الدرب",
            "الرئيسية",
            "الرحمانية قبلي",
            "السلمية الحايط",
            "السمانية",
            "الشاورية",
            "الشرقي بهجورة",
            "الصياد",
            "الغربي بالسلمية",
            "القصر",
            "القمانة",
            "المصالحة",
            "حمرة دوم",
            "نجع الشيخ نور الدين",
            "هو",
            "مدينة نجع حمادى"
        ];
        $parent = Location::where('name', 'نجع حمادى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو مناع بحري",
            "أبو مناع شرق",
            "أبو مناع قبلي",
            "السمطا بحري",
            "الصبريات",
            "العزب",
            "العطيات",
            "فاو بحري",
            "فاو غرب",
            "فاو قبلي",
            "نجع الشيخ علي",
            "نجع سعيد",
            "ديشنا",
            "مدينة ديشنا"
        ];
        $parent = Location::where('name', 'دشنا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الظافرية",
            "العويضات",
            "الكلاحين",
            "اللقيطة",
            "بير عنبر",
            "مدينة قفط"
        ];
        $parent = Location::where('name', 'قفط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الزوايدة",
            "دنفيق",
            "مدينة نقادة"
        ];
        $parent = Location::where('name', 'نقاده')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحمر والجعافرة",
            "الخرانقة",
            "العقب",
            "العليقات",
            "العيايشة",
            "الكراتية",
            "الكلالسة",
            "المخزن",
            "المسيد",
            "المعري",
            "المفرجية",
            "المقارين",
            "المقربية",
            "جراجوس",
            "جزيرة مطيرة",
            "حجازة بحري",
            "حجازة قبلي",
            "خزام",
            "مدينة قوص"
        ];
        $parent = Location::where('name', 'قوص')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "القبيبة",
            "الكوم الأحمر",
            "رفاعة",
            "كوم البجا",
            "نجع الحاج سلام",
            "مدينة فرشوط"
        ];
        $parent = Location::where('name', 'فرشوط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }




        /*******
        End qena
         *********/





        /*******
        Start sohag
         *********/


        $subs_cairo = [
            "مدينة سوهاج الجديدة",
            "اخميم",
            "مدينة أخميم الجديدة",
            "البلينا",
            "المراغه",
            "المنشأة",
            "دار السلام",
            "جرجا",
            "جهينة",
            "ساقلته",
            "طما",
            "طهطا",
            "مناطق فرعية بسوهاج",
            "العسيرات",
            "مدينة سوهاج",
            "حي الكوثر"
        ];
        $parent = Location::where('name', 'سوهاج')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي السادس",
            "الحي الخامس",
            "الحي السابع"
        ];
        $parent = Location::where('name', 'مدينة سوهاج الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "آبار الملك",
            "آبار الوقف",
            "الأحايوة شرق",
            "الحواويش",
            "الديابات",
            "السلاموني",
            "الصوامعة شرق",
            "العزبة والعرب",
            "العيساوية شرق",
            "الكولة",
            "جزيرة محروس",
            "عرب الأطاولة",
            "نجوع الصوامعة شرق",
            "نيدة",
            "مدينة أخميم"
        ];
        $parent = Location::where('name', 'اخميم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد عليو",
            "الإصلاح",
            "الباسكية",
            "التوادر",
            "الحبيل والشلولية",
            "الحجز",
            "الحرجة بالقرعان",
            "الحرجة بحري",
            "الحرجة قبلي",
            "الحلافي",
            "الساحل بحري",
            "الساحل قبلي",
            "السلماني",
            "السمطا",
            "الشيخ بركة",
            "الشيخ مرزوق",
            "العساكرة",
            "العوكلية",
            "الغابات",
            "الغنيمية",
            "الوحليه الكبيره",
            "برديس",
            "بني حلوه",
            "بني حميل",
            "بني منصور",
            "عرابة أبيدوس",
            "منشأة برديس",
            "نجع مازن غرب",
            "نجوع برديس",
            "يعقوب",
            "مدينة البلاينة"
        ];
        $parent = Location::where('name', 'البلينا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو عزيز",
            "أولاد إسماعيل",
            "إقصاص",
            "البطاخ",
            "الجزازرة",
            "الحريدية",
            "السمارنة",
            "الشيخ شبل",
            "الشيخ يوسف",
            "العمور",
            "الغريزات",
            "الوقدة",
            "باصونة",
            "بناويط",
            "بني هلال",
            "بني وشاح",
            "بهاليل الجزيرة",
            "بهتة",
            "جزيرة الشورانية",
            "ساقلتة والعرب",
            "شندويل",
            "عامر",
            "فزارة",
            "نجع طايع",
            "مدينة المراغة"
        ];
        $parent = Location::where('name', 'المراغه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد سلامة",
            "أولاد علي",
            "الباجية",
            "البواريك",
            "البياضية بالناظر",
            "الحريزات الشرقية",
            "الخنانسة",
            "الخنانسة غرب",
            "الدناقلة",
            "الدويرات",
            "الرويهب",
            "الزارة",
            "الزوك الشرقية",
            "الزوك الغربية",
            "السقرية",
            "الشواولة",
            "العمايدة",
            "العنبرية",
            "الكوامل قبلي",
            "الهماص",
            "جزيرة المنتصر",
            "خارفة المنشأة",
            "روافع العيساوية",
            "كوم بدار",
            "مدينة المنشأة"
        ];
        $parent = Location::where('name', 'المنشأة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد الشيخ",
            "أولاد خلف",
            "أولاد خليفة",
            "أولاد سالم بحري",
            "أولاد سالم قبلي",
            "أولاد طوق غرب",
            "أولاد يحيى",
            "أولاد يحيى الحاجر",
            "أولاد يحيى بحري",
            "أولاد يحيى قبلي",
            "البلابيش",
            "البلابيش بحري",
            "البلابيش قبلي",
            "الخيام",
            "العقارية",
            "الكشح",
            "النصيرات",
            "النغاميش",
            "مزاتة شرق",
            "نجوع مازن شرق",
            "نقنق",
            "مدينة دار السلام"
        ];
        $parent = Location::where('name', 'دار السلام')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "البربا",
            "البياضي",
            "الجواهين",
            "الخلافية",
            "الذنقور",
            "الرقاقنة",
            "الزواتنة البحرية",
            "الزواتنة القبلية",
            "العوامر بحري",
            "العوامر قبلي",
            "القرعان",
            "المجابرة",
            "المحاسنة",
            "المحاسنه الغربيه",
            "المشاودة",
            "بندار التبينات",
            "بندار الرملية",
            "بندار الشرقية",
            "بني عيش",
            "بيت الخريبي",
            "بيت خلاف",
            "بيت داود سهل",
            "بيت علام",
            "خارفة جرجا",
            "كوم أشكيلو",
            "كوم الصعايدة",
            "مزاتة",
            "نجع الغباشي",
            "نجع رمضان",
            "نجع رمضان بندار",
            "نجوع بندار",
            "مدينة جرجا"
        ];
        $parent = Location::where('name', 'جرجا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو بكر الصديق",
            "الحرافشة",
            "الشهيد عبد المنعم رياض",
            "الطليحات",
            "النزة البحرية",
            "جهينة الشرقية",
            "عثمان بن عفان",
            "علي بن أبي طالب",
            "عمر بن الخطاب",
            "عنيبس",
            "نزة",
            "نزة الحاجر",
            "نزة المحزمين",
            "نزلة علي"
        ];
        $parent = Location::where('name', 'جهينة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الجلاوية",
            "الحرادنة",
            "الرياينة بالحاجر",
            "الرياينة بالكتكاتة",
            "الطوايل الشرقية",
            "الطوايل الغربية",
            "العوامية",
            "الفراسية",
            "القرامطة شرق",
            "الكتكافه",
            "بني واصل",
            "جزيره الدهب",
            "سفلاق",
            "فاوجلي",
            "نجع حامد",
            "نجوع الرياينة",
            "نجوع بني واصل"
        ];
        $parent = Location::where('name', 'ساقلته')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أم دومة",
            "الاغانة",
            "التحرير",
            "الجباب",
            "الحديقة",
            "الحسامدة",
            "الحسنة",
            "الحلاقي",
            "الحما",
            "الرياينة المعلق",
            "السعادة",
            "السكساكة",
            "الشوكة",
            "الشيخ عمار",
            "العتامنة",
            "العزبة المستجدة",
            "القرية بالدوير",
            "القطنة",
            "المدمر",
            "المواطين",
            "الهيشة",
            "الواقات",
            "تل الزوكي",
            "جزيرة طما",
            "سلامون",
            "سليم",
            "عزبة الفاوية",
            "قاو غرب",
            "كوم أشقاو",
            "كوم العرب",
            "كوم غريب",
            "مشطا",
            "نزلة الدويك",
            "نزلة عبد الله"
        ];
        $parent = Location::where('name', 'طما')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الجبيرات",
            "الجريدات",
            "الحريدية البحرية",
            "الحريدية القبلية",
            "الخزندارية",
            "السوالم",
            "الشيخ رحومة",
            "الشيخ زين الدين",
            "الشيخ مسعود",
            "الصفيحة",
            "الصوالح",
            "الصوامعة غرب",
            "القبيصات",
            "الكوم الأصفر",
            "بنجا",
            "بنهو",
            "بني حرب",
            "بني عمار",
            "جزيرة الخزندارية",
            "حاجر مشطا",
            "خلوة محفوظ",
            "داود",
            "ساحل طهطا",
            "شطورة",
            "عرب بخواج",
            "كوم بدر",
            "نجوع الصوامعة غرب",
            "نزلة القاضي",
            "نزلة عمارة"
        ];
        $parent = Location::where('name', 'طهطا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أولاد بهيج",
            "أولاد جبارة",
            "أولاد حمزة",
            "الأحايوة غرب",
            "الرشايدة"
        ];
        $parent = Location::where('name', 'العسيرات')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        Start sohag
         *********/






        /*******
        Start shamal
         *********/


        $subs_cairo = [
            "العريش",
            "الشيخ زويد",
            "رفح",
            "بئر العبد",
            "الحسنه",
            "نخل",
            "مناطق فرعية بشمال سيناء",
            "مدينة شمال سيناء"
        ];
        $parent = Location::where('name', 'شمال سيناء')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة العريش",
            "المساعيد",
            "ضاحية السلام",
            "الريسة",
            "الفواخرية",
            "الصفا",
            "كرم أبو نجيلة",
            "أبى صقل",
            "السلايمة",
            "السمران",
            "ال أيوب",
            "عاطف السادات",
            "وسط المدينة",
            "العبور",
            "الزهور",
            "الميدان",
            "السكاسكة",
            "الطويل",
            "السبيل"
        ];
        $parent = Location::where('name', 'العريش')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الشيخ زويد",
            "أبو طويلة",
            "الجورة",
            "العكور",
            "الزوارعة",
            "الظهير",
            "أبو العراج",
            "الشلاق",
            "المقاطعة",
            "الخروبة",
            "التومة",
            "القريعة",
            "قبر عمير",
            "أبو الفيتة",
            "السكادرة"
        ];
        $parent = Location::where('name', 'الشيخ زويد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة رفح",
            "أبو شنار",
            "المطلة",
            "الحسينات",
            "الخرافين",
            "الوفاق",
            "الطايرة",
            "المهدية",
            "نجع شبانة",
            "جوز أبو رعد",
            "البرث"
        ];
        $parent = Location::where('name', 'رفح')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة بئر العبد",
            "التعمير",
            "الغزلان",
            "العرايشية",
            "المستشفى",
            "الدواغرة",
            "الزوايدة",
            "العمارين",
            "وسط البلد",
            "الروضة",
            "التلول",
            "السالمانه",
            "السادات",
            "النجاح",
            "الخربة",
            "النصر",
            "رمانة",
            "نجيلة",
            "السلام",
            "أم عقبة",
            "اقطية",
            "قاطية",
            "الجناين",
            "المريح",
            "رابعه",
            "الكرمه",
            "6 اكتوبر",
            "الشهداء",
            "الاحرار",
            "الشوحط",
            "بالوظة",
            "الشيخ زايد"
        ];
        $parent = Location::where('name', 'بئر العبد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الحسنة",
            "الجدى",
            "الحمة",
            "الجفجافة",
            "الريسان",
            "الغرقدة",
            "المغارة",
            "المفارق",
            "المنجم",
            "بغداد",
            "اقرية",
            "المليز",
            "وادى العمرو",
            "الوفاء",
            "القسيمة",
            "المغفر",
            "المقضبة",
            "ام قطف",
            "أم شيحان",
            "بئر بدر",
            "عرب بلى",
            "الطاسة"
        ];
        $parent = Location::where('name', 'الحسنه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة نخل",
            "رأس النقب",
            "الكونتيلا",
            "سدر الحيطان",
            "التمد",
            "بئر جريد",
            "الخفجة",
            "البروك",
            "النتيلة",
            "عين طويبه",
            "السلام"
        ];
        $parent = Location::where('name', 'نخل')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }




        /*******
        End shamal
         *********/









        /*******
        Start fayoum
         *********/


        $subs_cairo = [
            "مدينة الفيوم",
            "الفيوم الجديدة",
            "طاميه",
            "سنورس",
            "اطسا",
            "ابشواى",
            "يوسف الصديق",
            "مناطق فرعية بالفيوم",
            "قحافة"
        ];
        $parent = Location::where('name', 'الفيوم')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أبجيج",
            "أبو السعود",
            "البسيونية",
            "الحادقة",
            "الحميدية الجديدة",
            "السنباط",
            "الصالحية",
            "العامرية",
            "العدوة",
            "العزب",
            "العلم",
            "الكيمان",
            "اللاهون",
            "المندرة",
            "الناصرية",
            "بني صالح",
            "تلت",
            "دسيا",
            "دمشقين",
            "دمو",
            "زاوية الكرداسة",
            "سنوفر",
            "سيلا",
            "كفور الشيخ فضل",
            "كفور النيل",
            "منشأة الجزائر",
            "منشأة العشيري",
            "منشأة الفيوم",
            "منشأة بغدادي",
            "منشأة عبد الله",
            "منشأة فتيح",
            "منشأة كمال",
            "منشية سكران",
            "نزلة الحريشي",
            "نزلة بشير",
            "هوارة المقطع",
            "هوارة عدلان",
            "مناشى الخطيب",
            "مدينة الفيوم",
            "منشأة لطف الله"
        ] ;
        $parent = Location::where('name', 'مدينة الفيوم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "المنطقة السياحية",
            "منطقة الامتداد الجنوبي",
            "المنطقة الاقليمية",
            "منطقة الامتداد الشمالي",
            "عمارات الاسكان الاجتماعي",
            "إبني بيتك"
        ];
        $parent = Location::where('name', 'الفيوم الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو طالب",
            "البراني",
            "الجمهورية",
            "الروبيات",
            "الروضة",
            "العزيزية",
            "الفهمية",
            "الكومي",
            "المظاطلي",
            "المقاتلة",
            "دار السلام",
            "سرسنا",
            "فانوس",
            "فرقص",
            "قصر رشوان",
            "كفر عميرة",
            "كفر محفوظ",
            "معصرة صاوي",
            "منشأة الدكتور الجمال",
            "هوجمين",
            "مدينة طامية"
        ];
        $parent = Location::where('name', 'طاميه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبهيت الحجر",
            "الأخصاص",
            "التوفيقية",
            "الزاوية الخضراء",
            "السعيدية",
            "السيليين",
            "الكعابي الجديدة",
            "الكعابي القديمة",
            "بهمو",
            "ترسا",
            "جبلة",
            "جرفس",
            "سنهور البحرية",
            "سنهور القبلية",
            "فديمين",
            "كفر فزارة",
            "مطر طارس",
            "منشأة الدكم",
            "منشأة السادات",
            "منشأة بني عثمان",
            "منشأة سنورس",
            "منشأة طنطاوي",
            "منشأة عطيفة",
            "نقاليفة",
            "مدينة سنورس"
        ];
        $parent = Location::where('name', 'سنورس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو جندير",
            "أبو دفية",
            "أبو صير دفنو",
            "الجعافرة",
            "الحامدية",
            "الحجر",
            "الحسينية",
            "السعدة",
            "العتامنة",
            "العوفي",
            "الغابة",
            "الغرق",
            "الغرق قبلي",
            "القاسمية",
            "المحمودية",
            "المنيا",
            "الونايسة",
            "بحر أبو المير",
            "تطون",
            "جردو",
            "خلف",
            "دانيال",
            "شدموه",
            "عزبة قلمشاة",
            "عنك",
            "قصر الباسل",
            "قلمشاة",
            "قلهانة",
            "كفر الزعفراني",
            "كفور حشمت",
            "مطول",
            "معجون",
            "معصرة عرفة",
            "منشأة المير",
            "منشأة حلفة",
            "منشأة ربيع",
            "منشأة رحمي",
            "منشأة رمزي",
            "منشأة سيف النصر",
            "منشأة صبري",
            "مدينة اطسا"
        ];
        $parent = Location::where('name', 'اطسا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو دنقاش",
            "أبو كساه",
            "الجيلاني",
            "الخالدية",
            "العجميين",
            "العلوية",
            "النصارية",
            "زيد ",
            "سنرو البحرية",
            "سنرو",
            "شكشوك",
            "طبهار",
            "طحاوي",
            "قصر بياض",
            "كفر عبود",
            "منشأة هويدي",
            "مدينة ابشوى"
        ];
        $parent = Location::where('name', 'ابشواى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحامولي",
            "الشواشنة",
            "الصعايدة القبلية",
            "المشرك القبلية",
            "المقراني",
            "النزلة",
            "بطن أهريت",
            "جاب الله ميزار",
            "رواق",
            "شعلان",
            "علي باشا الروبي",
            "غيطان المشرك",
            "قارون",
            "قصر أبو لطيعة باسل",
            "قصر الجبالي",
            "كحك",
            "وادي الريان",
            "مدينة يوسف الصديق"
        ];
        $parent = Location::where('name', 'يوسف الصديق')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End fayoum
         *********/





        /*******
        Start port saied
         *********/


        $subs_cairo = [
            "مدينة بور سعيد",
            "بور فؤاد",
            "مناطق فرعية في بور سعيد",
            "كمبوند في بور سعيد",
            "بورتكس",
            "بور سعيد الجديدة"
        ];
        $parent = Location::where('name', 'بور سعيد')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة بورسعيد",
            "حى الشرق",
            "حى الجنوب",
            "حى الضواحى",
            "حى المناخ",
            "حى الزهور",
            "حى العرب",
            "أبراج المحروسة"
        ];
        $parent = Location::where('name', 'مدينة بور سعيد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "كمبوند بورتو سعيد - عامر جروب",
            "كمبوند داون تاون - ذا وتر واي",
            "كمبوند إيكلا - نيو بلان"
        ];
        $parent = Location::where('name', 'كمبوند في بور سعيد')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "المنطقة السياحية الاولي",
            "المنطقة السياحية الثانية",
            "المنطقة السياحية الثالثة",
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الثامن",
            "الحي التاسع",
            "الحي العاشر",
            "الحي الحادي عشر",
            "الحي الثاني عشر"
        ];
        $parent = Location::where('name', 'بور سعيد الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        /*******
        End port saied
         *********/








        /*******
        Start kafr el shaikh
         *********/


        $subs_cairo = [
            "مدينة كفر الشيخ",
            "دسوق",
            "فوه",
            "مطوبس",
            "بلطيم",
            "الحامول",
            "بيلا",
            "الرياض",
            "سيدى سالم",
            "قلين",
            "سيدى غازى",
            "برج البرلص",
            "مناطق فرعية بكفر الشيخ",
            "تقسيم القضاه",
            "الصوالحه",
            "عزبة الشمارقة",
            "تقسيم 2"
        ];
        $parent = Location::where('name', 'كفر الشيخ')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "محلة موسى",
            "متبول",
            "كفر متبول",
            "أسحاقة",
            "اريمون",
            "الحمرا",
            "دقلت",
            "مسير",
            "الحمراوى",
            "الخادمية",
            "أبعادية الروضة",
            "أدريجة",
            "البخانيس",
            "مدينة كفر الشيخ",
            "الحلاقى",
            "الخضيرى",
            "الشمارقة",
            "الطايفة",
            "الطرابية",
            "القرضا",
            "الكفر الجديد",
            "المرابعين",
            "النطاف",
            "حليس",
            "دفرية",
            "دقميرة",
            "رزقة الشناوى",
            "رزقة امامى",
            "روينة",
            "سيدى غازى",
            "شنو",
            "صندلا",
            "قراجة",
            "كفر أبو طبل",
            "كفر دفرية",
            "كفر عسكر",
            "محلة القصب",
            "منية مسير",
            "نصرة",
            "منشأة الصفا",
            "عزبة مصطفى كامل"
        ];
        $parent = Location::where('name', 'مدينة كفر الشيخ')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة دسوق",
            "شباس الشهداء",
            "محلة دياى",
            "منية جناح",
            "كفر الخير",
            "أبو مندور",
            "المندرة",
            "النوايجة",
            "محلة أبو علي",
            "كفر ابراهيم",
            "الابراهيمية",
            "منشأة زعلوك",
            "كفر السودان",
            "كفر العرب",
            "ديرشابة",
            "كفر أبو زيادة",
            "شابة",
            "الشباسية",
            "كنيسة الصرادوسى",
            "دمرو سليمان",
            "منشأة على اغا",
            "لاصفير البلد",
            "أبيوقا",
            "كفر مجر",
            "دمنكة",
            "الصافية",
            "العجوزين",
            "كفر عبد الرحمن",
            "الشون",
            "أبطو",
            "شباس الملح",
            "محلة مالك",
            "الزوامل"
        ];
        $parent = Location::where('name', 'دسوق')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة فوة",
            "قبريط",
            "منية الأشراف",
            "الفتوح",
            "عزبة العريان",
            "سنديون",
            "شمشيرة",
            "أبو دراز"
        ];
        $parent = Location::where('name', 'فوه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة مطوبس",
            "برج مغيزل",
            "عزب الوقف القبلى",
            "منية المرشد",
            "عزب الخليج بحرى",
            "بنى بكار",
            "القنى",
            "القومسيون شرق",
            "القومسيون غرب",
            "عزبة عمرو",
            "برنبال",
            "عزب الغرب",
            "عزبة البرادعة"
        ];
        $parent = Location::where('name', 'مطوبس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الحامول",
            "قرية الزعفران",
            "كوم الحجر",
            "قطاع منصور",
            "الابعادية البحرية",
            "الزعفران",
            "قطاع الحامول",
            "الكفر الشرقى",
            "عزبة المناوفة",
            "كوم السحايت"
        ];
        $parent = Location::where('name', 'الحامول')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة بيلا",
            "ابشان",
            "العلامية",
            "كوم الحجنة",
            "دار السلام",
            "عزبة البياض",
            "الكوم الطويل",
            "الكراكات",
            "عمارة",
            "الناصرية",
            "كفر الجرايدة",
            "الشطوط",
            "كفر القتة",
            "كفر العجمى",
            "عزبة الحوة",
            "أبو بدوى",
            "عزبة حاذق",
            "الهمة",
            "عزبة أبو مرزوق"
        ];
        $parent = Location::where('name', 'بيلا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الرياض",
            "كوم أبو رية",
            "قرية أبو مصطفى",
            "البرية",
            "الحصفة",
            "الرصيف",
            "قرية الرغامة",
            "الضبعة",
            "العاقولة",
            "العمدان",
            "قرية المثلث",
            "الوزيرية",
            "بقلولة",
            "عزبة فرج الشامى",
            "منشأة سلامة",
            "عزبة أم سن الفوقانية",
            "البشاير"
        ];
        $parent = Location::where('name', 'الرياض')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة سيدى سالم",
            "عزبة أبو غنيمة",
            "عزبة عبد الجواد عليوة",
            "عزبة أبو أحمد",
            "كوم الخوالد",
            "عزبة كوم الخوالد",
            "الحدادى",
            "الروضة",
            "الصالحات",
            "الفقهاء البحرية",
            "الفقهاء القبلية",
            "القصابى",
            "الهندسة",
            "الورق",
            "برية لاصفير",
            "تيدة",
            "دمرو",
            "سد خميس",
            "شالمة",
            "كفر المشارقة",
            "منشأة أبو على",
            "منشأة المصرى",
            "منشأة عباس",
            "منشأة عقل",
            "العيسوية",
            "عزبة البلابسة",
            "شارع إبن طولون",
            "شارع سيدي جابر",
            "شارع بدر",
            "شارع طارق إبن زياد",
            "شارع جمال عبد الناصر",
            "شارع الجيش",
            "شارع الإستراحة",
            "شارع خالد إبن الوليد",
            "شارع الشرطة",
            "شارع جلال الشرقاوي",
            "شارع الكواكب",
            "شارع إبن سينا",
            "شارع محمد علي الشيخ",
            "شارع بور سعيد",
            "شارع البحر",
            "شارع القطان",
            "شارع عمران",
            "شارع الفتح",
            "شارع عبد الهادي",
            "شارع حافظ بدوي",
            "شارع طريق نايف",
            "شارع الجلاء",
            "شارع عمر المختار",
            "شارع محمد كريم",
            "شارع رشيد",
            "شارع الكورنيش",
            "شارع مجلس المدينة",
            "طريق العلمين",
            "شارع الساحل",
            "شارع الحرية",
            "شارع البنك الأهلي",
            "شارع رفاعة الطهطاوي",
            "شارع أحمد شوقي",
            "شارع عمرو إبن العاص",
            "شارع القادسية",
            "شارع السادات",
            "شارع الجمهورية",
            "شارع أم كلثوم",
            "شارع زويل",
            "شارع مصر الجديده",
            "عطفة خلوان",
            "شارع حداد",
            "شارع السويس",
            "شارع مصطفي كامل",
            "شارع العمال",
            "شارع المحكمة",
            "شارع محمد سامي عيد",
            "شارع القادسية",
            "شارع الشهيد باسم عطية",
            "شارع يوليو-23",
            "شارع الحسين"
        ];
        $parent = Location::where('name', 'سيدى سالم')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة قلين",
            "البكاتوش",
            "الشقة",
            "الغنيمى",
            "الكردى",
            "الكفر البحرى",
            "المنشأة الصغرى",
            "المنشأة الكبرى",
            "المنشلين",
            "بلنكومة",
            "حصة الغنيمى",
            "شباس عمير",
            "صروة",
            "طويلة نشرت",
            "قزمان",
            "قونة",
            "كفر الجزائر",
            "كفر المرازقة",
            "كفر المشايخ",
            "كفر يوسف حنس",
            "منشأة الشاذلى",
            "منشأة شبراطو",
            "كوم بليدة",
            "منية قلين",
            "ميت الديبة",
            "منشأة عجلان",
            "نشرت"
        ];
        $parent = Location::where('name', 'قلين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة سيدى غازى",
            "دقميرة",
            "كفر المرابعين",
            "نصرة"
        ];
        $parent = Location::where('name', 'سيدى غازى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة برج البرلس",
            "البرج",
            "البنائين",
            "الحماد",
            "الربع",
            "بلوش الساحل البحرى",
            "الساحل القبلى",
            "الشهابية",
            "الشيخ مبارك",
            "العياش",
            "أولاد سعيد",
            "البكرية",
            "الوهابية",
            "العنابرة",
            "أولاد نصير",
            "المطارقة",
            "أبو سليمان",
            "عزبة أبو عميرة الشرقية"
        ];
        $parent = Location::where('name', 'برج البرلص')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        /*******
        End kafr el shaikh
         *********/






        /*******
        Start beni suif
         *********/
        $subs_cairo = [
            "مدينة بني سويف",
            "مدينة بني سويف الجديدة",
            "الواسطى",
            "ناصر",
            "اهناسيا",
            "ببا",
            "سمسطا",
            "الفشن",
            "مناطق فرعية ببني سويف",
            "مدينة الفشن الجديدة"
        ];
        $parent = Location::where('name', 'بني سويف')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أفوة",
            "أهناسيا الخضراء",
            "إبشنا",
            "إهوه",
            "الحكامنة",
            "الحلابية",
            "الدوالطة",
            "الدوية",
            "الزرابي",
            "الكوم الأحمر",
            "باروط",
            "باها العجوز",
            "بلفيا",
            "بني بخيت",
            "بني حمد",
            "بني رضوان",
            "بني سليمان الشرقية",
            "بني عفان",
            "بني هارون",
            "بياض العرب",
            "تزمنت الشرقية",
            "تزمنت الغربية",
            "دموشيا",
            "رياض",
            "منشأة حيدر يكن",
            "منشأة عاصم",
            "منقريش",
            "شريف",
            "نزلة السعادنة",
            "مدينة بنى سويف",
            "شارع السلام "
        ];
        $parent = Location::where('name', 'مدينة بني سويف')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الأول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "ابني بيتك 1",
            "محور الاتحاد",
            "محور المستقبل",
            "طريق القاهرة بني سويف الصحراوي",
            "محور الشباب",
            "محور النصر",
            "محور الياسمين"
        ];
        $parent = Location::where('name', 'مدينة بني سويف الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أبو صير الملق",
            "أبويط",
            "أطواب",
            "أنفسط",
            "إفوة",
            "الحومة",
            "الديابية",
            "المصلوب",
            "الميمون",
            "النواميس",
            "الهرم",
            "بني حدير",
            "بني سليمان",
            "بني غنيم",
            "بني محمد",
            "بني نصير",
            "جزيرة المساعدة",
            "جزيرة النور",
            "زاوية المصلوب",
            "صفط الشرقية",
            "صفط الغربية",
            "عطف إفوة",
            "قمن العروس",
            "كفر أبجيج",
            "كفر بني عثمان",
            "كوم أبو راضي",
            "كوم أدريجة",
            "معصرة أبو صير",
            "منشأة أبو صير",
            "ميدوم",
            "نزلة الجنيدي",
            "ونا القس",
            "مدينة الواسطى"
        ] ;
        $parent = Location::where('name', 'الواسطى')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أشمنت",
            "البرج",
            "الحرجة",
            "الحمام",
            "الرياض",
            "المنصورة",
            "بني خليفة",
            "بهيشين",
            "جزيرة أبو صالح",
            "دلاص",
            "دنديل",
            "طحا بوش",
            "طنسا الملق",
            "غيط البحري",
            "كفر الجزيرة",
            "كوم أبو خلاد",
            "منشأة الشركة",
            "منشأة هديب",
            "مدينة ناصر"
        ];
        $parent = Location::where('name', 'ناصر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أدراسية",
            "البهسمون",
            "الشوبك",
            "العواونة",
            "المسيد الأبيض",
            "النويرة",
            "براوة الوقف",
            "بني هاني",
            "بهنموه",
            "دير براوة",
            "سدمنت الجبل",
            "شرهي",
            "قاي",
            "قلة",
            "قلها",
            "كفر أبو شهبة",
            "كوم الرمل البحري",
            "معصرة نعسان",
            "منشأة الأمراء",
            "منشأة البديني",
            "منشأة الحاج",
            "منشأة طاهر",
            "منشأة عبد الصمد",
            "منشأة كساب",
            "منهرة",
            "منهرو",
            "منيل غيضان",
            "منيل هاني",
            "ميانة",
            "نزلة المشارقة",
            "نزلة المماليك",
            "نزلة خلف",
            "نزلة شاويش",
            "ننا",
            "مدينة أهناسيا"
        ];
        $parent = Location::where('name', 'اهناسيا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو شربان",
            "أم الجنازير",
            "البرانقة",
            "البكرية",
            "الجزيرة الشرقية",
            "السلطاني",
            "الشهيد حسن علام",
            "الضباعنة",
            "الفقاعي",
            "الملاحية",
            "الملاحية البحرية",
            "بني أحمد",
            "بني خليل",
            "بني عقبة",
            "بني عوض",
            "بني قاسم",
            "بني مؤمنة",
            "بني ماضي",
            "بني محمد الشرقية",
            "بني هاشم",
            "جبل النور",
            "جزيرة الفقاعي",
            "جزيرة ببا",
            "رزقة المشارقة",
            "زاوية الناوية",
            "سدس الأمراء",
            "صفط راشين",
            "طحا لبيشة",
            "طرشوب",
            "طنسا بني مالو",
            "طوة",
            "غياضة الشرقية",
            "غياضة الغربية",
            "قرية ملاحية سعيد جعفر",
            "قنبش الحمراء",
            "كفر جمعة",
            "كفر منصور",
            "كفر ناصر",
            "منشأة أبو دخان",
            "منية الجيد",
            "منيل موسى",
            "نزلة الزاوية",
            "نزلة الشريف",
            "نزلة علي كيلاني",
            "هربشنت",
            "هلية",
            "مدينة ببا"
        ];
        $parent = Location::where('name', 'ببا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "تزمنت الغربية",
            "دموشيا",
            "رياض",
            "شريف",
            "منقريش",
            "نزلة أبو سليم",
            "نزلة السعادنة",
            "نزلة معارك",
            "نعيم",
            "مدينة سمسطا"
        ];
        $parent = Location::where('name', 'سمسطا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبسوج",
            "أقفهص",
            "البرقي",
            "الجفادون",
            "الجمهود",
            "الحيبة",
            "الزاوية الخضراء",
            "الشقر",
            "الفنت",
            "الفنت الغربية",
            "القضابي",
            "القليعة",
            "الكنيسة",
            "بسفا",
            "بني صالح",
            "بني منين",
            "تلت",
            "دلهانس",
            "شنري",
            "صالح",
            "صفط الخرسة",
            "صفط العرفا",
            "صفط النور",
            "طلا",
            "عزبة تلت",
            "كفر درويش",
            "كفر منسابة",
            "منشأة السادات",
            "منشأة عمرو",
            "نزلة أقفهص",
            "نزلة البرقي",
            "نزلة حنا حنا",
            "مدينة الفشن"
        ];
        $parent = Location::where('name', 'الفشن')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End beni suif
         *********/



        /*******
        Start Al menia
         *********/
        $subs_cairo = [
            "مدينة المنيا",
            "مدينة المنيا الجديدة",
            "العدوة",
            "مغاغة",
            "بني مزار",
            "مطاي",
            "سمالوط",
            "المدينة الفكرية",
            "ملوي",
            "دير مواس",
            "مناطق فرعية بالمنيا",
            "كورنيش المنيا",
            "مدينة ملوي الجديدة"
        ];
        $parent = Location::where('name', 'المنيا')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أدمو",
            "الإسماعيلية",
            "البرجاية",
            "الحوارتة",
            "الحواصلية",
            "الخرابه",
            "المطاهرة البحرية",
            "بني حسن الأشراف",
            "بني حماد",
            "بني قمجر",
            "بني محمد سلطان",
            "بني مهدي",
            "بهدال",
            "تلة",
            "دماريس",
            "دمشاو هاشم",
            "دمشير",
            "ريدة",
            "زاوية سلطان",
            "زهرة",
            "سوادة",
            "شم القبلية",
            "صفط الخمار الأصلية",
            "صفط الخمار الشرقية",
            "صفط الخمار الغربية",
            "صفط اللبن",
            "طهنا الجبل",
            "طهنشا",
            "طوة",
            "طوخ الخيل",
            "ماقوسة",
            "منشأة الحواصلية",
            "منشأة الدهب البحرية",
            "منشأة الدهب القبلية",
            "مهدية",
            "نزلة الداودية",
            "نزلة الفلاحين",
            "نزلة حسين علي",
            "نزلة عبيد",
            "نزلة فرج الله متى",
            "ههيا",
            "أرض شلبي"
        ] ;
        $parent = Location::where('name', 'مدينة المنيا')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الحي الاول",
            "الحي الثاني",
            "الحي الثالث",
            "الحي الرابع",
            "الحي الخامس",
            "الحي السادس",
            "الحي السابع",
            "الحي الحرفي",
            "الحي الثامن",
            "المنطقة السياحية",
            "الحي المتميز",
            "حي النوادي",
            "المنطقة الترفيهية",
            "منطقة الامتداد بالمنيا الجديدة",
            "زهراء المنيا الجديدة",
            "كمبوند في المنيا الجديدة"
        ];
        $parent = Location::where('name', 'مدينة المنيا الجديدة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "الأقدام",
            "البجهور",
            "البسقلون",
            "الجهاد",
            "الشيخ مسعود",
            "العقلية",
            "القايات",
            "المسيد",
            "بان العلم",
            "برمشا",
            "بني عامر",
            "بني وركان",
            "زاوية برمشا",
            "سلاقوس",
            "صفانية",
            "عطف حيدر",
            "كفر المغربي",
            "كفر عبد الخالق",
            "كفر مهدي",
            "مفوز طيبة",
            "منشأة الزهري",
            "منشأة الساوي",
            "منشأة حلفا",
            "منشأة عبد الله لملوم",
            "نزلة رمضان",
            "العدوة"
        ];
        $parent = Location::where('name', 'العدوة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو بشت",
            "أطنيه",
            "إشنين النصارى",
            "البلعزتين",
            "التحرير",
            "الزورة",
            "العباسية الجديدة",
            "الكوم الأخضر",
            "برطباط",
            "بني خلف",
            "بني واللمس",
            "جزيرة شارونة",
            "حميدة الجندي",
            "دهمرو",
            "دير الجرنوس",
            "زاوية الجدامي",
            "شم البصل القبلية",
            "طنبدي",
            "عباد شارونة",
            "عزبة الصعايدة",
            "قفادة",
            "كفر الصالحين البحري",
            "كفر المداور",
            "كوم الحاصل",
            "ملاطية",
            "منشأة لملوم",
            "منشأة نيازي",
            "ميانة الوقف",
            "نزلة أحمد يونس",
            "نزلة أولاد الشيخ",
            "نزلة بلهاسة",
            "نزلة بني خلف",
            "نزلة دهروط",
            "نزلة شيحة"
        ];
        $parent = Location::where('name', 'مغاغة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبطوجة",
            "أبو العباس",
            "أبو جرج",
            "أشروبة",
            "أعطو الوقف",
            "أم الساس",
            "إبشاق الغزال",
            "البهنسا الغربية",
            "الجرنوس",
            "الجندية",
            "الحسينية",
            "السعدية",
            "السنارية",
            "الشيخ عطا",
            "الشيخ فضل",
            "القيس",
            "المودة",
            "الناصرية",
            "النجاح",
            "بردونة الأشراف",
            "بلة المستجدة",
            "بني صامت",
            "بني علي",
            "حماضة",
            "دير السنقورية",
            "ساقولة",
            "شلقام",
            "صفط أبو جرج",
            "صندفا",
            "طنبو",
            "كفر أبو العودين",
            "كفر الشيخ إبراهيم",
            "معصرة حجاج",
            "منشأة أبو عزيز",
            "منشأة الشيخ فضل",
            "منشأة القيسي",
            "منشأة اليوسفي",
            "منشأة بكير",
            "منشأة جلال",
            "نزلة الدليل",
            "نزلة جلف",
            "نزلة عمرو"
        ];
        $parent = Location::where('name', 'بني مزار')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبجاج الحطب",
            "أبو حسيبة",
            "أبو شحاتة",
            "أبو عزيز",
            "أبوان",
            "أدقاق المسك",
            "الاتلات",
            "الشيخ حسن",
            "برد نوها",
            "بني عمار",
            "جوادة",
            "حلوة",
            "سيلة الشرقية",
            "سيلة الغربية",
            "عزبة هوارة",
            "كفر الكوادي",
            "كفور الصولية",
            "كوم مطاي",
            "كوم والي",
            "مرزوق",
            "منبال",
            "منشأة لطف الله",
            "منشأة منبال",
            "نزلة أولاد الشيخ"
        ];
        $parent = Location::where('name', 'مطاي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "ابو سيدهم",
            "أسطال",
            "أطسا",
            "إبراهيم",
            "الاعتزاز",
            "البيهو",
            "التوفيقية",
            "الجزائر",
            "الجلاء",
            "الحتاحتة",
            "الحلمية",
            "الحمايشة",
            "الرخاء",
            "السرارية",
            "السلام",
            "السوبي",
            "الشراينة",
            "الشعراوية",
            "الشيخ عبد الله",
            "الطيبة",
            "العزيمة",
            "العلا",
            "العوايسة",
            "الغرباوي",
            "القطوشة",
            "الوفاء",
            "بني الحكم",
            "بني غني",
            "بوجة",
            "جبل الطير",
            "حسن",
            "دلقام",
            "دير جبل الطير",
            "دير سمالوط",
            "ساقية داقوف",
            "شوشة",
            "طحا العمدة",
            "طرفا",
            "عزبة القمادير",
            "عزبة حمد أبوزيد",
            "قلوصنا",
            "كوم الراهب",
            "كوم اللوفي",
            "منشأة بديني",
            "منشأة منقطين",
            "منشية الشريعي",
            "منقطين",
            "نزلة العمودين",
            "نزلة شادي"
        ];
        $parent = Location::where('name', 'سمالوط')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "أبو قلتة",
            "أتقا",
            "أم قمص",
            "إبشادات",
            "الأشمونين",
            "الإدارة",
            "البراجيل",
            "البرشا",
            "البركة",
            "البياضية",
            "الحرية",
            "الروضة",
            "الروضة بلد",
            "الريرمون",
            "السواهجة",
            "الشيخ حسين",
            "الشيخ زياد",
            "الشيخ شبيكة",
            "الشيخ عبادة",
            "العرين بحري",
            "العرين قبلي",
            "المحرص",
            "المعصرة بحري",
            "بني حافظ",
            "بني خالد",
            "بني روح",
            "تندة",
            "تونة الجبل",
            "جلال الشرقية",
            "دروة",
            "دير أبو حنس",
            "دير البرشا",
            "ديروط أم نخلة",
            "سنجرج",
            "شعراوي",
            "عزبة جلال",
            "عزبة مصطفى حمدي",
            "قصر هور",
            "قلبا",
            "قلندول",
            "منشأة المغالقة",
            "منشأة سيف النصر الشرقية",
            "منشأة سيف النصر محمد",
            "نجع مركب",
            "نزلة تندة",
            "نزلة تونة",
            "نزلة حمزاوي",
            "نزلة شرموخ",
            "نواي",
            "هور"
        ] ;
        $parent = Location::where('name', 'ملوي')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "أبو خلقة",
            "أسمو العروس",
            "البدرمان",
            "الحاج قنديل",
            "الرحمانية",
            "السوالم",
            "العمارية",
            "العمارية الشرقية",
            "النصرية",
            "بني حرام",
            "بني سالم",
            "بني عمران",
            "تانوف",
            "تل بني عمران",
            "جزيرة تل بني عمران",
            "دلجا",
            "زعبرة",
            "طوخ",
            "عزب تل بني عمران",
            "كفر خزام",
            "منشأة خزام الغربية",
            "منشأة سمهان",
            "نزلة أولاد مرجان",
            "نزلة البدرمان",
            "نزلة الحسايبة",
            "نزلة سعيد",
            "نزلة عبد المسيح",
            "نزلة محمود"
        ];
        $parent = Location::where('name', 'دير مواس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End Al-menia
         *********/




        /*******
        Start wadi geded
         *********/
        $subs_cairo = [
            "الواحات الخارجه",
            "باريس",
            "موط",
            "الفرافرة",
            "مدينة الوادى الجديد",
            "واحة الداخلة"
        ];
        $parent = Location::where('name', 'الوادي الجديد')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "حي الامل",
            "حي المروة",
            "حي الزهور",
            "حي الصفا",
            "حي المعلمين",
            "حي طريق الداخلة",
            "حي شمال ناصر",
            "حي ميتالكو",
            "حي الثانوية",
            "حي البساتين",
            "حي المتحف",
            "حي التعمير",
            "حي الاقتصادي",
            "قرية الشركة",
            "قرية بولاق",
            "مركز باريس",
            "قرية بغداد",
            "قرية فلسطين"
        ];
        $parent = Location::where('name', 'الواحات الخارجه')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "تنيدة",
            "بلاط",
            "البشندى",
            "عزبة الشيخ مفتاح",
            "أسمنت",
            "الشيخ والي",
            "موط",
            "الهنداو",
            "الراشدة",
            "القلمون",
            "القضا",
            "الجديدة",
            "العوينة",
            "بدخلو",
            "عزب القصر",
            "القصر",
            "غرب الموهوب"
        ];
        $parent = Location::where('name', 'واحة الداخلة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }

        /*******
        End wadi geded
         *********/







        /*******
        Start qalioub
         *********/
        $subs_cairo = [
            "مسطرد",
            "مدينة بنها",
            "كفر شكر",
            "طوخ",
            "القناطر الخيرية",
            "شبين القناطر",
            "الخانكة",
            "قليوب",
            "شبرا الخيمة",
            "الخصوص"
        ];
        $parent = Location::where('name', 'القليوبية')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "مدينة بنها",
            "الرملة",
            "الشموت",
            "بتمدة",
            "جزيرة بلى",
            "جمجرة",
            "دجوى",
            "شبلنجة",
            "طلحة",
            "فرسيس",
            "كفر أبو زهرة",
            "كفر الأربعين",
            "كفر الحصة",
            "كفر الحمام",
            "كفر الشموت",
            "كفر الشيخ أبراهيم",
            "كفر سعد",
            "كفر سندنهور",
            "كفر طلحة",
            "كفر عطالله",
            "كفر مويس",
            "مجول",
            "منشأة أبو دياب",
            "منشأة بنها",
            "منية السباع",
            "ميت العطار",
            "ميت راضى",
            "ميت عاصم",
            "نقباس",
            "كفر الجزار"
        ] ;
        $parent = Location::where('name', 'مدينة بنها')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة كفر شكر",
            "أسنيت",
            "البقاشين",
            "الزمرونية",
            "الشقر",
            "الصفين",
            "المنشأة الصغرى",
            "المنشأة الكبرى",
            "برقطا",
            "عزبة الشيخة فاطمة",
            "كفر الشهاوى خاطر",
            "كفر الولجا",
            "كفر تصفا",
            "كفر رجب",
            "كفر صليب سلامة",
            "كفر عبد السيد نوار",
            "كفر عرب غنيم",
            "كفر على شرف الدين",
            "كفر كردى",
            "كفر مروان",
            "كفر منصور",
            "كفور عامر و رضوان",
            "ميت الدريج"
        ];
        $parent = Location::where('name', 'كفر شكر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة طوخ",
            "أجهور الكبرى",
            "أكياد دجوى",
            "أمياى",
            "الأبيارى",
            "الحصة",
            "الحصوة",
            "الدير",
            "السفاينة",
            "السيفا",
            "الصالحية",
            "العبادلة",
            "العريضة",
            "العمار الكبرى",
            "الغزاوية",
            "المنزلة",
            "برشوم الصغرى",
            "برشوم الكبرى",
            "ترسا",
            "جزيرة الأحرار",
            "خلوة سنهرة",
            "دندنا",
            "زاوية بلتان",
            "سرى",
            "سنهرة",
            "شبرا حارس",
            "طنط الجزيرة",
            "عرب الرواشدة",
            "عرب الغديرى",
            "قرقشندة",
            "كفر الجمال",
            "كفر الحدادين",
            "كفر الحصافة",
            "كفر الرحالات",
            "كفر العمار",
            "كفر الفقهاء",
            "كفر النخلة",
            "كفر حسن سعد",
            "كفر شومان",
            "كفر علوان",
            "كفور عابد",
            "كوم الأطرون",
            "كومبتين",
            "مشتهر",
            "منشية العمار",
            "منصورة نامول",
            "ميت كنانه",
            "نامول",
            "كفر منصور"
        ];
        $parent = Location::where('name', 'طوخ')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة القناطر الخيرية",
            "أبوالغيط",
            "أجهور الصغرى",
            "الأخمين",
            "البرادعة",
            "العامرية",
            "المنيرة",
            "باسوس",
            "بهادة",
            "سندبيس",
            "شبرا شهاب",
            "عزبة الاهالى",
            "قرنفيل",
            "كفر الشرفا الغربى",
            "كفر سليم",
            "كفر عليم"
        ];
        $parent = Location::where('name', 'القناطر الخيرية')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة شبين القناطر",
            "الأحراز",
            "الجعافرة",
            "الحزانية",
            "الحساينة",
            "الحصافة",
            "الزهويين",
            "السلمانية",
            "الشوبك",
            "العطارة",
            "الغريرى",
            "القشيش",
            "القلزم",
            "الكوم الأحمر",
            "المريج",
            "تل بنى تميم",
            "طحانوب",
            "طحوريا",
            "عرب الشعارة",
            "عرب الوالحة",
            "كفر الدير",
            "كفر الشرفا القبلى",
            "كفر الشوبك",
            "كفر الشيخة سالمة",
            "كفر الصهبى",
            "كفر سعد بحيرى",
            "كفر سليمان الور",
            "كفر سندوة",
            "كفر شبين",
            "كفر طحا",
            "كفر طحوريا",
            "كوم السمن",
            "منشأة الكرام",
            "منية شبين",
            "نزلة عرب جهينة",
            "نوب طحا",
            "نوى"
        ];
        $parent = Location::where('name', 'شبين القناطر')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة الخانكة",
            "23 يوليو",
            "ابو زعبل",
            "الجبل الأصفر",
            "القلج",
            "المنايل",
            "المنية",
            "سندوة",
            "عرب العليقات",
            "عرب العيايدة",
            "كفر حمزة",
            "كفر عبيان",
            "مزرعة الجبل الأصفر"
        ];
        $parent = Location::where('name', 'الخانكة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "مدينة قليوب",
            "الأصلاح الزراعى",
            "السد",
            "الصباح",
            "بلقس",
            "حلابة",
            "زاوية النجار",
            "سنديون",
            "صنافير",
            "طنان",
            "قلما",
            "كفر أبو جمعة",
            "كفر رمادة",
            "كوم أشفين",
            "منطى",
            "ميت حلفا",
            "ميت نما",
            "ناى"
        ] ;
        $parent = Location::where('name', 'قليوب')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "بهتيم",
            "مدينة شبرا الخيمة",
            "بيجام"
        ];
        $parent = Location::where('name', 'شبرا الخيمة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "عزبة النخل",
            "مدينة الخصوص"
        ] ;
        $parent = Location::where('name', 'الخصوص')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        /*******
        End qalioub
         *********/


        /*******
        Start ganoub sainaa
         *********/
        $subs_cairo = [
            "أبو رديس",
            "أبو زنيمة",
            "نويبع",
            "طابا",
            "دهب",
            "مدينة جنوب سيناء",
            "سانت كاترين",
            "طور سيناء"
        ];
        $parent = Location::where('name', 'جنوب سيناء')->first();
        foreach ($subs_cairo as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة أبو رديس",
            "وادى فيران"
        ];
        $parent = Location::where('name', 'أبو رديس')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة أبو زنيمة",
            "غرندال",
            "الرملة"
        ];
        $parent = Location::where('name', 'أبو زنيمة')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items =[
            "مدينة نويبع",
            "المزينة",
            "الشيخ عطية"
        ] ;
        $parent = Location::where('name', 'نويبع')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة سانت كاترين",
            "طرفة",
            "المروة",
            "وادى الراحة",
            "أبو سيلة",
            "السعال"
        ];
        $parent = Location::where('name', 'سانت كاترين')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }


        $items = [
            "مدينة طور سيناء",
            "الوادى",
            "الجبيل"
        ];
        $parent = Location::where('name', 'طور سيناء')->first();
        foreach ($items as $item) {
            DB::table('locations')->insert([
                'name' => $item,
                'parent_id' => $parent->id,
                'series' => $parent->series +1,
            ]);
        }



        /*******
        End ganoub sainaa
         *********/



    }
}
